{
  "answered": true,
  "business_phone_number": "+19252386347",
  "customer_city": "East Bay - Mn Piedmont",
  "customer_country": "US",
  "customer_name": "LOPEZ JUAN     ",
  "customer_phone_number": "+15104578897",
  "customer_state": "CA",
  "direction": "inbound",
  "duration": 218,
  "id": "CAL019bc8519eb9745caa89ea4a7cb7c3ee",
  "recording": "https://api.callrail.com/v3/a/ACC2572dc258af24a36a5f230a177c8820b/calls/CAL019bc8519eb9745caa89ea4a7cb7c3ee/recording",
  "recording_duration": 213,
  "recording_player": "https://app.callrail.com/calls/CAL019bc8519eb9745caa89ea4a7cb7c3ee/recording?access_key=f2a0afe9c62ae6798b21",
  "start_time": "2026-01-16T11:39:10.864-08:00",
  "tracking_phone_number": "+15105714781",
  "voicemail": false,
  "lead_score": null,
  "lead_explanation": null,
  "company_id": "COMa3ac172de19f487a864510244921752b",
  "company_name": "Rhino ADU / Garage Builder",
  "transcription": "Hello. Good morning. Hi. Good morning. Is this ADU Builders? Yes, it is. May I know who's calling, please? Oh, yes. My name is Juan. I'm calling because I'm trying to convert a two-car garage into an ADU, and I was hoping to get an estimate done. Okay. Okay. Hold on a second. So two-car garage to an ADU. What city are you located? Hayward. Okay. All right. Yeah, we can definitely help you out with your project. We'd like to do a site visit first before we can give you an estimate. So I was wondering if you would be available. Let's see here. If you'd be available this Monday? Yes. It's a holiday, but we're still working. Oh, yeah. Good point. Well, I'd have to take my kids with me. Okay. Let's do Tuesday. Tuesday. Okay. That works better. Yeah, and I'm available, you know, the hours pretty much morning on, I'm available, but I do have to pick up my kids around two o'clock. Oh, no worries. We can come out at 10 a.m. Is that okay? Yes. Okay. And can I please get the complete address? Yes. It's 1166 Kimball Avenue. Okay. Hayward. And what is your first and last name? Yes, it's Juan. J-U-A-N. Okay. Last name Lopez. L-O-P-E-Z. Okay. All right. And Juan, what's a good phone number to reach you? Yes, it's 510-457-8897. And an email address as well, please? Sure. The name Daniel. And then the letter Y. Daniel again. Jr. J-R at gmail.com. Perfect. Thank you for that. Okay. So it's one, the address is 1166 Kimball Avenue in Hayward. And okay. You're the homeowner, right? Yes. Okay. All right. Perfect. So we'll set it up for Tuesday on the 20th at 10 a.m. And I'll be sending you a text confirmation for that appointment. And all right. Well, we'll see you then. And then after we come out there, we can send you an estimate. Perfect. And so you also handle like the design work? Yes. We can also, we're a design and build company. So we can also help you out with the design stages. Oh, fantastic. Perfect. Thank you so much. All right. Thank you. Okay. Bye-bye. You have a wonderful day. Okay. Bye-bye. You too. Bye-bye. Okay. Bye.\n",
  "tags": [],
  "note": null,
  "source": "Oakland ADU Builder & Room Addition",
  "keywords": null,
  "campaign": null
}