{
  "answered": true,
  "business_phone_number": "+19252386347",
  "customer_city": "Concord",
  "customer_country": "US",
  "customer_name": "THE HOME DEPOT",
  "customer_phone_number": "+19257989600",
  "customer_state": "CA",
  "direction": "inbound",
  "duration": 250,
  "id": "CAL019c01b0ff977cd8b696d04c32a9891e",
  "recording": "https://api.callrail.com/v3/a/ACC2572dc258af24a36a5f230a177c8820b/calls/CAL019c01b0ff977cd8b696d04c32a9891e/recording",
  "recording_duration": 243,
  "recording_player": "https://app.callrail.com/calls/CAL019c01b0ff977cd8b696d04c32a9891e/recording?access_key=8da831f2bab87c0d641b",
  "start_time": "2026-01-27T15:01:42.862-08:00",
  "tracking_phone_number": "+19252302554",
  "voicemail": false,
  "lead_score": null,
  "lead_explanation": null,
  "company_id": "COM3d2fe52ea4a3454ab10743632f97a14c",
  "company_name": "RB Production",
  "transcription": "Hello. Hi, good afternoon. This is Ruth with the Concord Home Depot. I have here Rudy doing a phone sale of $603.98, and he has two different transactions, so this is the first transaction. I'm ready for your credit card. Okay, can I ask a favor? Could you please put on the, what do you call this, job address, plus his name right next to it? Okay, because he has it on the job name, 3266 Claudia Drive. Do you want me to put Rudy, too? Yes, please. Okay, I'm ready for your credit card. All right, we have a card on file. Okay, we actually have the last four is 1020. Okay, one second. What card do you have? Do you have a Home Depot card? It's American Express. We have a rewards card number. Okay, can I get the last four? 1020. Montagnier Expiration, 0830. Okay. Okay, on this other, one second. Okay, on this other purchase, what's that again? One second, I have another purchase. Okay, and this one, one second, let me check this. One second, please, I'm so sorry. Okay, on this second transaction, the total is $679, and do you want me to put Rudy, too, on the name, close to the address, or no? Yes, yes. Okay. Okay, one more time, the last four numbers? 1020. Montagnier? 0830. Thank you so much. Have a good day. Thank you. Okay, all right, bye-bye.\n",
  "tags": [],
  "note": null,
  "source": "Outbound",
  "keywords": null,
  "campaign": null
}