{
  "answered": true,
  "business_phone_number": "Softphone",
  "customer_city": "Goshen",
  "customer_country": "US",
  "customer_name": "VIEWRAIL       ",
  "customer_phone_number": "+15745014642",
  "customer_state": "IN",
  "direction": "inbound",
  "duration": 335,
  "id": "CAL019bc35f32bc7772982b9adfefe611a0",
  "recording": "https://api.callrail.com/v3/a/ACC2572dc258af24a36a5f230a177c8820b/calls/CAL019bc35f32bc7772982b9adfefe611a0/recording",
  "recording_duration": 315,
  "recording_player": "https://app.callrail.com/calls/CAL019bc35f32bc7772982b9adfefe611a0/recording?access_key=ae8517314260e835d0cc",
  "start_time": "2026-01-15T12:35:54.644-08:00",
  "tracking_phone_number": "+19252302554",
  "voicemail": false,
  "lead_score": null,
  "lead_explanation": null,
  "company_id": "COM3d2fe52ea4a3454ab10743632f97a14c",
  "company_name": "RB Production",
  "transcription": "Hello, this is Roli. Hello, this is Andrea calling from ViewRail. I'm responding to a form submission for a cable railing quote request that we received on the ViewRail website. Yes, from Shea. Okay. I was just calling to follow up on that a little bit. The next thing that we would need as far as getting a formal quote together would be some additional information about that. But I can start out by sending a follow-up email with some of the information about our system. Some of the details don't line up 100% with what was requested, but I can show you what we do have and what our options are. And that would also include a list of additional information that would help us to build out a formal quote. Can I send out a floor plan for you guys to use for reference? Can you send out a what? A what? We have floor plans of the house. Oh, perfect. Yes, that would be exactly what we would need as long as there's something on it that we can scale if the measurements aren't on there specifically. And then yes, we could go ahead based on that. Can I ask you some detail type questions about the project? I'm not sure if I can answer those, but okay. All right. You'll do your best, right? Yeah. I did see that they are requesting specifically all black hardware, and it says black cable. Do you know, do they want everything black? Yes, they want everything black. Okay. Then I would recommend that we give you a quote for our Onyx rod system. We don't have a black cable option because it's been our experience that whatever you use to make the cable black eventually wears off just because of the flexibility of the cable. But we do have a quarter inch, so similar profile, quarter inch stainless steel rod that is powder coated black. And that would be, you know, we can send it with a black post, black hardware, black infill and everything. But that doesn't wear it off, right? Or you're just saying what does it mean? Well, it comes with a five year finish warranty. And I'm looking here. Oh, discovery base. So it is not anywhere near the Pacific Ocean. And with it's within five miles of the Pacific Ocean, we do have some additional things that we can do to help preserve the life of the railing. But no, it's a powder coat, so it has really good lasting ability because it's on a stable one quarter inch rod as opposed to a cable that flexes. That would just be what I would recommend to have a totally black system, to have the black infill and the black post and the black handrail. I'll try to speak with the owner of the house if they're hoping for the cable to be, you know, not black. If he's stubborn about it, then we'll go with that. Right. Well, I'll send in that email. Do you want me to include you on it as well or will it go to you if I send it to the email and file at my role? Yeah, that's me. My role, Rhino Builders. OK, that was the email that was given then. And then just the shade was the name. I'll include a railing buyer's guide that will outline some of those options. And I'll also include our ICC report. That's our strength and safety testing for our system for some additional review. And then if you send the plans, we can go ahead and sort of preemptively prepare a quote for black onyx rods and go from there. OK. Once you send in that email, I'll also send in the floor plans. What was that last part? I'll also send back the floor plans. Perfect. Perfect. OK. That sounds good. And is there a specific timeline on this? Are they looking to move super quickly or within the next month? OK. Very good. All right. That sounds good. I will go ahead and get this introductory email and information out to you. And then when we get that plan back, we can work on that quote. All right. OK. Thank you. All right. Thank you. Bye. All right. Bye.\n",
  "tags": [],
  "note": null,
  "source": "ROLLE- Lead Center",
  "keywords": null,
  "campaign": null
}