{
  "answered": true,
  "business_phone_number": "+19252386347",
  "customer_city": "Sunol",
  "customer_country": "US",
  "customer_name": "SUNOL CA       ",
  "customer_phone_number": "+19252331607",
  "customer_state": "CA",
  "direction": "inbound",
  "duration": 86,
  "id": "CAL019bc86727d77878ad102b01f9bfc48e",
  "recording": "https://api.callrail.com/v3/a/ACC2572dc258af24a36a5f230a177c8820b/calls/CAL019bc86727d77878ad102b01f9bfc48e/recording",
  "recording_duration": 76,
  "recording_player": "https://app.callrail.com/calls/CAL019bc86727d77878ad102b01f9bfc48e/recording?access_key=ac0162f993cc9a27a122",
  "start_time": "2026-01-16T12:02:42.228-08:00",
  "tracking_phone_number": "+19253964532",
  "voicemail": false,
  "lead_score": null,
  "lead_explanation": null,
  "company_id": "COM1f45fa45c32c4ca6a05a89c716bd0698",
  "company_name": "Rhino Concrete",
  "transcription": "Hello, good afternoon. Yes. Hi. Hello. This is Sam. I'm calling from NICEJAB on the recorded line. I was actually searching for concrete contractor in the area and came across Rhino Retaining Walls and Pavers. I can see that you guys provided fantastic service with five stars rating on your page, so congratulations. However, only a few reviews here on your page, so I'm just wondering if you normally ask your customers to have a review or you simply leave it up to them. I don't know. What exactly is the purpose of your call? I don't understand what your purpose is. Yeah. Actually, I'm not sure if you're aware that you rated five stars on your Google page. Am I talking to the owner? No, you're not. But what is the purpose of your call? I can address it. Yeah. It's actually, as I mentioned earlier, it's actually the Google page. We know that. We'll just send an email. Yes, we know that. Yeah, we'll just send an email directly to the owner. Okay. Thank you for your time. Have a good day. All right. \n",
  "tags": [],
  "note": null,
  "source": "Rhino Retaining Walls & Pavers Oakland",
  "keywords": null,
  "campaign": null
}