{
  "answered": true,
  "business_phone_number": "+19252629332",
  "customer_city": "Manchaca",
  "customer_country": "US",
  "customer_name": "HOLMES REGINA  ",
  "customer_phone_number": "+15125295988",
  "customer_state": "TX",
  "direction": "inbound",
  "duration": 198,
  "id": "CAL019c1f708dee73608d36f98ad1bcfbed",
  "recording": "https://api.callrail.com/v3/a/ACC2572dc258af24a36a5f230a177c8820b/calls/CAL019c1f708dee73608d36f98ad1bcfbed/recording",
  "recording_duration": 196,
  "recording_player": "https://app.callrail.com/calls/CAL019c1f708dee73608d36f98ad1bcfbed/recording?access_key=6cc07d0d7feffa5b8cf6",
  "start_time": "2026-02-02T09:39:55.983-08:00",
  "tracking_phone_number": "+19256903038",
  "voicemail": false,
  "lead_score": null,
  "lead_explanation": null,
  "company_id": "COM1660768019b8465f836610da3a0e58d1",
  "company_name": "Rhino Builders",
  "transcription": "Please hold for the next available agent. Hello. Good morning. Hi. I'm calling because we have a few house projects that I wanted to get a quote on. Like we wanted the walls inside painted, and then we have an outside deck that leaks a lot of water that we wanted to get a roof put on or something, kind of see what you all think is best. And then we have another area that has a similar problem. You mentioned that it's like multiple houses or a few houses? No, it's one house, but multiple projects in the same house. Oh, I see. Okay. Alrighty. So basically, so you can you repeat the scope of work that needs to be done? We want to get the walls inside painted. I really want to redo our bathroom closet doors. And then outside we have a patio, and the wood needs a roof on top. Oh, got it. And how big is that structure that needs a roof on top? Do you know like the estimate? I don't, but if someone can come out and give us a quote, that would be best, because I don't know anything about it. All right. And what city are you located? Pleasant Hill. Pleasant Hill. Okay. Hold on a second. Let me check my calendar. One second. Oh, it's already February. Okay. I know how time flies. We do have an opening on Wednesday, the 4th, at 10 o'clock. Will that work for you? Yes. Okay. All right. Perfect. And can I get your first and last name, please? Regina Holmes. Your Holmes is H-O-L-M-E-S? Correct. Okay. And what's the property address, Regina? It's 68 Exeter E-X-E-T-E-R Lane, 94523. All right. And also, what's a good phone number to reach you? 512-529-5988. So 512-529-5988, correct? Correct. Okay. And lastly, what's your email address? It's happy, H-A-P-P-Y, G-G-G-I-G-I-2020 at gmail.com. All right. That's happy, G-G-2-0 at gmail.com, correct? Yes. Okay. Perfect. All right. So I'm going to set you up for Wednesday at 10 o'clock, and you'll get a text confirmation for this appointment. All right? Great. Thank you. Thank you so much. You have a wonderful day. You too. Bye-bye. I'll see you. Bye-bye.\n",
  "tags": [],
  "note": null,
  "source": "Pleasant Hill GMB",
  "keywords": null,
  "campaign": null
}