{
  "answered": true,
  "business_phone_number": "+19254305757",
  "customer_city": "San Francisco",
  "customer_country": "US",
  "customer_name": "LITKE PROPS    ",
  "customer_phone_number": "+14159220178",
  "customer_state": "CA",
  "direction": "inbound",
  "duration": 267,
  "id": "CAL019be2071c38732c86114ad8faba6eee",
  "recording": "https://api.callrail.com/v3/a/ACC2572dc258af24a36a5f230a177c8820b/calls/CAL019be2071c38732c86114ad8faba6eee/recording",
  "recording_duration": 256,
  "recording_player": "https://app.callrail.com/calls/CAL019be2071c38732c86114ad8faba6eee/recording?access_key=de66829a4fec0cd810c0",
  "start_time": "2026-01-21T11:27:47.788-08:00",
  "tracking_phone_number": "+14159851961",
  "voicemail": false,
  "lead_score": null,
  "lead_explanation": null,
  "company_id": "COM63ab9a768c144f4fb3e8870171035e06",
  "company_name": "Rhino Windows & Siding",
  "transcription": "for the next available agent. ♪♪ Hello, good morning. Hello, is this Rhino Siding and Window Replacement? Yes, it is. Who's calling, please? Hi, this is Trey calling from Lickheap Properties. I'm inquiring for a siding installation, actually, for a new building that we're working on. Do you guys offer quotes for that? We do, but are you a contractor? We own the lot and we're working on it. Well, one of our team is basically the general contractor for it, yeah. Oh, okay, but you just need somebody to do the siding for you. That's correct, yeah. And can you tell me what's the extent of the siding that needs to be, is this a replacement or a new siding? New siding. Okay, and what's the square footage of that siding? Or maybe like how many, is it just one house or is it a commercial building? It's a commercial building, but the siding is going to be actually on the fourth floor. Oh, wow. So the entire fourth floor? Just on the side of the building. Okay. So not the front and back, just kind of like the left and right side. Oh, left and right. And what type of siding do you want to install? Just slab siding. I'm sorry, a slab? Yeah. Okay. All right, what city are you located? San Francisco. San Francisco, okay. All right, let me check my calendar. San Francisco, I do believe I have somebody out there on Monday. We can come out in the afternoon, say around 1 p.m. So actually, we're working on, it's basically under construction right now, and we're kind of working towards getting the exterior done. So it's still in the process. We just reached cement floor on the first floor, on the ground level. So we're just, basically we're going to start framing up, and so we pretty much are just collecting quotes to get the exterior done, if that makes sense. There's nothing to look at. I have the plans. Okay, so it's not built yet. Yeah, it's not built yet, but we're just aligning all the contractors to get the exterior done, if that makes sense. I see. Well, if that's the case, I think the best thing we can do right now is we need to see specifics. Like, I'm sure you have plans, right? Uh-huh, yeah, I have plans. If you could forward the plans to us, and then give us the exact specifications of the Scoble Fork, and then we'll take it from there. Okay, perfect. Can I get an email I can send the plans to? Yes, yes, it's office at rhinobuilders1989.com. Rhinobuilders1989. Rhinobuilders, builders is plural, right? Yeah, plural. Got it, so office at rhinobuilders1989.com. Yes. Okay, perfect. All right, let me go ahead and send the plans over, and please let me know if you have any questions. Yeah, what's your name? My name is Tree, it's spelled T-R-E-E. Okay, Tree, thank you so much, appreciate it. Thank you. Okay, you have a good one. You too, bye-bye. Bye-bye.\n",
  "tags": [],
  "note": null,
  "source": "Rhino Siding & Window Replacement",
  "keywords": null,
  "campaign": null
}