{
  "answered": true,
  "business_phone_number": "+19252629589",
  "customer_city": "East Bay - Mn Piedmont",
  "customer_country": "US",
  "customer_name": "LOPEZ JUAN     ",
  "customer_phone_number": "+15104578897",
  "customer_state": "CA",
  "direction": "inbound",
  "duration": 198,
  "id": "CAL019bfc58ab87795186705303d7046846",
  "recording": "https://api.callrail.com/v3/a/ACC2572dc258af24a36a5f230a177c8820b/calls/CAL019bfc58ab87795186705303d7046846/recording",
  "recording_duration": 195,
  "recording_player": "https://app.callrail.com/calls/CAL019bfc58ab87795186705303d7046846/recording?access_key=7a48233635080f9b7784",
  "start_time": "2026-01-26T14:07:08.134-08:00",
  "tracking_phone_number": "+19254773171",
  "voicemail": false,
  "lead_score": null,
  "lead_explanation": null,
  "company_id": "COM1660768019b8465f836610da3a0e58d1",
  "company_name": "Rhino Builders",
  "transcription": "Please hold for the next available agent. This call is being recorded. Hello, this is Roli. Yes, hi. I need to cancel an appointment that I have tomorrow with one of your estimators. Oh, sure thing. What time was it again? It's at 10 in the morning. 10 in the morning. Hold on, let me check. It should be under Juan. Yes, I see it. Juan Lopez, garage conversion and ADU. Yes, correct. Do you want me to reschedule or just have it canceled? I do need the estimate. The thing is I'm having the property appraised and the appraiser, this is what he decided to book it. So I will be in the area. You know, it's just that I don't know how big the window is for the person coming out. But the appraisal is supposed to happen between 10. He's appraising my primary residence and then also that duplex. So I just don't know, you know, if I'll be in the area on time. Yeah, so I think I'll call back. But I'll let you know that tomorrow by 12 and 2 to 3, we're open by that time. Just in case that you need. Oh, you have an opening at 12? Yes. Yes, we do. Okay. That might work better. You want me to reschedule right now just to confirm that it's on 12? The thing is, I don't know how, you know, this is my first time working with this appraiser. And I don't know how punctual he'll be. So if he's saying he'll be here at 10. Yeah, he'll be here at 10 in the morning in San Leandro to appraise my primary residence. And he's saying that takes about maximum an hour. So, which means that I would be, we would be heading over to the Hayward property around 11. Right. And then I could just stay there until noon. That would not be a problem. You know, but if this guy decides to not show up at 10 and show up later. It might get, yeah. Exactly. It might get complicated. Yeah. So I don't want to, you know, I don't want to waste your time. So I think what I'll do is I'll just call back and reschedule when I have a better idea. Because I need to check my schedule for next week also. All right. Okay. No worries. Yes. I apologize. Thank you. It's okay. Thank you. Thank you. Bye-bye. All right. Bye.\n",
  "tags": [],
  "note": null,
  "source": "Rhino Builder Website Number",
  "keywords": null,
  "campaign": null
}