{
  "answered": true,
  "business_phone_number": "Softphone",
  "customer_city": "East Bay - Berkeley",
  "customer_country": "US",
  "customer_name": "BPX PRINTING   ",
  "customer_phone_number": "+15105598299",
  "customer_state": "CA",
  "direction": "inbound",
  "duration": 279,
  "id": "CAL019be7dde9997eff9815536d3c26f14e",
  "recording": "https://api.callrail.com/v3/a/ACC2572dc258af24a36a5f230a177c8820b/calls/CAL019be7dde9997eff9815536d3c26f14e/recording",
  "recording_duration": 266,
  "recording_player": "https://app.callrail.com/calls/CAL019be7dde9997eff9815536d3c26f14e/recording?access_key=c27570111e00ba7737e6",
  "start_time": "2026-01-22T14:40:38.775-08:00",
  "tracking_phone_number": "+19252302554",
  "voicemail": false,
  "lead_score": null,
  "lead_explanation": null,
  "company_id": "COM3d2fe52ea4a3454ab10743632f97a14c",
  "company_name": "RB Production",
  "transcription": "Hello? This is Roley. Hey, Roley. Hey, this is Danny at BPX Printing. How are you? I'm good. How are you? Good. Okay, you sent this job over that you wanted us to quote you all for first. Now, it's only like two sheets. You want these in color or black and white? In color. Okay. So, and then it looks like the 8 and a half by 11s, it looks like that's like a job card that we print on, like double-sided on cardstock. That for sure is black and white for the job card. Yeah, yeah, that's all black and white, yeah. But the sheets has like stamps on them and stuff. And you're trying to get these delivered to Orenda or shipped or, I mean, Yeah, we want it shipped to 13 Carmen, Orenda. Yeah, when did you, how soon do you need these to get over there? As soon as you can get them delivered. Maybe now or tomorrow morning. Well, I'd have to, if I ship them out, they get to tomorrow probably by 1030. If we drive them over, I don't, I can't drive it over today. My drivers are all out tied up and I don't know what time tomorrow we will be able to get out to Orenda. So I can give you a quote for the printing and verbally tell you what we were charged to drive it over or how much it would cost to ship it overnight. If you want, I can work this pricing out and give you a call back in probably like 10 minutes or so. Okay, I'll just wait for the paper because I need that forwarded to my boss. I can't just say it in verbal. Okay, so you need me to email it to you? Yeah. Okay. So how do you want me to email you, with the shipping or with the delivery? It doesn't matter. It doesn't matter. Because it would be more to deliver it. I mean, I'm sorry, it would be more to ship it. So I can just give you the shipping price, which would be a little bit more, and then you can give me a call and let me know if you want to ship. I can just tell you now, okay, so delivery would be like $27 for shipping it overnight. And if I drive it out there, it would be $15 plus $7.95 for the fuel charge. So you're looking at $27 or $24.75 or $24.95. So it's pretty much not much of a difference for driving and shipping it. It's just a matter of getting it there at a specific time. Okay, so can you say that again? It's either $27? $27 to ship it overnight, and it should be there by like, it's going over into maybe 10.30 a.m., 11 o'clock at the latest. And if we deliver it, I charge $15 to deliver to like outside of our area, which is over into, and then it would be a $7.95 fuel charge for driving it there. So you're looking at $15 plus $7.95, so $22.95 or $27. Got it, okay. I think it's just a few dollars difference, but we're not really that in a hurry. Maybe we'll just go with that. With us driving it over? Yeah. Okay, so I'll work you up a quote with us driving it over. And like I said, it could be 9.30 in the morning. It depends on how busy we are tomorrow morning. It could be sooner than, you know, 10.30, 11 o'clock. It could be sooner than that. Okay, it doesn't matter. And also, so, yeah, I know Danilo has, he's with Berkeley Concrete or Berkeley Construction. So we just use his account, and you will pay. Is that how you want to do it? Yes. That way, because I think he has like, he may have special prices. Okay, I'll wait for that. All right. Okay, thanks a lot. Thank you. Bye. You're welcome. Bye.\n",
  "tags": [],
  "note": null,
  "source": "Outbound",
  "keywords": null,
  "campaign": null
}