{
  "answered": true,
  "business_phone_number": "Softphone",
  "customer_city": "Tracy",
  "customer_country": "US",
  "customer_name": "AGUIRRE CITLALY",
  "customer_phone_number": "+12092377266",
  "customer_state": "CA",
  "direction": "inbound",
  "duration": 908,
  "id": "CAL019b996b0d827bed9db84a6f54efe818",
  "recording": "https://api.callrail.com/v3/a/ACC2572dc258af24a36a5f230a177c8820b/calls/CAL019b996b0d827bed9db84a6f54efe818/recording",
  "recording_duration": 895,
  "recording_player": "https://app.callrail.com/calls/CAL019b996b0d827bed9db84a6f54efe818/recording?access_key=60568c50fc18f62ba5bb",
  "start_time": "2026-01-07T09:04:48.478-08:00",
  "tracking_phone_number": "+19252302554",
  "voicemail": false,
  "lead_score": null,
  "lead_explanation": null,
  "company_id": "COM3d2fe52ea4a3454ab10743632f97a14c",
  "company_name": "RB Production",
  "transcription": "Hello. Hi, Roli and Jamie. I'm sure you knew that. I know. Anyway, I just got finished loading the machine calibrating. I'm waiting for all your files to download into this program. Estimated time is an hour and 18 minutes to print. Okay, that's fine. I'll just let my boss know that it will be around 10.30. 10.15 and the total will be 6.21 with everything. 6.21. Okay. And I want you to go online and look at $35.90 per page from FedEx. I did actually, yeah. So, we're all good. No, I'm hooking you all up. My wife just went in the room and I told her, I explained everything to her. She did not say one word to me. She just turned around and closed the door. So, that's what I just went through while I was waiting on the machine. Now, I'm just 65% downloading the PDFs into the program so I could size them and then start printing. My printer told me an hour and 18 minutes, but it'll probably be an hour and five because it does the cool down shit. But since these are blueprints, I don't have to wait for like the ink to dry like I do on canvas or, you know, because I could print anything. Foam boards when you need signs for, you know, construction. Oh, you do. I see because we also need signs, but I'm guessing you're really pretty busy. So, I'm not sure if we can do that. Well, no. If you've got the money, I got the time. You know what I'm saying? Yeah, yeah. I'm in the process of building boats. Did you ever go to my website? No, you didn't. I have to know what your website is. Can you send a link? Discoverybayprint.com. I see now why your company comes up first because that's the name, Discovery Bay Print, because that's how people usually type, just in your area. Okay, I see it. Well, you can see all the stuff I do. Like, go scroll down and you'll see the signs. In fact, I got a lot of, you know, I'm just not a little blueprint. No, I do some shit like signs that are 10, 15 foot in diameter, 100 foot in the air, that weigh thousands of pounds. And yeah. And if you go down to the boat one, you'll see the boats. They do vehicle wraps. All right. I'll let my boss know because I'm pretty sure he has a lot to print for construction and it's just around Discovery Bay. Like any sign, even I go like right now, I'm doing a sign for a supermarket in Alameda. And it's Neptune Plaza. I do web designs and all that good stuff. Anything advertisement, printing and signs. So does he do commercial or is he just focusing on residential right now? It's only for residential for now. I'm not sure in the future, but. Yeah, I'll get you some residents. Like me, I'm like for my buddy, my business partner in the boat, I'm building his ADU. Like, I'll go in there and in one week build an ADU for about seven grand. And everybody, dude, you can't do that. I'll fucking bat me in. With a smart toilet, with a smart toilet, you know, all frigging LED lighting. With seven grand. Yeah. And my buddy, before I helped him out, he had this guy, Daniel, helping him out. He charged him $22,000 for a 10 by 12 ADU with a bathroom that's crooked. I was like, dude, man, I'm going to build your ADU, the whole thing with a loft for less than 20K. And your bathroom is going to be, again, like superior compared to the other one, which it is. Are you sure about that? I think it's quite, well, it's affordable, it's cheap. Yeah, because if you know how to build, 70% of construction is in labor. It's true. So if my job, if it costs me 300 bucks to do something on construction, I'm charging you $1,000. So if I'm buying $300 worth of material, I'm charging you $1,000. If I go spend $500 in material, I'm charging you $1,500. That's how I calculate. And then if there's anything- But I'm not going to disclose that. Difficult, very difficult. No, it just depends. I could walk into a room and say, okay, I know when I tear apart that wall, all the electrical and plumbing's running through there. I know I'm going to have to cut the floor. My brain already dissects things when I walk into the room and I'm, you know, okay, you want this, this. I look at a plan and I'll be like, dude, we can't put the bathroom here. The bathroom needs to go over there. Why? Because then I got to run pipes all the way around the room and blah, blah, blah. Yeah, there's a lot to consider. You know, I could walk into a house. I don't even have to. I just, long as I know what side the utilities come on, where the clean out for the septic is, or the drainage for their house, I'll tell you where all the pipes run. Pretty much you can tell where everything goes. It's just common sense. If you're building, it's like, okay, I wouldn't run it this way and this way when, you know, the standards are this and this. You know, if you know the basics and the standards, then you could walk in somewhere. And not many people do that. I do. Are you an architect? Because I, I engineered security systems for, you know, major, you know, big companies. I'd go in there and set up hundreds of cameras, access control, you know, intercom systems, biometrics. I started off years ago doing regular. And then one day I got calls from all these grow companies up in Seattle and Oregon. And then for a few years worked my way all the way down here. And then one day on the way back from work in Oakland, from a warehouse I was doing there, I got into a accident, a dump truck from fucking Livermore pools and spas. The dude was on his phone and he hit me at like 60 miles an hour and broke my spine. So I was out of work for years and I couldn't get back into security because, you know, it's, it's a lot of clients, a lot of physical labor. So I wound up just buying a bunch of print stuff. And still like, like this is the first year that I've gone where I've had no major physical problem. I get back aches every once in a while, but. That sounds great. That sounds great. Usually it's, it comes and goes there, but I've had seven spine surgeries. It's, it was bad. It sucked. I'm telling you, it was miserable. And in the middle of that. So it was, it was a rough, it was a rough few years, you know, not working and all that good stuff too. And right now you're being a workaholic with all the printing and all the construction. Yeah. Now, now, especially since I, since I'm, you know, physically able to do other things. Now I'm installing cameras, I'm, I'm building signs. Now I got, I'm stuck with a couple of different types of businesses. You're multitasking now, there's a lot to do. Plus, if you go into services on my webpage, you go down and you'll see a link to my wife's website and you'll see all her, because she does music and artwork and, and that's what she does. So what a proactive team. She's, yeah, she's the one with all the power though. I'll, I'll inform my boss about the time. I'll let him know just maybe 10 minutes. As we speak, as we speak, I'm down and this thing is taking so, like, it is a, it's a very large file, but I think, I think I got it. Yeah. I'm, I'm looking at it here. I had to like micro, you know, reduce it so small so I can see all the files at one time and then I'll grab them. I'll start printing, but the printer just finished calibrating. As I was talking to you, I heard it just like, now it's going to be ready to go. It's not easy. Like if somebody comes and says they want vinyl stickers, it's going to take me nearly an hour and a half to change the paper, put the paper in, calibrate it for that substrate. It's, it's not easy. That's what I'm saying. I had to set up for, for vinyl. I was doing vinyl the other, the other day. And so when you called me this morning, I was already prepared to start changing. I was drinking my coffee like dragon, but I was like, God, I was going to do it last night. I was too, we moved like two trailers, a bunch of forklifts, all these frigging four wheeling quads. Some of them didn't work. So we were pushing them up the trail. I was like, yeah, I don't need this. I'm getting too old for this. I got my workout. I'll be, I'll be 58 on the 16th of January. I don't, I don't look at everybody thinks I'm in my forties. You sound around like early forties to me. Yeah. Everybody says, dude, you don't look that. And I was looking pictures of my friends, man. My friends don't send me pictures of the reunion and stuff. Uh, school, like when we were younger, half the people are dead, but all the other people are really old, like really old. But like, Whoa, that's scary. It must be the genes. Right. And some healthy, healthy living diet. Yeah. I just love me. That's all it takes. Self-love. You just need to love yourself. I need to, um, your buddy will love you. Yup. But anyway, I'm going to get working on this. I'm going to have to do it. Yeah. This is like taken. Wow. You know what it is? All the info on there. It's like a lot of detail. It's like almost thing as the fricking picture. It's weird. Now let me see if I go into cut. It took like two months for the designer to finish that. And it's kind of suspicious because with our in house designer, it takes like a week or, and it's actually better, but it's the owner's, um, designer. So we have no choice. We just need to listen. Yeah. Next time go to Grok. Grok designed me a beautiful wardrobe. I don't know how he found these, um, designers, but Hey, he says yes. So let's go, let's go with that. It took him two months. Oh my gosh. And now the project delayed and people are pointing fingers. So anyway, putting that aside, we need to push forward. Ma'am. Anyway, I'm, I am, uh, working on this, so I should, you know, it should take me about, or here we go. The production manager, Jesus, 20. Yeah. I need to work on getting the finished materials for these two. Um, anyway, thank you. You're welcome. I'm sure that you're really busy with some other stuff. No, I just got a bunch of projects going on and it's like the last minute thing. I usually don't do, but I remember, uh, meeting your boss that day after you called me, he came by. He's, he's pretty cool. That's my, my new Israeli, new Israeli ally right there. You know, I can be broke. He's, he's like that. No, he's, he's, he's a cool guy. I already, I already tell, you know, we hit it off as soon as he, as soon as he, I was like, dude, okay, I like you. And I thought, I was like, all right, I'll do this for you. You know, and when I seen your message yet, you know, yesterday I was like, oh man, it took him a long time to get back to me. He said, I'll call you next week. I'll call you next week. He said, I'll call you next week. I got to need someone like, okay, call me next week. No, but you know, the designer has got the lid. So this is the week that he met. Yep. All right. I am, I am going to start printing this out. You might need to get doing some work done over here. Thank you so much. As soon as I'm finished with this, I'll send you a text and let you know. I don't have his number. I never got his number from him. So. I can give you his number if you need to call him. If you want to text it to me, I could get it when he's going to be here to pick this up anyway. Alrighty then. Thank you so much for your time. And I appreciate you remembering me to do this work. That's awesome. Yeah. Since you're just nearby, why not? Right? Okay. Yes, ma'am. But anyway, you have a great day. You too. Have a nice day. Thanks.\n",
  "tags": [],
  "note": null,
  "source": "Outbound",
  "keywords": null,
  "campaign": null
}