{
  "answered": true,
  "business_phone_number": "+19254306447",
  "customer_city": "East Bay - Mn Piedmont",
  "customer_country": "US",
  "customer_name": "BOUHEDDA Y     ",
  "customer_phone_number": "+15104723111",
  "customer_state": "CA",
  "direction": "inbound",
  "duration": 417,
  "id": "CAL019bed01a1cf794a89ba51608da5e54f",
  "recording": "https://api.callrail.com/v3/a/ACC2572dc258af24a36a5f230a177c8820b/calls/CAL019bed01a1cf794a89ba51608da5e54f/recording",
  "recording_duration": 415,
  "recording_player": "https://app.callrail.com/calls/CAL019bed01a1cf794a89ba51608da5e54f/recording?access_key=1fda055bd1d8222426bd",
  "start_time": "2026-01-23T14:37:45.766-08:00",
  "tracking_phone_number": "+19252330109",
  "voicemail": false,
  "lead_score": null,
  "lead_explanation": null,
  "company_id": "COM1660768019b8465f836610da3a0e58d1",
  "company_name": "Rhino Builders",
  "transcription": "builders. Please hold for the next available agent. This call is being recorded. Hello, this is Rory. Yes, hi. I was wondering if you guys give free estimates for projects? Yes, we do free estimates. We also go over to the site just to check over what needs to be done. Okay, yeah. We'd like to have our garage converted into a living space so that we can We also have some stuff we'd like to remodel in the houses as well. Okay, can I take the address so that we can have someone over to check the site? Yeah, it's 2388 Market Avenue in San Pablo. Got it, and what is your name? Yusef. Can you spell that out for me? Yeah, Y-O-U-C-E-F. And your last name? B-O-U-H. B-O-U-H. All right, and is it a good number to call you back? Yeah, this is a good number. Got it, and then your email address for us to send over the estimate? Email is M-B-A-O-N-922 at gmail.com. At gmail.com, got it. All right, and what is the best date and time for us to come over to meet with you? Ideal, probably best time is maybe Tuesday, anytime after like one. After one, got it. Let me check our schedule first. Let me see, let me take a look. We're three after one, so it's 1 p.m., straight 1 p.m., good to go. So you said Tuesday from 1 p.m.? Yes. Someone's got to be over there to over the site, and you will be there to assist them, right? Uh-huh, and what's it called? If you can repeat the email one more time, just to make sure you have the I got the right one, or you have the right one. Good thing, it's M as in May, V as in Valley, A as in Apple, O as in Orange, N as in what? N as in Nancy? Yeah, Nancy, yeah, and 922 at gmail.com. Yeah, that's good, and also we do have plans as well for the project, so we can, if you need us to send them, send them to you, yeah, we could do that. Okay, my email is office, so that's O-F-F-I-C-E. Is it possible if you can email my email, and then after that I can send you the plans? All right, I can do that right now, so that, let me see if you can. That way, I don't have to write it down. Good thing, I'll just write in test, just to make it quick. Okay. Test email. We are now a builder, test email, let me send that to you right now. Okay, let me know if you got it. That's good. It seems that the email, the email address is not, address is not found. I think you said it correctly to me, you had a M-V-A-O-N 922 at gmail. M-V-A-O-N 922, right? B-A, right? B as in boy? Oh, B as in boy. Sorry, okay, let me send that over again. Good thing we checked that. Okay, final builder, test email. Okay, how about this one? Let's see. Yeah, I got that one, okay, yeah, I'll send you that. And then, and you said Tuesday, Tuesday, one o'clock, right? Yeah, exactly, one o'clock. Okay, sounds good, so I'll go ahead and send you that right now. All right, thank you. Thank you, goodbye. Bye. Bye.\n",
  "tags": [],
  "note": null,
  "source": "Orinda GMB",
  "keywords": null,
  "campaign": null
}