{
  "answered": false,
  "business_phone_number": null,
  "customer_city": "Kelseyville",
  "customer_country": "US",
  "customer_name": "KELSEYVILLE  CA",
  "customer_phone_number": "+17072893693",
  "customer_state": "CA",
  "direction": "inbound",
  "duration": 81,
  "id": "CAL019bcd773e5673a2b59a562cb55fe082",
  "recording": "https://api.callrail.com/v3/a/ACC2572dc258af24a36a5f230a177c8820b/calls/CAL019bcd773e5673a2b59a562cb55fe082/recording",
  "recording_duration": 64,
  "recording_player": "https://app.callrail.com/calls/CAL019bcd773e5673a2b59a562cb55fe082/recording?access_key=a80e8c7ba17fd1735da1",
  "start_time": "2026-01-17T11:38:22.651-08:00",
  "tracking_phone_number": "+19259407383",
  "voicemail": true,
  "lead_score": null,
  "lead_explanation": null,
  "company_id": "COM1f45fa45c32c4ca6a05a89c716bd0698",
  "company_name": "Rhino Concrete",
  "transcription": "Hello, hope you're doing well. My name is Mark Griffin. I'm Managing Principal at Sperry Griffin Partners and Topsell Capital Advisors. Sorry to try to reach on a Saturday. Sometimes it's easier for business owners to speak on a Saturday, but just want to reach out, tell you about us, see if we could be of service this year. We are merger and acquisition advisors and business brokers. I've been in the industry for over 20 years. We start what's called a market valuation exit plan document, which is the first step for us in working with clients. And really it's more than just evaluation. It's a roadmap to your exit of your business. Most business owners have never planned for their exit, leaving a lot of questions unanswered and money on the table. I'd love to share a sample copy of that with you. The other thing is we are also uniquely qualified in commercial real estate. We're affiliated with Sperry, which is a national company on commercial real estate side. So if your concrete ready mix company includes real estate, we can really help you with that as well if it's part of the business. But anyway, give me a call when you get a chance. If you're interested in chatting, 864-525-8562 on my mobile, that's the best way to reach me. Thank you.\n",
  "tags": [],
  "note": null,
  "source": "Rhino Drainage System",
  "keywords": null,
  "campaign": null
}