{
  "answered": true,
  "business_phone_number": "Softphone",
  "customer_city": "Antioch",
  "customer_country": "US",
  "customer_name": "GREGORY BRENDA ",
  "customer_phone_number": "+19256288877",
  "customer_state": "CA",
  "direction": "inbound",
  "duration": 117,
  "id": "CAL019bb86d8ded72698371306706b3a8cb",
  "recording": "https://api.callrail.com/v3/a/ACC2572dc258af24a36a5f230a177c8820b/calls/CAL019bb86d8ded72698371306706b3a8cb/recording",
  "recording_duration": 103,
  "recording_player": "https://app.callrail.com/calls/CAL019bb86d8ded72698371306706b3a8cb/recording?access_key=88daddedcb214487475e",
  "start_time": "2026-01-13T09:35:46.113-08:00",
  "tracking_phone_number": "+19252302554",
  "voicemail": false,
  "lead_score": null,
  "lead_explanation": null,
  "company_id": "COM3d2fe52ea4a3454ab10743632f97a14c",
  "company_name": "RB Production",
  "transcription": "Hello, this is Roli. Hi Roli, this is Damian. I'm with Diablo Excavation. Oh yeah, hi. Yes, I did call. Sorry, what's your name? I'm Damian. Hi. Yeah, we're looking for an A-class contractor who can get us an encroachment permit. Is this possible with you guys? Yes. All right, and do you guys have a license? I forgot what it's called, but I have a plan ready for it. Yes, yes, we're from PG&E. We're on our approved contractors list as well. Nice. Okay, and you guys are in Discovery Bay, right? Yeah, we service East Bay all the way. We do the whole Bay Area all the way up to pretty much Shasta. Okay, I have a plan ready from PG&E, and we want to get a call from you guys. I'm ready for the email. Okay, my email is info, I-N-F-O, at Diablo, D-I-A-B-L-O, excavation.com, D-I-A-B-L-O. Diablo Excavation, like the whole word? Yeah, just Diablo Excavation, no spaces. Okay, Diablo Excavation.com. All right, I'll send it over, and please just give me a reply just to let me know that you got it. Will do. I'm out in the field today, so I'll probably be about an hour until I'm back in the office. I'll get to it as soon as possible. All right, okay. Thank you so much. Thank you very much.\n",
  "tags": [],
  "note": null,
  "source": "Outbound",
  "keywords": null,
  "campaign": null
}