{
  "answered": true,
  "business_phone_number": "Softphone",
  "customer_city": "Belvedere",
  "customer_country": "US",
  "customer_name": "SHAY ZILBER",
  "customer_phone_number": "+14156906630",
  "customer_state": "CA",
  "direction": "inbound",
  "duration": 194,
  "id": "CAL019bb38933e27955bfa74191661a1673",
  "recording": "https://api.callrail.com/v3/a/ACC2572dc258af24a36a5f230a177c8820b/calls/CAL019bb38933e27955bfa74191661a1673/recording",
  "recording_duration": 184,
  "recording_player": "https://app.callrail.com/calls/CAL019bb38933e27955bfa74191661a1673/recording?access_key=ee92984e8c4b4476e4dd",
  "start_time": "2026-01-12T10:47:51.983-08:00",
  "tracking_phone_number": "+19252302554",
  "voicemail": false,
  "lead_score": null,
  "lead_explanation": null,
  "company_id": "COM3d2fe52ea4a3454ab10743632f97a14c",
  "company_name": "RB Production",
  "transcription": "Hello. Yes, I. Princess, what is the name of that printing company in Richmond? It's BPX Printing. I told Vivian and I. What is the phone number for them? I'm ready whenever you're ready. Oh, okay. It's 510. Hold on. That's fine. It's fine. Okay. It's fine. Alon will call you soon to ask you to pay for them, okay? He's going to talk to them and he's going to ask you just to do the payment, okay? Okay. All right. What else did I say? Alon also wants to have a blank copy of an addition job for the production board. Oh, production board. Okay. I think it's going to be pretty similar for plumbing and standard addition. When did we do a big addition estimate? What was the last one we did? It was last week. What was it? Hold on. Like the one we did for John from Monotric. We have Jose Arias. A lot of addition. Jose is good. Send them Jose and he's going to just fix it, okay? I'll just make a copy because he might change it. Okay. I'll just give him a copy. Yeah. Give him a copy, of course. If you can send it like an open file so I can edit. Okay. All right. Thanks. All right. That's great. And you know, this platform is really good for everything, you know? Just save it. Save this file somewhere in your notes, you know? And write an addition under it. Got it? And then every time you go back to it. It's a 900 square footage addition. Let me send it to Alon. Yeah. Okay. Thanks. Bye. I did. All right. Bye.\n",
  "tags": [],
  "note": null,
  "source": "Ralph Ramos - Lead Center",
  "keywords": null,
  "campaign": null
}