{
  "answered": true,
  "business_phone_number": "+19252386347",
  "customer_city": "Utica",
  "customer_country": "US",
  "customer_name": "UTICA MI       ",
  "customer_phone_number": "+15868037321",
  "customer_state": "MI",
  "direction": "inbound",
  "duration": 68,
  "id": "CAL019c1ffd6a6877e39087f8abc58551d1",
  "recording": "https://api.callrail.com/v3/a/ACC2572dc258af24a36a5f230a177c8820b/calls/CAL019c1ffd6a6877e39087f8abc58551d1/recording",
  "recording_duration": 63,
  "recording_player": "https://app.callrail.com/calls/CAL019c1ffd6a6877e39087f8abc58551d1/recording?access_key=7083f1ed3fe851697ee6",
  "start_time": "2026-02-02T12:13:47.462-08:00",
  "tracking_phone_number": "+19252302554",
  "voicemail": false,
  "lead_score": null,
  "lead_explanation": null,
  "company_id": "COM3d2fe52ea4a3454ab10743632f97a14c",
  "company_name": "RB Production",
  "transcription": "Yes, hi. My name is Ryan. I'm with Woodland Direct Fireplace Company. Am I speaking with Roli? Roli, hold on a second. Let me just double check. Oh, she's on her break right now. Oh, is that right? Okay. Yeah, try to call her back at around 110 p.m., 1-110. Sure. And let me give you her direct line. Hold on a second. All righty. Okay. Hi, Roli. I'm with Woodland Direct Fireplace Company. Am I speaking with Roli? Roli, hold on a second. Let me just double check. Oh, she's on her break right now. Oh, is that right? Okay. Yeah, try to call her back at around 110 p.m. Sure. And let me give you her direct line. Oh, is that right? Okay. Yeah, try to call her back at around 110 p.m. Sure. Okay. Hold on a second. One second here. What number did you dial, by the way? Sure. N2554. So 925. Yeah. So 925-230-2554. Okay. Yeah, you can dial that number. And she'll probably accept that call after, once she gets in. Okay. Sounds good. Well, thank you. I hope you have a great day. Bye. Bye. Bye. Bye. Bye. Bye. Bye. Bye. Bye. Bye. Bye. Bye. \n",
  "tags": [],
  "note": null,
  "source": "ROLLE- Lead Center",
  "keywords": null,
  "campaign": null
}