{
  "answered": true,
  "business_phone_number": "Softphone",
  "customer_city": "Concord",
  "customer_country": "US",
  "customer_name": "PLANT HAZARDOUS",
  "customer_phone_number": "+19255864878",
  "customer_state": "CA",
  "direction": "inbound",
  "duration": 112,
  "id": "CAL019bc399add97221a4777406832f3dfb",
  "recording": "https://api.callrail.com/v3/a/ACC2572dc258af24a36a5f230a177c8820b/calls/CAL019bc399add97221a4777406832f3dfb/recording",
  "recording_duration": 98,
  "recording_player": "https://app.callrail.com/calls/CAL019bc399add97221a4777406832f3dfb/recording?access_key=9a500e787eac1bd6b268",
  "start_time": "2026-01-15T13:39:47.253-08:00",
  "tracking_phone_number": "+19252302554",
  "voicemail": false,
  "lead_score": null,
  "lead_explanation": null,
  "company_id": "COM3d2fe52ea4a3454ab10743632f97a14c",
  "company_name": "RB Production",
  "transcription": "Hello, this is Roli. Hi, Roli. My name is Tyler Jayhaw. I'm with Plant Hazardous Services. Oscar Hernandez gave me your contact for some underground conduit at Lido in Discovery Bay. Oh, yeah. Is this a Class A contractor who I can get a quote with? Yes, I can send you a quote for the PG&E work. We're PG&E certified. I haven't really looked at the job, but I was going to go drive by today. It's right down the street from my house. Oh, nice. All right. Do you have the plans that I sent to Oscar? I do. I have the plans and the write-up of all the details, so I'll take a look at it. I mainly just wanted to introduce myself, and then I'll get back with you if I have any questions and try to get you guys something submitted over the weekend. All right. Nice. Sorry. What's your name again? Tyler. Tyler. And my last name is Jayhaw. J-E-H-A. Sorry? I was just telling you my last name is Jayhaw. J-E-H-A. J-E-H-A. All right. I'll save that on my contact. And I'll shoot you an email as well. Yes, so that I can send an email back with whatever you need. Yep. That sounds good. I appreciate it. All right. Thank you so much, Tyler. Thank you for calling. All right. We'll talk to you soon. Bye-bye. All right. \n",
  "tags": [],
  "note": null,
  "source": "ROLLE- Lead Center",
  "keywords": null,
  "campaign": null
}