{
  "answered": true,
  "business_phone_number": "+19252890534",
  "customer_city": "Hayward",
  "customer_country": "US",
  "customer_name": "GONZALEZ MARIO ",
  "customer_phone_number": "+15109257158",
  "customer_state": "CA",
  "direction": "inbound",
  "duration": 216,
  "id": "CAL019becd62b7c787c920dd79c54499d4d",
  "recording": "https://api.callrail.com/v3/a/ACC2572dc258af24a36a5f230a177c8820b/calls/CAL019becd62b7c787c920dd79c54499d4d/recording",
  "recording_duration": 213,
  "recording_player": "https://app.callrail.com/calls/CAL019becd62b7c787c920dd79c54499d4d/recording?access_key=e0685eb0c3c4d153b7ec",
  "start_time": "2026-01-23T13:50:17.438-08:00",
  "tracking_phone_number": "+19257448428",
  "voicemail": false,
  "lead_score": null,
  "lead_explanation": null,
  "company_id": "COM1f45fa45c32c4ca6a05a89c716bd0698",
  "company_name": "Rhino Concrete",
  "transcription": "Please hold for the next available agent. This call is being recorded. Please hold for the next available agent. Please hold for the next available agent. Please hold for the next available agent. Hello. Hi, my name is Linda. I was calling around to see, do you guys do like a storm drain on a property? Like, kind of snake it? Hold on. Sorry, I wasn't able to hear you. Can you say that again? No, no worries. So I have a, we're with a real estate company. She's also the owner of this property. And on the side of the yard, we don't know where it goes to, but apparently it goes out to the street, we believe. But it's like almost like on a dog run. And there's just a drain that kind of needs to be cleaned, like snaked out. I think it's called, I think it's a, whatever they call it, like a storm drain. Because it's not connected to anything in the property. Do you guys do that? I think that the scope is too small for us to take the job. Okay. Okay. Yeah, okay. No worries. I'm just calling around trying to find something. It's all right. It's all right. Well, thank you. Thank you. All right. Bye.\n",
  "tags": [],
  "note": null,
  "source": "Rhino Drainage System Bay Area",
  "keywords": null,
  "campaign": null
}