{
  "answered": true,
  "business_phone_number": "+19254306447",
  "customer_city": "Madison",
  "customer_country": "US",
  "customer_name": "BELLINGHAM J.  ",
  "customer_phone_number": "+16083205546",
  "customer_state": "WI",
  "direction": "inbound",
  "duration": 116,
  "id": "CAL019c0b501191731588503125bac0aa29",
  "recording": "https://api.callrail.com/v3/a/ACC2572dc258af24a36a5f230a177c8820b/calls/CAL019c0b501191731588503125bac0aa29/recording",
  "recording_duration": 114,
  "recording_player": "https://app.callrail.com/calls/CAL019c0b501191731588503125bac0aa29/recording?access_key=1a4d845149cb5ae82d28",
  "start_time": "2026-01-29T11:52:02.666-08:00",
  "tracking_phone_number": "+19252330109",
  "voicemail": false,
  "lead_score": null,
  "lead_explanation": null,
  "company_id": "COM1660768019b8465f836610da3a0e58d1",
  "company_name": "Rhino Builders",
  "transcription": "Builders. Please hold for the next available agent. Good morning. Oh, hi. Hey, this is Janet Bellingham. I live in Orinda, and I'm looking for a contractor for a smaller job. I have a kitchen hood that I need put in my kitchen, a very large kitchen hood, but my ceiling is sloped, and I need a little bit of a build-out in order for the kitchen hood to be put in a flat surface. Oh, so basically you just need to adjust the ceiling where the hood is going to be located so it'll fit? Yes. Oh, yeah. Okay. Well, I think this kind of job is for a handyman because our jobs are actually major remodeling, like if you want to do additions, ADUs. This is something that unfortunately we do not service, this type of job. Okay. You think a handyman is going to be able to... Okay. It needs to be structurally ... Oh, I see. Yeah. Have you tried Sumtech? Do you think a handyman? Yeah. Not really a handyman. Somebody who's also licensed, but you can try Sumtech. You can choose different contractors from there that can do this type of job. All right. Okay. Thank you. Bye-bye. \n",
  "tags": [],
  "note": null,
  "source": "Orinda GMB",
  "keywords": null,
  "campaign": null
}