[
  {
    "id": "CAL019b84d9b278790d904c5021cdd11263",
    "direction": "inbound",
    "duration": 40,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+19253612718",
    "customer_name": "DUBLIN-SAN R CA",
    "customer_city": "Dublin-San Ramon",
    "start_time": "2026-01-03T09:13:38.128-08:00",
    "transcript": "Hi. Hello Rhino. I think I called you last time but I never returned. Get a call back. This has won the divided the co pad in San Lorenzo. Can you please call me back at 925-361-2718? Once again, 925-361-2718. Thank you and have a good day."
  },
  {
    "id": "CAL019b8f44c8bb75b39535b1cdadc5dcc0",
    "direction": "inbound",
    "duration": 234,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15107988597",
    "customer_name": "Genaro Roof",
    "customer_city": "East Bay - Trinidad",
    "start_time": "2026-01-05T09:46:48.342-08:00",
    "transcript": "Hello. Hey, Good morning. Happy New Year. Happy New Year. How are you? Good, good, good. Hey, are you. What is the. Somebody sent me like, pictures for Lido and one of it. And we don't know if it's everything ready for the roof because I go last time and it's not ready. What do you mean? Which one isn't ready for Lido? Fox and Guano Creek. So I want to know if it's ready because I. We checked last I asked already. So I see. Somebody sent me like a picture. They have a little leaks and a side. Yeah, that's. That was me. I sent some pictures over our group chat. So what is your text me like for Carmen? I'm sorry, I'm confused. We're talking about Carmen. Some garment. Yeah, somebody text me for Garment too. What is. Oh, no, no, no. It was for Little. Okay. Little. Right? Yeah. Okay. The pictures. I think you did. You said okay. No, you don't send me picture. Who sent me the pictures? So it was actually Shy who sent those pictures on our group chat right now for Lidl. Let me see. Which I sent the picture. This is for. Lido. The owner actually sent it to us. We just forwarded it to you to our group chat. Yeah. So it says here, hey, notice a handful of leaks around the house to look directly from the roof, he says, and a few others. It should be in our group chat. Canaro Roof, Lido Discovery Bank. The one with the green icon. I tried to get that feature from Group. It's the one that you just chatted. Okay, I see. I can see right now. What is this one? This is Lido. Yeah, that's Lido Group, right? No, that's Lido. That's Lido. The owner from Lido sent us that to us, so we just forward it to. To our group. So some of it I. It's not from the roof, but some of it is. So we wanted you to check on it on light. Yeah, I go check. I go check. No problem. All right. When do you think you can check so that we can tell the owner? They wanted to know I came later today. Huh. Let me see. What time right now is nine. Probably around like 12 or 1 will be there. Okay, 12 or 1, I'll be there. All right. Okay. And for Kit box. Yeah, hold on. Huh? For Kid box. It was last week. I'm not sure what's the update today, but Shy wanted to get your help for today too. And look at it. Okay, Just go with Little first and then let's go with the kids. Box after. Okay. All right. Thank you. Okay. Thank you so much. All right, bye."
  },
  {
    "id": "CAL019b8f4582047831b909c013f919520d",
    "direction": "inbound",
    "duration": 17,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15109915425",
    "customer_name": "FREMONT-NEWA CA",
    "customer_city": "Fremont/Newark",
    "start_time": "2026-01-05T09:47:35.778-08:00",
    "transcript": "You up. Hello. Good morning. Get you 500 points in your Honors account."
  },
  {
    "id": "CAL019b8f6679f470b4bf27b13318a32390",
    "direction": "inbound",
    "duration": 16,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+17472009242",
    "customer_name": "BURBANK CA     ",
    "customer_city": "Burbank",
    "start_time": "2026-01-05T10:23:36.394-08:00",
    "transcript": "Showing up on Google searches again, please."
  },
  {
    "id": "CAL019b8f73a0f27ab8be2384cbfb9729c8",
    "direction": "inbound",
    "duration": 85,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+16509229630",
    "customer_name": "FISHER WESLEY  ",
    "customer_city": "South San Francisco",
    "start_time": "2026-01-05T10:37:58.307-08:00",
    "transcript": "Hello. Good morning. Is this Rhino Builders? Yes, it is. It's Colleen. Yeah, my name is Wes Fisher. I'm just wondering about the property at 226 Overhill in Orinda. It has your guys sign with your guys name on it, but it doesn't look like it's been worked on for a while. Is that. Yeah, we're no longer working on that property. The owner already, you know, stopped the work for us. Ah. You should take your sign off. It doesn't look good for you guys. Oh, yeah. I have to tell my boss about it. Thank you for letting. Thank you for calling about it. Yeah. Do you know why they stopped? Yeah. I don't have any idea why they stopped. Wow. And it's been a few years, right? I think so. Yeah, I think so. It's been a while. I remember that property for like more than a year now. Yeah. Yeah. Okay. Yeah. Okay. I will let. Them know. Thank you so much. Yeah. Have a good day. Yeah. Okay. Thank you. Bye. Bye."
  },
  {
    "id": "CAL019b8fdc5b9d7db490c0c7b1a350f609",
    "direction": "inbound",
    "duration": 61,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+17079816707",
    "customer_name": "MENGHINI       ",
    "customer_city": "Petaluma Main",
    "start_time": "2026-01-05T12:32:21.886-08:00",
    "transcript": "Hello? Good morning. Hi. Yeah, I'm calling about putting a foundation under my house. It's just on Post and Peter right now. Oh, okay. What city are you located? I'm in Forestville. Where are you guys? Where? I'm sorry, you're breaking up. Forestville? Oh, we're in the Bay Area, but I think that's Forestville. Yeah, Santa Rosa, basically. Oh, no, no, I'm sorry. I think it's a mistake on our website, guy. We don't. We don't work in Santa Rosa. Sorry about. That. Okay, thank you. Yeah, it says it on the website. Okay, bye. I know. Sorry."
  },
  {
    "id": "CAL019b8fe602777dcea0de73add5d6a7fb",
    "direction": "inbound",
    "duration": 82,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+18444088880",
    "customer_name": "QUALITY IMAGING",
    "customer_city": null,
    "start_time": "2026-01-05T12:42:43.669-08:00",
    "transcript": "Hello. Good. Morning. Hi, Good morning. It's Adriana with Quality Imaging. I was hoping to speak to the person that purchases the ink and toner for the printers. What is it about Adriana? So we are an ink and toner manufacturer. We do carry the original shelves filled to max capacity. And right now we're having a trial where we can send you guys a couple of our products to test out. We do not require any billing information. Just want to see if we can earn your business and help you save money. Oh, yeah, well, unfortunately, we don't really use our printer that much because we mostly work from home. Yeah. So it's not gonna. Be like. Yeah, it's not gonna be using it that often. How often do you guys change the ink? I do not know. I don't. I don't go to the office. Okay, got it. All right, thank you for letting me know. Have a great day. Thank you. Of course. Okay, bye. Bye. Bye."
  },
  {
    "id": "CAL019b9015d2467457aee83f35233ce8cb",
    "direction": "inbound",
    "duration": 65,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+14802075712",
    "customer_name": "YELP INC       ",
    "customer_city": "Phoenix",
    "start_time": "2026-01-05T13:35:07.790-08:00",
    "transcript": "Hi, good afternoon, this is Steve with Yelp trying to reach you about the Rhino Builders Yelp account. Since we've had 37,000 people looking for a general contractor in December, but only 19 of them had a chance to contact you, so please give me a call when you get this. Let's get this turned around and working for you. My Phone number is 480-207-5712. Thank you."
  },
  {
    "id": "CAL019b9060877176e99bb0426c04c3b545",
    "direction": "inbound",
    "duration": 202,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19257989600",
    "customer_name": "THE HOME DEPOT",
    "customer_city": "Concord",
    "start_time": "2026-01-05T14:56:43.817-08:00",
    "transcript": "Hello? Hi, good afternoon. This is Ruth with the Concord Home Depot. I have here Rudy doing a phone sale of $1,866.24. Ready for your credit card? All right, how much is it again? It's $1,866.24. Got it. Okay. All right, are you ready? Yes. Okay, it should be 3767-574418-53000. Expiration dates would be 08. Okay, I'm gonna need your security code. It's 9653. 9653. Yeah. And can you repeat one more time? The expiration. It's 083030. Okay, and then your zip code. Zip code should be 9456. Okay. May I have the first name and last name on that credit card? It's Shy Zilber. S. Okay. A, Y, Z I, L, T E, R. Okay. And then the billing address is still 3685 Mount Diablo. 13 Carmen. Or, sorry. 13 Carmen Court, Orinda. Okay, hold on. Let me. Let me change that then, because this one has the alone. Okay. New detail. Okay, one more time. The address. 1313 Carmen. C A R. Carmen. C O U R T. Orinda. Orinda. Okay, yeah. And what is the zip code? One more time. 94945-6363. Okay, one second. Tony, Thank you so much. Have a good day. Bye. Bye. All right, thanks."
  },
  {
    "id": "CAL019b9441e9207846afd059ab6deb13de",
    "direction": "inbound",
    "duration": 56,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+19252906377",
    "customer_name": "LIVERMORE    CA",
    "customer_city": "Livermore",
    "start_time": "2026-01-06T09:01:46.061-08:00",
    "transcript": "Press one to connect. Press two to hear inquiry details. Press one to connect. Press two to hear inquiry details. Press one to connect. Press two to hear inquiry details."
  },
  {
    "id": "CAL019b9468ffdf70c69e0888521b0bf695",
    "direction": "inbound",
    "duration": 75,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+19259221671",
    "customer_name": "TAO YU         ",
    "customer_city": "Pleasanton",
    "start_time": "2026-01-06T09:44:27.830-08:00",
    "transcript": "Hi, my name is Mahendra Ankat. Last name A N K H A D. My number is 925-922-1671. Can you please give me a call back? I need to talk about. We have a drainage issue. Drainage pipe blockage in our backyard which is not properly flowing the water out of the backyard. So we need to discuss something and how much charges and all that. So please give me a call back. Again, the number is 925-922-1671. Thank you, bye."
  },
  {
    "id": "CAL019b947a60a67890a65abe4198fbf9a3",
    "direction": "inbound",
    "duration": 56,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+19252906377",
    "customer_name": "LIVERMORE    CA",
    "customer_city": "Livermore",
    "start_time": "2026-01-06T10:03:26.679-08:00",
    "transcript": "Press one to connect. Press two to hear inquiry details. Press one to connect. Press two to hear inquiry details. Press one to connect. Press two to hear inquiry details."
  },
  {
    "id": "CAL019b949d723a70cb9033e38f58e4de67",
    "direction": "inbound",
    "duration": 69,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+19255068352",
    "customer_name": "ANTIOCH CA     ",
    "customer_city": "Antioch",
    "start_time": "2026-01-06T10:41:44.983-08:00",
    "transcript": "Hi, my name is Sami. I am calling from Dublin. So I. Yesterday a big hole came in the concrete flooring of my balcony. So I was calling up to see if you provide the services to repair the flooring or install a new one in the balcony. Please call back on this number. My name is SAMI and the zip code is 952-94-568 and my number is 925506, 8352. Thank you."
  },
  {
    "id": "CAL019b94b313857acaba0609ea77cdfe8b",
    "direction": "inbound",
    "duration": 55,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+19252906377",
    "customer_name": "LIVERMORE    CA",
    "customer_city": "Livermore",
    "start_time": "2026-01-06T11:05:22.476-08:00",
    "transcript": "1. To connect, press 2. To hear inquiry details, Press 1. To connect, press 2. To hear inquiry details, Press 1. To connect, press 2. To hear inquiry details."
  },
  {
    "id": "CAL019b94f5b4097b3ab24210ab208bbbcc",
    "direction": "inbound",
    "duration": 12,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+13232009426",
    "customer_name": "LOS ANGELES CA ",
    "customer_city": "Los Angeles",
    "start_time": "2026-01-06T12:18:09.000-08:00",
    "transcript": "Specialists to avoid any suspension or."
  },
  {
    "id": "CAL019b9514913975c5852d9d6cb88856ad",
    "direction": "inbound",
    "duration": 14,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19799216005",
    "customer_name": "HEMPSTEAD TX   ",
    "customer_city": "Hempstead",
    "start_time": "2026-01-06T12:51:51.703-08:00",
    "transcript": "Hello. Good morning. Good afternoon."
  },
  {
    "id": "CAL019b9554483c7fbb9e56a5a1bba95901",
    "direction": "inbound",
    "duration": 17,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+14156256438",
    "customer_name": "Service Center (Telemarketer)",
    "customer_city": "San Francisco",
    "start_time": "2026-01-06T14:01:27.321-08:00",
    "transcript": "Hello? Hello. Hi. Good day. This is gideon with merchant service center."
  },
  {
    "id": "CAL019b9933cc5879f58d1db93f050d89b2",
    "direction": "inbound",
    "duration": 45,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+12092004240",
    "customer_name": "PRIVATE        ",
    "customer_city": "Lodi",
    "start_time": "2026-01-07T08:04:27.295-08:00",
    "transcript": "Authorized representative to take care of this. To address this immediately, press 4. This will only take a few minutes. To opt out, press 9 or call 959-262-8948."
  },
  {
    "id": "CAL019b996b0d827bed9db84a6f54efe818",
    "direction": "inbound",
    "duration": 908,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+12092377266",
    "customer_name": "AGUIRRE CITLALY",
    "customer_city": "Tracy",
    "start_time": "2026-01-07T09:04:48.478-08:00",
    "transcript": "Hello? Hi, Rolly. Jamie. I'm sure you knew that. I know. Anyway, I just got finished loading the machine, calibrating. I'm waiting for all your files to download into this program. The estimated time is an hour and 18 minutes to print. Okay, that's fine. I'll just let my boss know that it will be around 10:30, 10:15. And the total will be 621 with everything. 621. Okay. And that. And. And I want you to go online and look at 35, 90 per page from FedEx. I did, actually. Yeah. So. No, I'm hooking you all up. And my. My wife just went in the room and I told her. I explained everything to her. She did not say one word to me. She just turned around and closed the door. So that's what I just went through while I was waiting on the machine. Now I'm just 65% downloading the PDFs into the program so I could size them and then start printing. My printer told me an hour and 18 minutes, but it'll probably be an hour and five because it does the cool down shit. But since these are blueprints, I don't have to wait for, like, the ink to dry like I do on canvas or, you know, because I could print anything. Foam boards. When you need signs for, you know. Construction, you do, because we also need signs. But I'm guessing you're really pretty busy, so I'm not sure if we can do that. Well, no, if you got the money, I got the time. You know what I'm saying? Yeah. Yeah, I'm in. I'm in the process of building boats. Did you ever go to my website? I know you didn't know what your website is. Can you send a link? Discovery, Discovery Bay, Print.com. I see now why your company comes up first. Because that's the name. Discovery Bay. Because that's how people usually type. Just in your area. Okay, I see it. You can see all the stuff I do. Like, go scroll down and you'll see the signs. And I got a lot of, you know, I'm just not little. I do some shit like. Like signs that are 10, 15 foot in diameter, a hundred foot in the air, that weighs thousands of pounds. And. Yeah. And if you go down to the boat one, you'll see the boats that do vehicle raft. All right. I'll let my boss know because I'm pretty sure he has a lot to print for construction. And it's just around Discovery Base. Yep. Like, any sign, even I go like right now I'm doing a sign for a supermarket in Alameda and it's Neptune Plaza. I do web designs and all that good stuff. Anything advertisement printing and signs. So does he do, does he do commercial or is he just focusing on residential right now? It's only for residential for now. I'm not sure in the future. But yeah, I get you some residential. Like me, I'm like for my buddy, my business partner in a boat, I'm building his adu. Like I'll go, I'll go in there and in one week build an ADU for about seven grand. Well, and everybody. Dude, you can't do that. I'll bet me, man, with, with, with a smart toilet, you know, all friggin LED light. Yeah. And my buddy, before I helped him out, he had this guy Daniel helping him out. He charged him $22,000 for a 10 by 12 ADU with a bathroom that's crooked. I was like, dude, man, I'm going to build you adu. The whole thing with a loft for less than 20k and your bathroom is going to be like superior compared to the other one, which it is. But are you sure about that? I think it's quite. Well, it's affordably, it's cheap. Yeah. Because if you know how to build, 70% of construction is in labor. It's true. If my job, if it cost me 300 bucks to do something on construction, I'm charging you $1000. So if I'm buying $300 worth of material, I'm charging you 1000. If I go spend 500 in material, I'm charging you 1500. That's how I calculate. But I'm not gonna disclose that. Difficult. Difficult? No, it just depends, you know, I could walk into a room and say, okay, I know when I tear apart that wall, all the electrical and plumbing's running through there. I know I'm gonna have to cut the floor. You know, my brain already dissects things when I walk into the room and I'm, you know, okay, you want this? This. I look at a plan and I'll be like, dude, we can't put the bathroom here. The bathroom needs to go over there. Why? Because then I got to run pipes all the way around the room and blah, blah. To consider. You know, I could walk into a house, I don't even have to. I just. As long as I know what side the utilities come on, where the clean out for the, the septic is or the drainage for their house. I'll tell you where all the pipes run. Yeah. Where everything goes. It's just common sense. If you building. It's. It's like, okay, I wouldn't run it this way and this way. When you know the standards are this and this. You know, if you. If you know the basics and the standards, then you could walk in somewhere and. Not many people do that. I do. I engineered security systems for, you know, major comp. You know, big companies. I'd go in there and set up hundreds of cameras, access control, you know, intercom systems, biometrics. I started off years ago doing regular. And then one day, I got calls from all these grow companies up in Seattle and Oregon. And then for a few years, worked my way all the way down here. And then one day on the way back from work in Oakland, from a warehouse I was doing there, I got into an accident. A dump truck from fucking Livermore Pools and spas. The dude was on his phone, and he hit me at like 60 miles an hour and broke my spine. So I was out of work for years, and I couldn't get back into security because, you know, it's. It's a lot of clients, a lot of physical labor. So I wound up just buying print stuff. And still, like. Like, this is the first year that I've gone where I've had no major physical problem. I get backaches every once in a. While, but that sounds great. That sounds great. Usually. Usually it's. It comes and goes there, but I've had seven spine surgeries. It's. It was bad. It sucked. I'm telling you, it was miserable. And in the middle of that lot, too, aside from. Yeah, so it was. It was a rough. It was a rough few years, you know, not working and all that good stuff, too. Right now you're being a workaholic with all the printing and all the construction. Yeah, now. Now, especially since I. Since I'm, you know, physically able to do other things now. I'm installing cameras. I'm. I'm building signs now. I got. I'm stuck with a couple of different types of businesses. You're multitasking. There's a lot to do. Plus, if you go into services on my webpage, you go down and you'll see a link to my wife's website, and you'll see all her. Because she does music and artwork and. And that's what she does, so. What a proactive team. Yeah, she's. Yeah, she's the one with all the power, though. Yipper. Okay. I'll inform my boss about the time I'll let him know just maybe 10:30. As we speak I am down and this thing is taking still like it is a, it's a very large file. But I think I got it. Yeah, I'm looking at it here. I had to like micro, you know, reduce it so small so I can see all the files at one time and then I'll grab them, I'll start printing. But the printer just finished calibrating. As I was talking to you I heard it just like now it's gonna be ready to go. It's, it's not easy. Like if somebody comes and says they want vinyl stickers, it's going to take me nearly an hour and a half to change the paper, put the paper in, calibrate it for that substrate. It's, it's not easy. That's what I'm saying. I had to set up for, for vinyl. I was doing vinyl the other, the other day and so when you called me this morning I was already prepared to start change. I was drinking my coffee like Dragon but I was like God I, I was gonna do it last night. We moved like two trailers, a bunch of forklifts, all these friggin four wheeling quads. Some of them didn't work so we were pushing them up the trail. I was like yeah, I don't need this. I'm getting too old for this. I got my workout exercise though right. Now I'll be, I'll be 58 and on the 16th of January I don't, I don't look at. Everybody thinks I'm in my 40s. Like you sound around like early 40s to me. Everybody says dude, you don't look that. And I was looking pictures of my friends man. My friends sent me pictures of the reunion and stuff. School like when we were younger, half the people are dead but all the other people really old. Like really old. I was like whoa, that's scary. Must be the genes, right. And some healthy, healthy living diet. Yeah. I just love me. That's all it takes. Self love. You just need to love yourself. I need to. Your body would love you. Yep. But anyway I'm gonna get working on this. I'm gonna have to do it. Yeah. This is like taking. Wow. You know what it is all the info on there since like a lot of detail. It's like almost thing as a freaking picture. It's weird. Now let me see if I go into cut. It took like two months for the designer to finish that. And it's kind of suspicious because with our in House designer. It takes like a week or. And it's actually better, but it's the owner's designer, so we have no choice. We just need to listen. Yeah, next time, go to Grok. Grok designed me a beautiful wardrobe. How he found these designers. But hey, he says he has designers, so let's go. Let's go with that. It took him two months. Oh my gosh. And now the project delayed and people are pointing fingers. So anyway, putting that aside, we need to push forward. Ma'. Am. Anyway, I'm. I am working on this, so I should. Yeah, it should take me about. Here we go. The production managers. Oh, Jesus. 20. Yeah, I need to work on getting the finished materials for these too. Anyway, thank you. You're welcome. I'm pretty sure that you're really busy with. With some other stuff. No, I just got a bunch of projects going on and it's like the last minute thing I usually don't do, but I remember meeting your boss that day after you called me, he came by. He's pretty cool. That's my. My new Israeli. My new Israeli ally right there, you know? Yeah. Bros. He's. He's like that. No, he's. He's a cool cat. I already, I. I could already tell, you know, we hit it off as soon as he. As soon as he. Yeah, I was like, dude, okay, I like you. That's why I was like, all right, I'll do this for you. You know, and when I seen your message yet, you know, yesterday, I was like, oh, man. Took him a long time to get back to me. He said, I'll call you next week. I need some. I'm like, okay, call me next week. You know, the designer has got the lid. So this is the week that he met. Yep. All right, I am, I am gonna start printing this out. Might need to get doing some work done over here. Thank you so much. As soon as I'm finished with this, I'll. I'll send you a text and let you know. I don't have his number. You know, I never got his number from him, so I can give you. His number if you need to call. Him, if you want to text it to me. Well, I could get it when he's going to be here to pick this up anyway. So. Alrighty then. Thank you so much. Thank you. And I appreciate you remembering me to do this work. That's all. Yeah, since you're just nearby, why not, right? Okay. Yes, ma'. Am. But anyway, you have a great day. You too. Have a nice day. Thanks."
  },
  {
    "id": "CAL019b999214647c6eb1ba3071f05162bc",
    "direction": "inbound",
    "duration": 366,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19164305607",
    "customer_name": "CARBON BLACK   ",
    "customer_city": "Elk Grove",
    "start_time": "2026-01-07T09:47:26.149-08:00",
    "transcript": "Hello? Good morning. Hello, My name is David. I was calling. I'm new to the area. I was. I need some help with the concrete slabbing on my property. That's something you guys offer? Hello? Yeah. Concrete. What do you. What are you asking for? So I'm new to the area. I'm looking for somebody to help me. I need an estimate on re. Slabbing the concrete on my front driveway and then towards the back. RV access to the backyard. Is that something you guys do? It's all just, just. It'll just be a plain slab, no stamp, nothing special. Just slab it out. So it's gonna. It's already slabbed out. It's just kind of messed up and cracked and it's been, you know, it's been like this for a while. It's kind of a mess. You want to see if I get somebody out here? Do you want to redo the whole thing or just cover the areas that are not, you know, that are. That would be a. I mean, yeah, either the whole thing or maybe portions when they get here. They could give me a better explanation on what they can. What's possible because it's a unique property. It's not like it's. It's not your typical just tried and driveway deal. It has a. Okay, where are you located? Martinez, in Martinez. Okay, can I get the address, please? Come on. It's 145 Hillside Lane. Okay. Martinez. Okay. Alrighty. Let me check my calendar. Let me see here. So we do have an opening either later today or tomorrow afternoon. ASAP would be fine. As soon as possible. Okay, we'll do like 2pm today. Okay, that sounds great. Okay, perfect. And I just need your, like I just need your name and your email address, please, and the phone number that we can reach you. Yes, my name is David Goodwin. Email address is Goodwin, H G O3 3@gmail. Phone number is. Let me just Repeat that. This Goodwin H G O33gmail.com, correct? Yes, ma'. Am. Correct. All right, and your phone number? 916-430-5607. All right, so 916-430-5607. Okay. Yes. All right, well, we'll be there at 2:00pm today. Okay. Okay. And if somebody cancels it or something sooner I'm available like anytime. So you know, if somebody. Oh, like. Yeah, I mean I could do like I'm here, my property, whenever I'm accessible 24 hours. So sooner the better. I'm just trying to get this. An idea to play on this. To get this hold on. Let me just double check. Can they put you in hold for a second? Yes, right now. Hold on. Okay, thank you. It. Yeah, Hi, David. Hello, David. Yes. Yeah, we should be there at around 12:30. 12:30. Okay. Yeah, sooner the better, finds. I know. Why, just give me a call. When? Maybe you can just call me when they're like 10 minutes out or something. Yes, okay, I will. We will. All right. That sounds good. Thank you so much. We'll see you then. Could you verify my phone number, just in case, make sure it's right? Yeah, it's 916-430-5607. That's correct. Okay, perfect. Thank you so much. You have a wonderful day. Bye. Okay, bye. Bye."
  },
  {
    "id": "CAL019b99c2c9f27f119abcb44af52f57ee",
    "direction": "inbound",
    "duration": 280,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19256761201",
    "customer_name": "PACIFIC POWER  ",
    "customer_city": "Concord",
    "start_time": "2026-01-07T10:40:38.338-08:00",
    "transcript": "Hello. Good morning. Hi. Is this Rhino Concrete? Yeah. Hi, my name is Lisa and I have a job, a prevailing wage job for a sidewalk replacement in Oakland. Is that something you guys do? Sorry, Lisa, is the sidewalk part of the city? It is. It's an open parking lot that we're working in. We're doing work there. In the sidewalk. There's a sidewalk in that parking lot? We already have permits, work approved and everything. Oh, I see. But is that sidewalk part of the property or part of the city? Because if it's part of the city, there's special kind of contractor who does those type of sidewalks. It's a private parking lot. Oh, okay. So it's within the property? Yes. And what's the size of the sidewalk? It's about 25ft. 25Ft. Okay, and so you, you've got the permits already? We have permits and approval. I see. Okay, so let me check my calendar. Okay, one second. See? Okay. And we can also send plans to you. Oh, you have the plans as well? We do. Okay, sounds good. All right, hold on a second, please. Let me just check my calendar. One moment. Okay. Okay, it. Okay, so we have an opening tomorrow afternoon or Thursday or Friday morning. What would be a good time for you? Friday probably. Do you want to look at the plans and give us an estimate? Yeah, sure. But we'd love to do a site visit so that we could. For a site visit? Yeah, yeah, we would love to take a look at the existing condition before we can put our estimates. Yeah, tomorrow would probably work. Okay, tomorrow afternoon around 3:00pm I'm sorry, around 1 or 2:00pm yeah, 1 or. That's better. Okay, 1:00pm alrighty. So can you please. Nope. You cut out. Oh, sorry. Are you the homeowner? It's a commercial property. Oh, commercial. Okay. So we're a business that's subcontracting this out. Oh, you are subcontract contracting it? Correct. Oh, I see. That's why we have all the permits and everything. But are you, are you, are you a contractor? Yeah. Oh, well. Well, I'm not sure it's gonna work out for us though, because we're also gonna be subcontracting it. Oh, are you? Yeah, it's not gonna work out for us. Okay. Yeah, yeah. Better look for somebody who does the actual, you know, like, sidewalk. Yeah, yeah, we need a contractor that can come and do the sidewalk. Uh huh. Okay, well, wish you luck then. Okay, thank you. All right. Of course. Thank you so much. Bye. Bye."
  },
  {
    "id": "CAL019b99c9dd1c7d428991f99abce9a148",
    "direction": "inbound",
    "duration": 11,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+13232002668",
    "customer_name": "RIOS           ",
    "customer_city": "Los Angeles",
    "start_time": "2026-01-07T10:48:22.007-08:00",
    "transcript": "Google and Google Voice clients are currently having."
  },
  {
    "id": "CAL019b99f74210795689702ece126b8391",
    "direction": "inbound",
    "duration": 15,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+17205340843",
    "customer_name": "Telemarketer (Jordan Brown)",
    "customer_city": "Longmont",
    "start_time": "2026-01-07T11:37:56.977-08:00",
    "transcript": "Hello. Good morning. Hello."
  },
  {
    "id": "CAL019b9a110e32718480958f801d7c240a",
    "direction": "inbound",
    "duration": 14,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15102008073",
    "customer_name": "HAYWARD CA     ",
    "customer_city": "Hayward",
    "start_time": "2026-01-07T12:06:07.633-08:00",
    "transcript": "Finding you. Press hello."
  },
  {
    "id": "CAL019b9a2182ad7713ac4fe1999eba7b39",
    "direction": "inbound",
    "duration": 57,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+12138083757",
    "customer_name": "PRIVATE        ",
    "customer_city": "Los Angeles",
    "start_time": "2026-01-07T12:24:06.025-08:00",
    "transcript": "Hello? Good afternoon. Hey, good afternoon. Am I speaking with Lori? No, this is not Lori. Who's calling? This is Ace. We had a talk with Lori regarding rhino builders estimation work. Like we provide the estimation work. So I was just looking up the opportunity. Lori told us to contact you guys in January. If you guys will be bidding, we can help you in that regards. No, I think we're good in that area. Well, thanks for calling. Specific reason like in house team. What's that? Do you have the in house team that's the reason or should I follow up like. Oh, okay. Okay, I got it. Thank you so much. Appreciate it. All. Right. Okay, bye. Bye. Bye."
  },
  {
    "id": "CAL019b9a2d97997cdd819a498807ed19c8",
    "direction": "inbound",
    "duration": 14,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+17602063092",
    "customer_name": "LEE VINING CA  ",
    "customer_city": "Lee Vining",
    "start_time": "2026-01-07T12:37:17.816-08:00",
    "transcript": "To avoid any suspension or verification issues."
  },
  {
    "id": "CAL019b9a3aac787ac4b5c14df3249256fd",
    "direction": "inbound",
    "duration": 14,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+18133550806",
    "customer_name": "ZEPHYRHILLS FL ",
    "customer_city": "Zephyrhills",
    "start_time": "2026-01-07T12:51:35.097-08:00",
    "transcript": "Hello. Good afternoon."
  },
  {
    "id": "CAL019b9ad178217011a3e13002f668bda7",
    "direction": "inbound",
    "duration": 44,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+12132794061",
    "customer_name": "LOS ANGELES CA ",
    "customer_city": "Los Angeles",
    "start_time": "2026-01-07T15:36:17.657-08:00",
    "transcript": "Hello, this is Roly. Hi, is this Rhino bathroom? Yes, it is. Hi. How are you doing today? All good? Yeah. Good. Cool. Hey, listen, my name is Ricky, and you're probably gonna hate me here, but this is a cold call. You want to give me 30 seconds, see if it's worth your time? I'm sorry, but I have other things to do. No problem. You have a great day. All right?"
  },
  {
    "id": "CAL019b9b2c271176cfbbb482b1485d6615",
    "direction": "inbound",
    "duration": 19,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+15516662644",
    "customer_name": "GORICA ELSON   ",
    "customer_city": "Bayonne",
    "start_time": "2026-01-07T17:15:20.690-08:00",
    "transcript": "Delay is actually made."
  },
  {
    "id": "CAL019b9e6102757f9885156f3cfaeafd57",
    "direction": "inbound",
    "duration": 35,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+16192101410",
    "customer_name": "HSBC BANK USA  ",
    "customer_city": "Chula Vista",
    "start_time": "2026-01-08T08:11:56.324-08:00",
    "transcript": "Representative to take care of this. To address this immediately, press 4. This will only take a few minutes. To opt out, press 9 or call 959-262-8948."
  },
  {
    "id": "CAL019b9e6c6fa078a8ba3f2660eb67c393",
    "direction": "inbound",
    "duration": 44,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+16502481132",
    "customer_name": "PEREZ LORENA   ",
    "customer_city": "Palo Alto",
    "start_time": "2026-01-08T08:24:25.209-08:00",
    "transcript": "Hi, my name is Lorena. I live in Hayward and we. I have an issue with my basement. It seems that there is a water leak coming from the retaining wall. I'm not sure if you guys service the area of Hayward, but if you can, please call me back at 650-248-1132. Once again, the phone number is 650-248-1132. Thank you."
  },
  {
    "id": "CAL019b9e80bd7b7384830ea84fdbc2ce50",
    "direction": "inbound",
    "duration": 42,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+13232002668",
    "customer_name": "RIOS           ",
    "customer_city": "Los Angeles",
    "start_time": "2026-01-08T08:46:35.865-08:00",
    "transcript": "Again, your business is not showing correctly on Google and Google Voice Search. Press 1 to speak to an agent, press 2 or dial 877-865-5852 to."
  },
  {
    "id": "CAL019b9e8a7a0a7e689d3f9fb474298538",
    "direction": "inbound",
    "duration": 30,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+16262020444",
    "customer_name": "ALHAMBRA CA    ",
    "customer_city": "Alhambra",
    "start_time": "2026-01-08T08:57:13.961-08:00",
    "transcript": "To get this handled. It only takes a few minutes to opt out. Press 9 or call 619-935-1051."
  },
  {
    "id": "CAL019b9edd55b170c081412f1bcacdc7af",
    "direction": "inbound",
    "duration": 18,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19253181292",
    "customer_name": "PITTSBURG CA   ",
    "customer_city": "Pittsburg",
    "start_time": "2026-01-08T10:27:44.140-08:00",
    "transcript": "One. Hello. Good morning. Then to remove."
  },
  {
    "id": "CAL019b9ee5239070bc87fe72997653616f",
    "direction": "inbound",
    "duration": 39,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+12102938030",
    "customer_name": "SAN ANTONIO TX ",
    "customer_city": "San Antonio",
    "start_time": "2026-01-08T10:36:15.600-08:00",
    "transcript": "Hello. Good morning. Hi, good morning. This is Arthur Wade from Bidding Enterprise. How are you doing today? I'm doing good. How can I help you? Can I speak with someone who is like, taking decisions for estimates or takeoffs? What is it about? Actually, we provide pre construction cost estimating. Oh, no, we don't need it. We don't need it. Thank you for your time. Yeah, thank you. Okay."
  },
  {
    "id": "CAL019b9f0b97d5724c9b50479c03332d21",
    "direction": "inbound",
    "duration": 59,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+17079302107",
    "customer_name": "ANNAPOLIS CA   ",
    "customer_city": "Annapolis",
    "start_time": "2026-01-08T11:18:15.734-08:00",
    "transcript": "Hello. Good morning. Hi, my name is Stephanie. I was looking for more Perez. Why is that available? I mean, what is it about Stephanie? Well, I'm calling. I'm from the Aspire Institute. We have a business management workshop coming up, San Ramon. So we're kind of reaching out to our GCs and seeing how things are going out there. Okay, I will let her know. Okay. I have office@rhino builders1989.com. Is that a good email? Yeah. Okay. If you just let them know that, like, I'm going to send out this email real quick and it could potentially end up in their junk mail, and it's all of my contact information is at the very bottom. Okay, sounds good. All right, thank you. All right, thank you. Bye."
  },
  {
    "id": "CAL019b9f191e8d756c91d16c56cb9b3c8b",
    "direction": "inbound",
    "duration": 9,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252031731",
    "customer_name": "PITTSBURG CA   ",
    "customer_city": "Pittsburg",
    "start_time": "2026-01-08T11:33:02.180-08:00",
    "transcript": "Has been flagged for review by the business."
  },
  {
    "id": "CAL019ba01e440b7d11a939cffa5b7b8b13",
    "direction": "inbound",
    "duration": 45,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+14156196438",
    "customer_name": "BELVEDERE CA   ",
    "customer_city": "Belvedere",
    "start_time": "2026-01-08T16:18:16.675-08:00",
    "transcript": "Hello, this is Roly. Hello, my name is Todd Michaels, and I'm calling on behalf of Pacific Gas and Electric Company in partnership with Escalant, a national research firm. We're conducting a survey among customers to better understand their interest in electrifying appliances in their homes."
  },
  {
    "id": "CAL019ba380a2d6715ab74688284dcb70a2",
    "direction": "inbound",
    "duration": 35,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+13232002262",
    "customer_name": "BANK OF AMERICA",
    "customer_city": "Los Angeles",
    "start_time": "2026-01-09T08:04:35.090-08:00",
    "transcript": "Representative to take care of this. To address this immediately, press 4. This will only take a few minutes. To opt out, press 9 or call 959-262-8948."
  },
  {
    "id": "CAL019ba3cd494a7205a671824b6d2a41e5",
    "direction": "inbound",
    "duration": 14,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+12092004878",
    "customer_name": "LODI CA        ",
    "customer_city": "Lodi",
    "start_time": "2026-01-09T09:28:18.472-08:00",
    "transcript": "Lists to avoid suspension or verification issue."
  },
  {
    "id": "CAL019ba3cf4b7d719c910bacbd9b721257",
    "direction": "inbound",
    "duration": 10,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+12092010180",
    "customer_name": "FUNKE MAJEBI   ",
    "customer_city": "Merced",
    "start_time": "2026-01-09T09:30:30.109-08:00",
    "transcript": "One to speak to an authorized representative to."
  },
  {
    "id": "CAL019bb31173177a8fadb11ca9bf107afd",
    "direction": "inbound",
    "duration": 32,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+16262021304",
    "customer_name": "ALHAMBRA CA    ",
    "customer_city": "Alhambra",
    "start_time": "2026-01-12T08:37:03.859-08:00",
    "transcript": "Again, your business is not showing correctly on Google and Google Voice Search. Press 1 to speak to an agent. Press 2 or dial 877-865-5852 to opt out."
  },
  {
    "id": "CAL019bb32970f1735f8ccb0153f6e14048",
    "direction": "inbound",
    "duration": 43,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+17075633040",
    "customer_name": "LOWE           ",
    "customer_city": "Vallejo",
    "start_time": "2026-01-12T09:03:16.172-08:00",
    "transcript": "Hello, this is Roli. Hey, it's Praveen. Call from Lowe's in Vallejo. We want to do a phone sale. Sorry, what did you say? This is Lowe's in Vallejo. Uh huh. We're trying to do a phone sale. Oh, sorry, I'm not interested. This isn't the right number to call. Oh, I apologize. All right."
  },
  {
    "id": "CAL019bb32a79e67fee96b335482c78646f",
    "direction": "inbound",
    "duration": 378,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+17075633040",
    "customer_name": "LOWE           ",
    "customer_city": "Vallejo",
    "start_time": "2026-01-12T09:04:24.006-08:00",
    "transcript": "Thank you. Hey, sorry, I just got informed that you guys are gonna call. Okay. Okay, no problem. May I get the credit card number that we want to use? Sure thing. I need to know what materials are. Yeah, it's eight bags of deck mud. Okay. That's it. Yeah. Deck. How do you call it? Deck. Oh, deck mud. Mud. Deck mud. It's for Victor. Dec mud. Eight bags. All right. And what job is this? For what address? Kickballs. Got it. Okay, Kit, let me confirm this with our project manager. I'll just sure get back to you. Okay. Oh, sorry. How much is it? Hello? Hello? How much is it again? I believe $56 and 56 cents. Let me confirm. Sorry, someone was calling. Yeah, 56, 56. 56, 56. Huh? All right. Okay, let me. Put me a hold now. Sam. Sa. Hello? Okay. Hello? I'm ready to pay. Okay, go ahead. All right, it should be 3767, 574-418-53. And then three zeros. Expiration date. 0830. And the three digit security code? I believe it's four, but it's 9653. Okay, 9653. You said the first three digits were. I'm sorry, 3707. Oh, for the credit card number, it's three seven six. Oh, six seven. Sorry. Okay. All right. One moment. It. Okay, what's the zip code for the card? It's 94563. And the first and last name on the card? Shy zilber. S h a y z I l b e r. You said s h y. S h a y a y. S h a y. Okay, hold on. What po would you like to use for this? You mean delivery address? No, just to reference it. Like what do you want? You want. What do you want to label this transaction? Oh, Rhino Builders, it's construction company. And do you want an email receipt or just give them a printed receipt? Yeah, I need the online receipt through email. Let me give you my email address. It should be M A R R O L l a@rhinotheanimal builders with an S 1989 dot com. Okay, you're all set. All right. Thank you so much. Thank you."
  },
  {
    "id": "CAL019bb33e2324777f9c394f1086a2ccd2",
    "direction": "inbound",
    "duration": 66,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15106195564",
    "customer_name": "WIRELESS CALLER",
    "customer_city": "Richmond",
    "start_time": "2026-01-12T09:25:52.509-08:00",
    "transcript": "Hello. Good morning. Hello. I was wondering if you guys. Hello. Yes, Hi. Good morning. Good morning. I was wondering if you guys provide a service. Do you guys cut, like, concrete, like, openings and like, cinder blocks, like on. Like, if you guys cut openings and cinder block walls. What kind of project do you have? It's a construction project, a commercial construction project. We need to do some saw cutting in cinder block. I'm sorry, I cannot. I could barely hear him. It's a construction project. And. Are you guys a concrete saw cutting company? No, we don't cut. We install. Okay, thank you. Bye. Bye. All right. Okay, bye."
  },
  {
    "id": "CAL019bb38933e27955bfa74191661a1673",
    "direction": "inbound",
    "duration": 194,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+14156906630",
    "customer_name": "SHAY ZILBER",
    "customer_city": "Belvedere",
    "start_time": "2026-01-12T10:47:51.983-08:00",
    "transcript": "אהלן, אהלן, אהלן. אהלן, אהלן, אהלן, אהלן. אהלן, אהלן, אהלן. אהלן, אהלן, אהלן, אהלן. אני מתקדם כשאתה מתקדם. אוקיי, זה 510. חכה, זה בסדר, זה בסדר. אוקיי. זה בסדר. אלון, אלון יקבל אתכם בקצב, להשאל אתכם להתקדם עליהם, אוקיי? הוא יקבל אתכם, והוא יקבל אתכם להשאל אתכם להתקדם, אוקיי? אוקיי, בסדר. What else did I want to know and I don't also want to have a blank. A copy of a of an addition job for the production board. Open up. Yeah. Like a like 500 square foot addition previous estimates I think it's gonna be pretty similar for like there's like plumbing and standard. 500 סקור פותחים. קוראים לו, קוראים לו, כמה שנים קוראים. לו, כמה שנים לו, כמה קוראים כמה. שנים קוראים לו, כמה כמה שנים קוראים. לו, כמה שנים קוראים לו, כמה שנים. קוראים לו, כמה שנים קוראים לו, כמה. שנים קוראים לו, כמה שנים קוראים לו. כמה שנים קוראים לו, כמה שנים קוראים. לו, כמה שנים קוראים לו, כמה שנים. קוראים לו, כמה שנים קוראים לו, כמה שנים קוראים לו, כמה שנים קוראים לו. כמה שנים קוראים לו, כמה שנים קוראים. לו. יש לנו חוזה, אריאס, הרבה נוסעים. חוזה הוא טוב. פשוט נותן לו חוזה, והוא יפסיק את זה. אוקיי? אני אעשה לו קפה, כי הוא יכול להחליט את זה. אוקיי, אני אעשה לו קפה. כן, נותן לו קפה, בטח. אם אתה יכול לנתן לו קפה מופיעה, אז אני יכול להשתמש. אוקיי, בסדר. תודה. יאללה פגז זה מצוין וגם תדע לך את הפלטפורמה הזאת היא ממש טובה. לכל דבר אתה מבין פשוט תשמור אותה. תשמור את הפייל הזה איפשהו בנות שלך. ותרשום מתחת לזה אדישן. ואז כל פעם אתה תחזור לזה. אוקיי, זהו, תודה. תודה, ביי."
  },
  {
    "id": "CAL019bb3bbc7de7d1e94002abdd4da75de",
    "direction": "inbound",
    "duration": 25,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+17079302107",
    "customer_name": "ANNAPOLIS CA   ",
    "customer_city": "Annapolis",
    "start_time": "2026-01-12T11:43:06.678-08:00",
    "transcript": "Hello. Good morning. Hi. My name is Stephanie with the Aspire Institute. Oh. Stephanie. Sorry. Sorry. We're not interested for now. Thank you. Oh."
  },
  {
    "id": "CAL019bb3e10f5f78d281f79f36ec9ce2a1",
    "direction": "inbound",
    "duration": 16,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19253510162",
    "customer_name": "PLEASANTON   CA",
    "customer_city": "Pleasanton",
    "start_time": "2026-01-12T12:23:49.787-08:00",
    "transcript": "Hello. Good afternoon. Hello."
  },
  {
    "id": "CAL019bb459953078f4b6979ad6b80a7f15",
    "direction": "inbound",
    "duration": 35,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+14156906630",
    "customer_name": "SHAY ZILBER",
    "customer_city": "Belvedere",
    "start_time": "2026-01-12T14:35:28.375-08:00",
    "transcript": "Yes. Shay. Why can't you pay? Victor? That's what I'm saying. Right now, I'm trying to pay floor and decor. And I don't know why it doesn't accept the American Express, but I'm finding ways how it can come through. Okay. All right. Bye."
  },
  {
    "id": "CAL019bb8253fde76dc976dae7ed8e2eee2",
    "direction": "inbound",
    "duration": 45,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+19843556182",
    "customer_name": "CRG            ",
    "customer_city": "Angier",
    "start_time": "2026-01-13T08:16:47.254-08:00",
    "transcript": "My name is Kathleen with Capital Registration Group reaching out for the owner of Rhino Builders to see if they have interest in a 5 year non bidding GSA contract with the Federal and State local government facilities GSA to do maintenance, repair and installs commercially. My number is 984-355-6182. Direct to me, Kathleen 984-355-618 2. I look forward to speaking with you. Have a nice and safe day."
  },
  {
    "id": "CAL019bb8415b2e77bcb72de0b0f1b4ce50",
    "direction": "inbound",
    "duration": 37,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+17078806994",
    "customer_name": "VACAVILLE CA   ",
    "customer_city": "Vacaville",
    "start_time": "2026-01-13T08:47:29.546-08:00",
    "transcript": "Hello, Good morning, my name is Vicki. I am calling from state compensation insurance fund. I have an appointment today and I'm right here in the front. You can give me a call. My phone number 7078-8069-9470-7808-06994. Thank you so much. Bye bye."
  },
  {
    "id": "CAL019bb863e93e75989f15aa2a8e547895",
    "direction": "inbound",
    "duration": 77,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+17075516219",
    "customer_name": "WIRELESS CALLER",
    "customer_city": "Vallejo",
    "start_time": "2026-01-13T09:25:14.135-08:00",
    "transcript": "Hey, what's going on guys? My name is Rick over from the company, Big Creek Lumber. I came to visit the 27 Ichabod Lane project that you guys are apparently working on and just wanted to shake a hand, meet whoever was responsible for purchasing your guys materials itself. Just want to see if there might be an opportunity for us to work together, see if I can help you guys out on your next project. If anything, give me a call back. This is my direct line here at the office. 707-751-6219. I'll try you guys again a little bit later on today, but thank you. Hopefully hear from you guys soon. Bye."
  },
  {
    "id": "CAL019bb86d8ded72698371306706b3a8cb",
    "direction": "inbound",
    "duration": 117,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19256288877",
    "customer_name": "GREGORY BRENDA ",
    "customer_city": "Antioch",
    "start_time": "2026-01-13T09:35:46.113-08:00",
    "transcript": "Hello, this is Roly. Hi, Rollie. This is Damian. I'm with Diabolical Excavation. Oh, yeah. Hi. Yes, I did call. Sorry, what's your name? I'm Damian. Hi. Yeah, we're looking for an A class contractor can get us an encroachment permit. Is this possible with you guys? Yes. All right. And do you guys have a license? I forgot what it's called, but yes, yes, we're from. We're on their proof contractors list as well. Nice. Okay. And you guys are in Discovery Bay, right? Yeah, we service East Bay all the way. We do the whole Bay Area all the way up to, like, pretty much Shasta. Okay, I have a plan ready from PG&E and we want to get a call from you guys. I'm ready for the email. Okay. My email is info info at diablo, diablo excavation dot com. Ex-A V A T I O N. Diablo Excavation. Like the whole word? Yeah, just Diago Excavation, no spaces. Okay. Diabloxivation.com. all right, I'll send it over. And please, just give me a reply just to let me know that you got it. Will do. I'm out in the field today, so I'll probably be about an hour until I'm back in the office. I'll get to it as soon as possible. All right. Okay. Thank you so much. Thank you very much."
  },
  {
    "id": "CAL019bb8cc88897c7c8e2f0445febe5cc0",
    "direction": "inbound",
    "duration": 187,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+16692436028",
    "customer_name": "SIMAS JOSEPH   ",
    "customer_city": "San Jose West",
    "start_time": "2026-01-13T11:19:30.180-08:00",
    "transcript": "Hello, Good morning. Yes. Yeah, I would like to get an estimate on an adu. Okay, what kind of adu? Is it detached or attached to the property? Detached. I already built one. I have two houses side by side. Between the two houses I have three quarters of an acre. I put one behind 2170 and now I got plenty of room to put another unit behind 2180 Almaden Road. I would like to get an estimate and build the same like I did the first one, which is a really nice built. It's not a module or, you know, not a prefab. It's actual construction. Do you actually build them on site? Yes, we do. And. Okay, square footage of this ADU that you're thinking of. 1050 square feet, two bedroom, one bath. All right. Okay. So what city are you located in? San Jose. In San Jose. Okay. We do have an opening Tomorrow is Wednesday. Yeah, we have an opening tomorrow at around 10 or 11 in the morning. Will that work for you? Yes. Okay, let's just do 10am what's that? We'll do 10, 10am in the morning. Okay, 10am and can I please have your first and last name? Joe Seamas S I M A S. And what's the property address, Joe? 2170 Almaden Road. Okay, and what's the best number to reach you? 669-243-6028 thank you. And lastly, what's your email address? Joe Semas t.net Perfect. Okay, so that's going to be Joe Siemis atc.net and I'm gonna set you up for Tomorrow, Joe at 10 o' clock in the morning and one of the guys will be there to give you an estimate. Okay, thank you very much. Thank you. You have a good. How long you been in business, do you know? Oh, since 1989. Oh, wow. Okay, thank you. Thank you so much. You have a good one. Okay, bye. Bye. All right, bye."
  },
  {
    "id": "CAL019bb8e67e26700392d88c64521bea4d",
    "direction": "inbound",
    "duration": 15,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252056069",
    "customer_name": "DANVILLE CA    ",
    "customer_city": "Danville",
    "start_time": "2026-01-13T11:47:51.684-08:00",
    "transcript": "To speak with an agent immediately and verif."
  },
  {
    "id": "CAL019bb8f98b857e37a5316df1281237c6",
    "direction": "inbound",
    "duration": 170,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+18186163336",
    "customer_name": "LMW FINANCIAL",
    "customer_city": "Van Nuys",
    "start_time": "2026-01-13T12:08:37.515-08:00",
    "transcript": "Hello, this is Vivian. Hi, Vivian. This is Sarkis. How are you doing today, Sarkis? I'm good. How are you doing? Good. Sarkis. Happy New Year. Yeah. It's time for 1099s. I know. Oh, I didn't reply to the email. We'll be doing our own 1099 circus. Okay. Yeah. Moving forward. Or do you want me to never follow up on 1099s? Well, you can follow up. I mean, we'll never know if Shy will change his mind, you know. Yeah, yeah, that's. Honestly, that's completely fine by me. I hate 1099. I'm always happy to do it, but, you know, if you need help, let me know. But for now, I'm just gonna say client. Will, I wish if I could ask for your help, but then not. How many. How many do you usually have? It's not much. Quite a number. You have everything input in QuickBooks. Yeah, but everything is in QuickBooks. I can just run it. Yeah, we just make sure, like, you completed all the information. Oh, you have plenty. You have, like, 34, 35 between. Yeah, and I think I'm gonna still add up to the. To that number. I'm not done yet. Beautiful. Good luck. Let me know if you need help. The deadline is the 31st of this month, so you have two weeks ahead of you. And the W2 deadline is on February 2nd, correct? Yes, but, you know, better send it up in January. End of January, you know. Yeah, but my RW2 is hooked up with. With QuickBooks, and it says automatic filing on February 2nd. Yeah, that's the last day. So I don't know because. Because 31st is on Saturday, so usually they extended it to the next Monday. I see. Okay. As long as you know, it's connected to QuickBooks, it's automatic. That's fine with me. Make sure they file it. If you don't, they don't. If you don't, they don't file it by mistake or any error. You get a panel ahead of time. Yeah, of course. I think. I think you can. QuickBooks allows you to file it ahead of time because you get a civil penalty if you. You don't follow W2. They're very strict about that. Yeah. Alrighty. Okay. Okay, we'll. We'll do. Thanks so much. Okay. Have a good one. Are you too. Bye. Bye. All right, bye."
  },
  {
    "id": "CAL019bbdb9c23277ad9acdac58fb4a6af3",
    "direction": "inbound",
    "duration": 24,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252703639",
    "customer_name": "MILLER MELODY  ",
    "customer_city": "Concord",
    "start_time": "2026-01-14T10:17:06.299-08:00",
    "transcript": "Hello. Good morning. Hello. Hi. How are you doing today?"
  },
  {
    "id": "CAL019bbe06b0f57b64ae3235a8f2ec5d58",
    "direction": "inbound",
    "duration": 67,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+12095180430",
    "customer_name": "PIGGEE MORGAN  ",
    "customer_city": "Stockton",
    "start_time": "2026-01-14T11:41:08.175-08:00",
    "transcript": "Hello. Good morning. Hi. Good morning. My name is Morgan, and I work with Cali Roland Electric. I was wondering if there's anyone I could speak to about getting on your bid list for electrical contractors. There's nobody at the moment, but you could just send us an email. And what's your company name again? It's Callie Rowland Electric. Okay, yeah, just send us an email and we'll take it from there. Okay, what is the email? I can send it over to? It's officerinobuilders1989.com Got it. Okay, perfect. I will go ahead and have that sent over today. Thank you. All right, thank you. Bye."
  },
  {
    "id": "CAL019bbe67369a77518743d50fcd7c0e6d",
    "direction": "inbound",
    "duration": 57,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+15627529415",
    "customer_name": "NORWALK CA     ",
    "customer_city": "Norwalk",
    "start_time": "2026-01-14T13:26:33.844-08:00",
    "transcript": "Good afternoon, this is Eisha with PRV Engineers. Just call in to see if you're interested in engineering services. We are also mep. If you're interested, please call me back at this number. Thanks and have a good day."
  },
  {
    "id": "CAL019bbe699b4f7309a781a11ba8d6ae8d",
    "direction": "inbound",
    "duration": 55,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+14156906630",
    "customer_name": "SHAY ZILBER",
    "customer_city": "Belvedere",
    "start_time": "2026-01-14T13:29:10.682-08:00",
    "transcript": "Yes, I. So that's for the A license. The best one we got so far is 13,000. The. Other one was 35, right? Yeah, it was 35, but it includes the getting the permit. What? 20,000 for getting a feminine. I know. I'm just saying. And the first one did not include getting the permit. Yeah, it says that the owner should be the one to get the permit. But. Okay, give me the. Send me the phone number. Okay. All right, bye."
  },
  {
    "id": "CAL019bc29b3de77c24b3c7c2c3968d54b6",
    "direction": "inbound",
    "duration": 19,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19342011706",
    "customer_name": "HUNTINGTON NY  ",
    "customer_city": "Huntington",
    "start_time": "2026-01-15T09:01:52.444-08:00",
    "transcript": "Hello. Good morning. Hello."
  },
  {
    "id": "CAL019bc2b1d10f7797b5e1d779ccef4f85",
    "direction": "inbound",
    "duration": 37,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19254988033",
    "customer_name": "Unknown Caller",
    "customer_city": "Bishop Ranch",
    "start_time": "2026-01-15T09:26:31.899-08:00",
    "transcript": "Hello. Good morning. Hello. I'm open to speak to you. Reyna Gomez. Oh, she's no longer working with us. Oh, my apologies. The file must be out of date. The reason I'm calling is about possible credits for the business. Regarding the merchant account, do you know who makes the decisions? Considering that. Oh, no, we're good. We don't need that. I understand. Am I speaking to the person who's in charge of that? As I said, we don't need that right now, so thank you."
  },
  {
    "id": "CAL019bc302fb62768992613e2926100227",
    "direction": "inbound",
    "duration": 9,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252063536",
    "customer_name": "CALPINE        ",
    "customer_city": "Antioch",
    "start_time": "2026-01-15T10:55:11.165-08:00",
    "transcript": "System shows numerous searches for your business via Google."
  },
  {
    "id": "CAL019bc317743b7373b0d2dcb02f7b1eb2",
    "direction": "inbound",
    "duration": 50,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+12092081208",
    "customer_name": "KNIGHTS FERR CA",
    "customer_city": "Knights Ferry",
    "start_time": "2026-01-15T11:17:32.738-08:00",
    "transcript": "Hello. Good morning. Hi. How are you? I'm doing good. Who am I speaking with? My name is Frank, and you do kitchen remolding services, right? I'm sorry? You do kitchen remodeling services, Right? Kitchen. Kitchen, demolish. Remodeling. Remodeling. Yeah, we do. Do you have address, Frank? Are you the business owner? Right. Are you a homeowner, Frank? No, I'm not a homeowner. I'm actually looking to the business. Owner, please. It's not available."
  },
  {
    "id": "CAL019bc3184e5d71e2ad380e3da2779a1c",
    "direction": "inbound",
    "duration": 34,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+12092081208",
    "customer_name": "KNIGHTS FERR CA",
    "customer_city": "Knights Ferry",
    "start_time": "2026-01-15T11:18:28.660-08:00",
    "transcript": "Hello. Good morning. Hi. How are you? Good morning. How's it going? Yes, Frank, what's going to help you with? Are you manager in this company? Are you a homeowner or not? No. Okay. Do you have a project? What project exactly? I have a business proposal about your kitchen remodeling services. That's why I'm calling it today."
  },
  {
    "id": "CAL019bc35f32bc7772982b9adfefe611a0",
    "direction": "inbound",
    "duration": 335,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15745014642",
    "customer_name": "VIEWRAIL       ",
    "customer_city": "Goshen",
    "start_time": "2026-01-15T12:35:54.644-08:00",
    "transcript": "Hello, this is Roli. Hello, this is Andrea calling from viewrail. I'm responding to a form submission for a cable railing quote request that we received on the Viewrail website. Yeah, yes, from Shea. Okay, I was just calling to follow up on that a little bit. The next thing that we would need as far as getting a formal quote together would be some additional information about that. But I can start out by sending a follow up email with some of the information about our system. Some of the details don't line up 100% with what was requested, but I can show you what we do have and what our options are and that would also include a list of the additional information that would help us to build out a formal quote. Can I send out a floor plan for you guys to use for reference? It should be. Can you send out a what? A what? We have floor plans of the house. Oh, perfect. Yes, that would be exactly what we would need. As long as there's something on it that we can scale. If the measurements aren't on there specifically and then yes, we could go ahead based on that. Can I ask you like some detail type questions about the project? I'm not sure if I can answer those, but. Okay. All right. You'll do your best, right? Yeah. So I did see that they are requesting specifically like all black hardware and it says black cable. Do you know, do they want everything. Everything black? Yes, they want everything black. Okay, then I would recommend that we give you a quote for our Onyx rod system. We don't have a black cable option because it's been our experience that whatever you use to make the cable black eventually wears off just because of the flexibility of the cable. But we do have a quarter inch so similar profile quarter inch stainless steel rod that is powder coated black. And that would be, you know, we can send it with a black post, black hardware, black infill and everything. But that doesn't wear off, right? Or you're just saying what does it actually? Well, it comes with a 5 year finish warranty and I'm looking here Discovery Base. So it is not anywhere near the Pacific Ocean. And with it's within five miles of the Pacific Ocean. We do have some additional things that we can do to help preserve the life of the, of the railing. But no, it is a powder coat. So it's, it has a really good lasting ability because it's on a stable 1 1/4 inch rod as opposed to a cable that flexes. Okay. That would just be what I would recommend to have a totally black system. To have the black infill and the black post and the black handrail. Okay. I'll try to speak with the owner of the house if they're open, for the cable to be, you know, not black. Okay. If he's stubborn about it, then we'll go with that. If they're right. Well, I'll send in that email. Do you want me to include you on it as well, or will it go to you? If I send it to the email and file at, it should be at. Yeah, that's me. It's my role Rhino Builders. Okay. That was the email that was given then, and then just Shay was the name. I'll include a buyer's guide that will outline some of those options. And I'll also include our ICC report. That's our strength and safety testing for our system for some additional review. And then if you send the plans, we can go ahead and sort of preemptively prepare a quote for black onyx rods and go from there. Okay. In that email, I'll also send in the floor plan. What was that last part? I'll also send back the floor plans. Perfect. Perfect. Okay, that sounds good. And is there a specific timeline on this? Are they looking to move super quickly. Or within the next month we're going to install those. Okay, very good. All right, that sounds good. I will go ahead and get this introductory email and information out to you, and then when we get that plan back, we can work on that quote. All right. Okay, thank you. All right, thank you. Bye. All right, bye."
  },
  {
    "id": "CAL019bc36a3da47fb69a2f39f92e9993a5",
    "direction": "inbound",
    "duration": 19,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15162092017",
    "customer_name": "NASSAU ZONE NY ",
    "customer_city": "Floral Park",
    "start_time": "2026-01-15T12:47:58.333-08:00",
    "transcript": "Hello. Good afternoon. Very good afternoon. This is Daniel here. How are you?"
  },
  {
    "id": "CAL019bc36ac59d7b92b4573f3af67b9452",
    "direction": "inbound",
    "duration": 16,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15162092017",
    "customer_name": "NASSAU ZONE NY ",
    "customer_city": "Floral Park",
    "start_time": "2026-01-15T12:48:33.146-08:00",
    "transcript": "Hello. Good afternoon. Very good afternoon. This is Daniel."
  },
  {
    "id": "CAL019bc399add97221a4777406832f3dfb",
    "direction": "inbound",
    "duration": 112,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19255864878",
    "customer_name": "PLANT HAZARDOUS",
    "customer_city": "Concord",
    "start_time": "2026-01-15T13:39:47.253-08:00",
    "transcript": "Hello, this is Roly. Hi, Rolly. My name is Tyler Jaha. I'm with Plant Hazardous Services. Oscar Hernandez gave me your contact for some underground conduit at Lido in Discovery Bay. Yeah. Is this a class A contractor who I can get a cope with? Yes. I can send you a quote for the PG and E work. We're. We're PGD certified. I haven't really looked at the job, but I was gonna go drive by today. It's right down the street from my house. Oh. Nice. All right, do you have the plan that I send to Oscar? I do. I have the plans and the write up of all the details, so I'll take a look at it. I mainly just wanted to introduce myself and then I'll get back with you if I have any questions and try and get you guys something submitted over the weekend. All right, nice. Sorry, what's your name again? Tyler. Tyler. And my last name? J Hot J E H A. Sorry. It was just my telling you my last name is J hot J E H A. J E H A. All right, I'll save that on my contact. And I'll shoot you an email as well. Yes. So that I can send an email back with whatever you need. Yep, that sounds good. I appreciate it. All right, thank you so much, Tyler. Thank you for calling. We'll talk to you soon. Bye. Bye. All right, bye."
  },
  {
    "id": "CAL019bc3b59b867928a8a9237de5fa74cb",
    "direction": "inbound",
    "duration": 56,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+19252906377",
    "customer_name": "LIVERMORE    CA",
    "customer_city": "Livermore",
    "start_time": "2026-01-15T14:10:17.509-08:00",
    "transcript": "Press 2 to hear inquiry details. Press one to connect. Press two to hear inquiry details."
  },
  {
    "id": "CAL019bc3ed97c577ff80f6c64b6055c9c1",
    "direction": "inbound",
    "duration": 56,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+19252906377",
    "customer_name": "LIVERMORE    CA",
    "customer_city": "Livermore",
    "start_time": "2026-01-15T15:11:26.579-08:00",
    "transcript": "Press 2 to hear inquiry details. Press one to connect. Press two to hear inquiry details."
  },
  {
    "id": "CAL019bc425661a78809dcabc1583b0b767",
    "direction": "inbound",
    "duration": 56,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+19252906377",
    "customer_name": "LIVERMORE    CA",
    "customer_city": "Livermore",
    "start_time": "2026-01-15T16:12:23.931-08:00",
    "transcript": "Press 2 to hear inquiry details. Press one to connect. Press two to hear inquiry details."
  },
  {
    "id": "CAL019bc7cf2f0c7f00a0cf4de030f34fec",
    "direction": "inbound",
    "duration": 32,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+12104481106",
    "customer_name": "SAN ANTONIO TX ",
    "customer_city": "San Antonio",
    "start_time": "2026-01-16T09:16:42.606-08:00",
    "transcript": "Hello. Good morning. Hello. Hello."
  },
  {
    "id": "CAL019bc8519eb9745caa89ea4a7cb7c3ee",
    "direction": "inbound",
    "duration": 218,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15104578897",
    "customer_name": "LOPEZ JUAN     ",
    "customer_city": "East Bay - Mn Piedmont",
    "start_time": "2026-01-16T11:39:10.864-08:00",
    "transcript": "Hello, Good morning. Hi, good morning. Is this ADU Builders? Yes, it is. Me now is calling, please. Oh, yes, my name is Juan. I'm calling because I'm trying to convert a two car garage into an ADU and I was hoping to get an estimate done. Okay, okay, hold on a second. So two car garage to an adu. What city are you located? Hayward. Okay. All right. Yeah, we can definitely help you out with your project. We'd like to do a site visit first before we can give you an estimate. So I was wondering if you would be available, let's see here, if you'd be available this Monday. Yes, it's a holiday, but we still working? Oh, yeah, good, good point. Because I, well, I'd have to take my kids with me. Okay, let's do Tuesday. Tuesday. Okay, that works better. Yeah, and I'm available, you know the hours pretty much morning on. I'm available, but I do have to pick up my kids around 2:00'. Clock. Oh, no, no worries. We can come out at 10am Is that okay? Yes. Okay, and can I please get the complete address? Yes, it's 1166 Kimball Avenue. Okay. Hey, and what is your first and last name? Yes, it's Juan. J, U, A, N. Okay, last name Lopez. L, O, P, E, Z. Okay. All right. And Duan, what's a good phone number to reach you? Yes, it's 510-457-8897. And an email address as well, please. Sure. The name? Daniel and then the letter Y. Daniel again, Jr. Juniormail.com. Perfect. Thank you for that. Okay, so it's one, the address is 1166 Kimball Avenue in Hayward. And. Okay, you're the homeowner, right? Yes. Okay, all right, perfect. So we'll set it up for Tuesday on the 20th at 10am and I'll be sending you a text confirmation for that appointment and. All right, well, we'll see you then. And then after, after we come out there, we can send you an estimate. Perfect. And so you, you also handle like the design work? Yes, you can also we're a design and build company, so we can also help you out with the design stages. Oh, fantastic. Perfect. Thank you so much. All right, thank you. Okay, you have a wonderful day. Okay, you too. Bye. Bye. Okay, bye."
  },
  {
    "id": "CAL019bc86727d77878ad102b01f9bfc48e",
    "direction": "inbound",
    "duration": 86,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252331607",
    "customer_name": "SUNOL CA       ",
    "customer_city": "Sunol",
    "start_time": "2026-01-16T12:02:42.228-08:00",
    "transcript": "Hello, good afternoon. Yes, hi, this is Sam. I'm calling from. Nice job on the recorded line. I was actually searching for concrete contractor in the area and came across rhino retaining walls and pavers. I can see that UK provided fantastic service with 5 stars rating on your page. So congratulations. However, only few reviews here on your page so I'm just wondering if you normally ask your customers to have a review or you simply leave it up to them. I don't know. What exactly is the purpose of your call? I don't understand the purpose. Yeah, actually I'm not sure if you're aware that you rated five stars on your Google page. Am I talking to the owner? No, you're not. But what is the purpose of your call? So I can address it? Yeah, it's actually on as I mentioned earlier actually the Google page. We know. That. We'll just send an email. Yeah, we'll just send an email. Directly. To. The owner. Thank you for your. Time. Have a good day."
  },
  {
    "id": "CAL019bc871f921776b93d830001ac9e67a",
    "direction": "inbound",
    "duration": 216,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+18325276894",
    "customer_name": "VILLEGAS A.    ",
    "customer_city": "Humble",
    "start_time": "2026-01-16T12:14:24.511-08:00",
    "transcript": "Hello. Good afternoon. Hi. How you doing? Hi. Yeah, hi. How can I help? I was calling a project, original contractor, and I've got a project in San Leandro. I need to replace some siding or not replace, install new siding and some windows. I just wanted to see if you guys were interested in the project. You mentioned you're a gc? Yes, ma'. Am. Oh, okay. So I don't think it's gonna work for us because we're also GCs, and, you know, same thing with you. We're also going to be subbing our stuff out. Okay. So you guys don't. Don't do the siding directly? No, we do not. Okay. I mean, a lot of the times I can't hire a siding guy or window guy directly because they don't carry the insurance. We're pretty big gc. We do a lot of fire restoration and insurance repair if you're willing to. I mean, I've got a set of plans if you want to take a look at it and let me know what you guys can bid on. I don't have a problem doing it that way. But I do ask that you give me a price for your roofing, give me a price for framing, give me a price for windows and doors, Kind of separate it all. Even painting. Whatever you want to bid on. I don't have a problem with it, as you guys are interested, but what. We may not be able to give you all the project or we say, hey, you're a little high on this number. I've got this other contractor that can do it for. For this much. Can you match that number? And then we give you the whole project. We can work it out that way, but it's just really. As long as we're within our budget, we don't have a problem hiring a to work under us. Okay. Just send us the email and then we'll take a look at it and we'll take it from there. Okay. What was your name again? Vivian. Vivian. And what's a. What's a good email for you? It's officeinobuilders1989.com. Rhino builders 1989.com. Hello. Yeah, I got it. So, office@rhino builders1989.com yeah. Okay. And what all do you guys do? Just so I can put this down in my notes and just try and keep contractor. Yeah, we do everything. We also build houses from scratch. Okay. I mean, this is technically what it is. We're rebuilding it from the ground up. Okay. It has fire San Leandro. Okay. Leandro okay, so it's not too far from you guys. I pulled you guys up on. On Google Maps. And then at least take a look at it and see if you guys would be interested, and then we can go from there. Okay, thank you so much. Yeah, I'll keep an eye on that email. Okay. Thank you, Vivian. You're welcome. Bye. Bye."
  },
  {
    "id": "CAL019bc9062fe172b1923c89f00cd6e9aa",
    "direction": "inbound",
    "duration": 146,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+14152061386",
    "customer_name": "BROWN WILLIAM  ",
    "customer_city": "San Francisco",
    "start_time": "2026-01-16T14:56:24.515-08:00",
    "transcript": "Good afternoon. My name is Mike Brown. Back in 2018, we did a bathroom remodel using smart modeling and design. And I've got a problem with the San Francisco Assessor's Office right now because they say the project was never closed out. And I've got proof that I've actually paid the inspection fees. You guys are listed as being the agents who actually filed for the permits. I wonder if you could have someone call me so we can discuss this. The application in question was actually in April of 2018, and the permit number was 201-804-045506. And I was wondering if there was a way you could possibly close it out for us or whatever, because the San Francisco Assessor's Office says I've got to reopen the permit in order to close it, which doesn't make any sense at all. So, again, my name is Mike Brown. My address was 1031 Treat Avenue, San Francisco 94110. And my phone number is 415-206-1386. Hope to hear from you. Thank you. Bye."
  },
  {
    "id": "CAL019bcd6dd0757f89b6806cb0ad73e83d",
    "direction": "inbound",
    "duration": 81,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+18139218368",
    "customer_name": "TAMPA NORTH FL ",
    "customer_city": "Tampa North",
    "start_time": "2026-01-17T11:28:04.684-08:00",
    "transcript": "Hello. Hope you're doing well. My name is Mark Griffin. I'm managing principal at Sperry Griffin Partners and Top Sell Capital Advisors. Sorry to try to reach on a Saturday. Sometimes it's easier for business owners to speak on a Saturday, but just want to reach out to you About Us see if we could be of service this year. We are merger and acquisition advisors and business brokers. I've been in the industry for over 20 years. We start what's called a Market Valuation Exit Plan Document, which is the first step for us and working with clients. And really it's more than just the valuation, it's a roadmap to your exit of your business. Most business owners have never planned for their exit, leaving a lot of questions unanswered and money on the table. I'd love to share a sample copy of that with you. The other thing is we are also uniquely qualified in commercial real estate. We're affiliated with Sperry, which is a national company on the commercial real estate side. So if your concrete ready mix company includes real estate, we can really help you with that as well if it's part of the business. But anyway, give me a call when you get a chance. If you're Interested in chatting 864-525-8562 on my mobile, that's the best way to reach me. Thank you."
  },
  {
    "id": "CAL019bcd6eb442763281fe1a1b7281a142",
    "direction": "inbound",
    "duration": 82,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+17072893693",
    "customer_name": "KELSEYVILLE  CA",
    "customer_city": "Kelseyville",
    "start_time": "2026-01-17T11:29:02.985-08:00",
    "transcript": "Hello. Hope you're doing well. My name is Mark Griffin. I'm managing principal at Sperry Griffin Partners and Top Sell Capital Advisors. Sorry to try to reach on a Saturday. Sometimes it's easier for business owners to speak on a Saturday, but just want to reach out to you About Us see if we could be of service this year. We are merger and acquisition advisors and business brokers. I've been in the industry for over 20 years. We start what's called a Market Valuation Exit Plan Document, which is the first step for us and working with clients. And really it's more than just a valuation, it's a roadmap to your exit of your business. Most business owners have never planned for their exit, leaving a lot of questions unanswered and money on the table. I'd love to share a sample copy of that with you. The other thing is we are also uniquely qualified in commercial real estate. We're affiliated with Sperry, which is a national company on the commercial real estate side. So if your concrete ready mix company includes real estate, we can really help you with that as well if it's part of the business. But anyway, give me a call when you get a chance. If you're Interested in chatting 864-525-8562 on my mobile, that's the best way to reach me. Thank you."
  },
  {
    "id": "CAL019bcd773e5673a2b59a562cb55fe082",
    "direction": "inbound",
    "duration": 81,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+17072893693",
    "customer_name": "KELSEYVILLE  CA",
    "customer_city": "Kelseyville",
    "start_time": "2026-01-17T11:38:22.651-08:00",
    "transcript": "Hello. Hope you're doing well. My name is Mark Griffin. I'm managing principal at Sperry Griffin Partners and Top Sell Capital Advisors. Sorry to try to reach on a Saturday. Sometimes it's easier for business owners to speak on a Saturday, but just want to reach out to you About Us see if we could be of service this year. We are merger and acquisition advisors and business brokers. I've been in the industry for over 20 years. We start what's called a Market Valuation Exit Plan Document, which is the first step for us and working with clients. And really it's more than just the valuation, it's a roadmap to your exit of your business. Most business owners have never planned for their exit, leaving a lot of questions unanswered and money on the table. I'd love to share a sample copy of that with you. The other thing is we are also uniquely qualified in commercial real estate. We're affiliated with Sperry, which is a national company on the commercial real estate side. So if your concrete ready mix company includes real estate, we can really help you with that as well if it's part of the business. But anyway, give me a call when you get a chance. If you're Interested in chatting 864-525-8562 on my mobile, that's the best way to reach me. Thank you."
  },
  {
    "id": "CAL019bd71e1b4977648b5fefaf546c3f26",
    "direction": "inbound",
    "duration": 33,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+19252039753",
    "customer_name": "PITTSBURG CA   ",
    "customer_city": "Pittsburg",
    "start_time": "2026-01-19T08:37:13.125-08:00",
    "transcript": "Again, your business is not showing correctly on Google and Google Voice Search. Press 1 to speak to an agent. Press 2 or dial 877-865-5852 to opt out."
  },
  {
    "id": "CAL019bd72e929d7707a52ef44674d158c5",
    "direction": "inbound",
    "duration": 35,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+19252140906",
    "customer_name": "WALNUT CREEK CA",
    "customer_city": "Walnut Creek",
    "start_time": "2026-01-19T08:55:12.242-08:00",
    "transcript": "Authorized representative to take care of this. To address this immediately, press 4. This will only take a few minutes. To opt out, press 9 or call 959-262-8948."
  },
  {
    "id": "CAL019bd74621d47bbba126143a2b2276de",
    "direction": "inbound",
    "duration": 16,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252063699",
    "customer_name": "ANTIOCH CA     ",
    "customer_city": "Antioch",
    "start_time": "2026-01-19T09:20:56.239-08:00",
    "transcript": "Searches if hello Service."
  },
  {
    "id": "CAL019bd74efae87c908e2c1ada75d5022f",
    "direction": "inbound",
    "duration": 24,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+12137211569",
    "customer_name": "LOS ANGELES  CA",
    "customer_city": "Los Angeles",
    "start_time": "2026-01-19T09:30:36.104-08:00",
    "transcript": "Hello. Good morning. Hello. Hello. Good morning."
  },
  {
    "id": "CAL019bd790787975dda7b3b63e2b9d36db",
    "direction": "inbound",
    "duration": 35,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252331428",
    "customer_name": "SUNOL CA       ",
    "customer_city": "Sunol",
    "start_time": "2026-01-19T10:42:08.080-08:00",
    "transcript": "So I'm calling you to Recorded line. Nice. Job. Rhino retaining wall. Yeah, good morning. This is Lewis. I'm calling you on a recorded line from. Nice job. I was searching for a concrete contractor when I came across your business page. Rhino Retaining Walls. Wanted to ask you, are you guys asking your customers to leave your reviews on your Google business page, or you kind of just leave it up to the customer? We're not really interested for now, but thank you for calling."
  },
  {
    "id": "CAL019bd7c90e447a4c9030df412b48ade7",
    "direction": "inbound",
    "duration": 18,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+17078962870",
    "customer_name": "GUALALA CA     ",
    "customer_city": "Gualala",
    "start_time": "2026-01-19T11:43:56.446-08:00",
    "transcript": "Hello. Good morning. Hello."
  },
  {
    "id": "CAL019bd7cd0f5e72bb8e3915994e693874",
    "direction": "inbound",
    "duration": 38,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19255807785",
    "customer_name": "DEBERNARDI DEVE",
    "customer_city": "Pleasanton",
    "start_time": "2026-01-19T11:48:18.853-08:00",
    "transcript": "Hello. Good morning. Good morning. Do you guys do possibly routine, but also right now, landscape, drainage, cleaning. Oh, cleaning. No, we do not. You just install? Yeah, we just installed. Yeah. Okay. No worries. Thank you. Okay. All right, bye."
  },
  {
    "id": "CAL019bd8215dc97ff0a35c4af155b0747b",
    "direction": "inbound",
    "duration": 60,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+17752487265",
    "customer_name": "COTTONWOOD C NV",
    "customer_city": "Cottonwood Creek",
    "start_time": "2026-01-19T13:20:23.968-08:00",
    "transcript": "Hey, this is Simon from Bidwell Estimates. I try to give you a call regarding our detailed estimate for all kind of bidding project. But go to your webmail, so reach me at 7 to 520-84494. Till then, have a great day. Talk soon."
  },
  {
    "id": "CAL019bd863674b7f4d9ce363cea8519fdf",
    "direction": "inbound",
    "duration": 111,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+19255256221",
    "customer_name": "MARCIEL DANIEL ",
    "customer_city": "Livermore",
    "start_time": "2026-01-19T14:32:31.775-08:00",
    "transcript": "Yes, Hi, this is Dan Marciel at 925-525-6221. We're having some issues with water, a lot of moisture under our house. And I got this number from Chad. He's a contractor for Shea Homes. And I was just calling. See, I don't know exactly what your company does. I don't know if we need a moisture barrier or actually and put a sump pump in or what we need to do, but it's concerning because I can start to see some damage to the foundation, stucco and stuff. So we've always had a lot of moisture in the house. We live in the bottom of the canyon. Anyway, if you can give me a call back, I'd appreciate it. Again, My number is 925-525-6221. And my name is Dan Marciel. Thank you so much. Bye."
  },
  {
    "id": "CAL019bd8d2353079dcbf6266b6003a86e1",
    "direction": "inbound",
    "duration": 49,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+16507590559",
    "customer_name": "SAN MATEO CA   ",
    "customer_city": "San Mateo",
    "start_time": "2026-01-19T16:33:33.446-08:00",
    "transcript": "Diane Galliani, 650-759-0559, please."
  },
  {
    "id": "CAL019bdc913d9e7d1cb3833d0983265d37",
    "direction": "inbound",
    "duration": 52,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15162180567",
    "customer_name": "PRIVATE        ",
    "customer_city": "Lynbrook",
    "start_time": "2026-01-20T10:01:04.626-08:00",
    "transcript": "Hello? Good morning. Good morning. This is Jo. How are you doing today? I'm doing good. How are you? I'm fine. Thanks for asking. Is this a good time to talk with you? No, I'm in the middle of something, actually. Okay. Should I call you later? What is it about? It's just a quick call from my side. I just wanted to see if you're looking to bid on a project where you need cost estimation. Are you a homeowner? No, I'm from an estimating company. Okay. No, we're good. We have that covered. Thank you."
  },
  {
    "id": "CAL019bdc929db87f61b3cf357dfbb1df60",
    "direction": "inbound",
    "duration": 56,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15104578897",
    "customer_name": "LOPEZ JUAN     ",
    "customer_city": "East Bay - Mn Piedmont",
    "start_time": "2026-01-20T10:02:34.775-08:00",
    "transcript": "Hello? Good morning. Hi. Good morning. Is this Vivian? Yes. He's calling. Yes. Hi, this is Juan. I have an appointment at 10am here in Hayward with one of your. Oh, they're not. They're not there yet? No, not yet. Okay, hold on a minute. Hold on a second. Okay. Let me check. Okay, Juan, let me just double check. Let me call you back. Okay? I'm gonna confirm where that guy is. Hold on a second. Okay, thank you. Thank you. Okay."
  },
  {
    "id": "CAL019bdcda151c7f808514587706a62ede",
    "direction": "inbound",
    "duration": 29,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15105713121",
    "customer_name": "HAYWARD CA     ",
    "customer_city": "Hayward",
    "start_time": "2026-01-20T11:20:38.397-08:00",
    "transcript": "Hello? Good morning. Hi. This call is being recorded and may be monitored. My name is Riley Shah. I'm calling this week with Mohammed. You got the wrong number. All right. Do you happen to know Muhammad by chance? No. All right. I'm so sorry about that. I'll definitely get your number moved. Thank you."
  },
  {
    "id": "CAL019bdcf3cae579b0b6770b3711d474e6",
    "direction": "inbound",
    "duration": 38,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+16505026876",
    "customer_name": "SOUTH SAN FR CA",
    "customer_city": "South San Francisco",
    "start_time": "2026-01-20T11:48:43.332-08:00",
    "transcript": "Builders. Please hold for the next available agent, Nina poyoung. Hello? This is a test call. Hello? Test call. Okay."
  },
  {
    "id": "CAL019bdd00d72977378b2da74af2faf957",
    "direction": "inbound",
    "duration": 34,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+16505026876",
    "customer_name": "SOUTH SAN FR CA",
    "customer_city": "South San Francisco",
    "start_time": "2026-01-20T12:02:58.442-08:00",
    "transcript": "The next available agent. Hello? Hello?"
  },
  {
    "id": "CAL019bdd0b53cc7291a728696fc807be5d",
    "direction": "inbound",
    "duration": 55,
    "answered": true,
    "voicemail": true,
    "customer_phone": "+12096433215",
    "customer_name": "LANTZ SARA",
    "customer_city": "Atwater",
    "start_time": "2026-01-20T12:14:25.690-08:00",
    "transcript": "Snail 4 Rhino Builders. No one is available to take your call. At the tone, please record your message. When you finish recording, you may hang up or press the pound key for more options. Good morning, this is Sarah Burge with Diablo Excavation and Construction. I'm calling in regards to an estimate 1359 that was given on 916 Lido Circle. After reviewing the estimate, we realized there was an error sent out, so I'd like to discuss the error. It is a cost savings of about $10,000, so please give me a call back. My number is 209-643-3215. Once again, it's Sarah Burge, Diablo Excavation and Construction, regarding 916 Lido Circle, Discovery Bay, California. Talk to you soon."
  },
  {
    "id": "CAL019bdd2c02fb7a57a1bce16f972799c2",
    "direction": "inbound",
    "duration": 290,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+14156097597",
    "customer_name": "FORBES JAMES   ",
    "customer_city": "San Francisco",
    "start_time": "2026-01-20T12:50:00.221-08:00",
    "transcript": "Please hold for the next available agent. Morning. Hi. I was just hoping to schedule a consultation for replacing some siding on my house. Siding? Yeah, sure. What city are you located? Oh, where are you guys located out of. We are in Lafayette, California. Okay. Yeah, I'm in San Francisco. Okay. All right, let me. Let me just open my calendar. So we do. We do have an opening to Mall San Francisco. Right. So hold on. Yes, we do have an opening on Thursday at around 10am Will that work for you? Yeah, no, I'm not available. What's a good day for you? I can do Thursday, but not until after 4. Oh, no, we don't have anything after 4. Is that schedule? I can do Monday. Next Monday on the 26th? Before 10:00am or after 11:00am okay, let's do Monday. That's going to be the 26th. I mean, after 9 or after 11 is what you said after 11. Yeah. Yeah. Okay. Yeah, we can do like 11:30. Okay. Okay, perfect. All right. So can I please. Oh, by the way, what time. What's the size of the wall that needs to be replaced? I don't know the. I don't know the exact size. It's not a rectangle, but it's an irregular shape. But it's two. It's two stories high. Huh. And then maybe like 25ft wide. Okay. For the longest part. But again, it's not a rectangle. Okay. And it's just going to be at the front part. The side or the back? It's just. This is just the side of the house. Okay. And what kind of siding do you. Want to replace it with? Well, I'm open to ideas. Right now it's vinyl and I don't. I don't think I want vinyl because the vinyl is just not holding up. The side of the house gets a lot of. It gets hit by the weather really intensely, like rain and wind. So, yeah, something probably a little bit sturdier. Okay, sounds good. Can I please guess the property address? Yeah, it's 265Minerva.m I N E R V A. Street. Yeah, street. And then can I just confirm, because I found you guys on Google, but it says that your address is in San Francisco. So I'm confused if I. Oh, those. Are just our satellite offices because, like, little, you know, like representatives all around. So we use those addresses, but our main office is in Lafayette. But San Francisco, we just call them San Francisco. Yeah. Okay. Minerva Street, San Francisco. And what's the best phone number to. Reach you at 415-609-759. 7. So 415-609-7597. And can I get your first and last name, please? Rachel R a c H e L. And my last name is Forbes F o r B e S. Thank you. And lastly, what's your email address? It's Rachel R a c h e L period. Catherine C a t h e r I n E period. Forbes F o r b e S gmail dot com. Perfect. All right. Thank you so much. So I'm going to schedule you for Monday the 26th at 11:30am okay. Okay, thank you. I will be sending you a text confirmation for this, for this appointment. All right? Okay, sounds good. All right. Thank you. Thanks, Rachel. Have a good one. Bye. Bye. Bye."
  },
  {
    "id": "CAL019bdd4161097bb59f8f30106e84eb09",
    "direction": "inbound",
    "duration": 209,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+16505026876",
    "customer_name": "SOUTH SAN FR CA",
    "customer_city": "South San Francisco",
    "start_time": "2026-01-20T13:13:28.039-08:00",
    "transcript": "Please hold for the next available agent. This call is being recorded. It. All of our agents are busy helping other customers. At the tone, please record your message. When you've finished recording, you may hang up or press the pound key for more options. Hi, this is Ara. This is a test call from Ringcentral."
  },
  {
    "id": "CAL019bdd552ad17eb39faa9abe1bc4064f",
    "direction": "inbound",
    "duration": 7,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252892880",
    "customer_name": "WALNUT CREEK CA",
    "customer_city": "Walnut Creek",
    "start_time": "2026-01-20T13:35:04.877-08:00",
    "transcript": "Builders. Please hold for the next available agent."
  },
  {
    "id": "CAL019bdd5e7cac741b81cee875279f25d7",
    "direction": "inbound",
    "duration": 17,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+14156256438",
    "customer_name": "Service Center (Telemarketer)",
    "customer_city": "San Francisco",
    "start_time": "2026-01-20T13:45:15.660-08:00",
    "transcript": "Please hold for the next available agent. This call is being recorded."
  },
  {
    "id": "CAL019bdd60f55a7487af48d7c8121cef41",
    "direction": "inbound",
    "duration": 118,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+17026022974",
    "customer_name": "OSHA R GROUP   ",
    "customer_city": "Jean",
    "start_time": "2026-01-20T13:47:57.594-08:00",
    "transcript": "Builders. Please hold for the next available agent. This call is being recorded. Sa. Sam. Sa."
  },
  {
    "id": "CAL019bdd68ec9f7a7ba8c9f05a4e5d1cc4",
    "direction": "inbound",
    "duration": 18,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+14156256438",
    "customer_name": "SAN FRANCSCO CA",
    "customer_city": "San Francisco",
    "start_time": "2026-01-20T13:56:39.671-08:00",
    "transcript": "The next available agent. This call is being recorded."
  },
  {
    "id": "CAL019bdd783f177f1ab631f0924775c8df",
    "direction": "inbound",
    "duration": 221,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+14153284522",
    "customer_name": "SMITH PETER    ",
    "customer_city": "Novato",
    "start_time": "2026-01-20T14:13:23.832-08:00",
    "transcript": "Please hold for the next available agent. This call is being recorded. Sa. It, Sam. All of our agents are busy helping other customers. At the tone, please record your message. When you finished recording, you may hang up or press the pound key for more options. Hello, my name is Peter Smith. I'm a civil engineer here in Danville and I was inquiring about some concrete work that we're looking at. So if you can give me a call, My number is 415-328-4522. I would greatly appreciate it. Thanks. Hope to talk to you soon. Bye."
  },
  {
    "id": "CAL019bddaf3d847699b9229f823d578ab1",
    "direction": "inbound",
    "duration": 41,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+16505026876",
    "customer_name": "SOUTH SAN FR CA",
    "customer_city": "South San Francisco",
    "start_time": "2026-01-20T15:13:27.911-08:00",
    "transcript": "Rhino Builders. Please hold for the next available agent. This call is being recorded. It."
  },
  {
    "id": "CAL019be00b4dc27e0e98ea90d61f4db5a3",
    "direction": "inbound",
    "duration": 16,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+16505026876",
    "customer_name": "SOUTH SAN FR CA",
    "customer_city": "South San Francisco",
    "start_time": "2026-01-21T02:13:15.809-08:00",
    "transcript": "Rhino builders. We are currently closed. At the tone, please leave a message. When you finished recording, you may hang up or press the pound key for more options."
  },
  {
    "id": "CAL019be00e0b657281b7cc2c434b4d098c",
    "direction": "inbound",
    "duration": 13,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+16505026876",
    "customer_name": "SOUTH SAN FR CA",
    "customer_city": "South San Francisco",
    "start_time": "2026-01-21T02:16:15.430-08:00",
    "transcript": "Rhino builders. We are currently closed. At the tone, please leave a message. When you finished recording, you may hang up or press the pound key for more options."
  },
  {
    "id": "CAL019be013a3a57f7686ff664c8d642f3b",
    "direction": "inbound",
    "duration": 12,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+16505026876",
    "customer_name": "SOUTH SAN FR CA",
    "customer_city": "South San Francisco",
    "start_time": "2026-01-21T02:22:22.087-08:00",
    "transcript": "We are unable to take your call at the moment. Please leave your name, phone number and a brief message and we will return your call as soon as possible."
  },
  {
    "id": "CAL019be1516f80788dbaddcf5cb9edc787",
    "direction": "inbound",
    "duration": 75,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19302434529",
    "customer_name": "BEDFORD IN     ",
    "customer_city": "Bedford",
    "start_time": "2026-01-21T08:09:29.172-08:00",
    "transcript": "Builders. Please hold for the next available agent. This call is being recorded."
  },
  {
    "id": "CAL019be198c51d783a9eaa87255bc4062e",
    "direction": "inbound",
    "duration": 46,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+14693050937",
    "customer_name": "PRIVATE        ",
    "customer_city": "Frisco",
    "start_time": "2026-01-21T09:27:24.147-08:00",
    "transcript": "For the next available agent. Hello? Hello? Hello? Hello? Hello. Good morning, this is Patricia with Coltony. Ma', am. I was just reaching there if the owner interested taking referral for residential work? No, we're good. Thank you. Bye bye."
  },
  {
    "id": "CAL019be19b19ae798a91f53e93148c812a",
    "direction": "inbound",
    "duration": 87,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+12132326931",
    "customer_name": "LOS ANGELES CA ",
    "customer_city": "Los Angeles",
    "start_time": "2026-01-21T09:29:56.867-08:00",
    "transcript": "Rhino Builders. Please hold for the next. Available agent. Hello, Good morning. Hi. This is Walafi. And are you guys taking on your jobs right now? Are you a homeowner? No. How can I help you? So I'm lining up contractors who can take on your jobs right now. And what kind of jobs does Reno Builders take? Are you. Are these for leads? No, no. I'm calling from Sky Resin Consulting. Do you have a project that you. No, no. Just. No. No. I just wanted to know, for example, what kind of jobs does Reno Builders take because we. And which homeowners they are looking for new jobs right now? I'm sorry, I don't understand you. So I'm asking what kind of job does build a con take? Because we at Skyouras can help and find homeowners. They are looking for new jobs right now. Ah, leads. I asked you about leads. Yes. So, no, we're good. Thank you. Okay."
  },
  {
    "id": "CAL019be1c02b707494a1b562c841f61432",
    "direction": "inbound",
    "duration": 24,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252020233",
    "customer_name": "PLEASANTON CA  ",
    "customer_city": "Pleasanton",
    "start_time": "2026-01-21T10:10:26.242-08:00",
    "transcript": "The next available agent. Our assistant shows new restrictions for your business. Google and Google Voice clients are currently having trouble finding you. Press 1 to speak with an agent immediately and verify your Google listing. Again, your business is not showing correctly on Google and Google Voice Search. Press 1 to send to an agent, press 2 or dial 877."
  },
  {
    "id": "CAL019be1de258a7069bb724a81028387ce",
    "direction": "inbound",
    "duration": 30,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+12137211565",
    "customer_name": "ORRANTIA EVELYN",
    "customer_city": "Los Angeles",
    "start_time": "2026-01-21T10:43:10.772-08:00",
    "transcript": "The next available agent. Hello. Good morning. Hello. Hello."
  },
  {
    "id": "CAL019be1e7e5c574898d415dfce95140b1",
    "direction": "inbound",
    "duration": 65,
    "answered": true,
    "voicemail": true,
    "customer_phone": "+15627529415",
    "customer_name": "NORWALK CA     ",
    "customer_city": "Norwalk",
    "start_time": "2026-01-21T10:53:49.846-08:00",
    "transcript": "Elders. Please hold for the next available agent. Thank you for calling Rhino Builders. We are unable to take your call at the moment. Please leave your name, phone number and a brief message and we will return your call as soon as possible. Thank you. Good morning, this is Eisha with PRV Engineers. Just calling to see if you're interested in engineering services. We are also nep. If you're interested, please call me back at this number. Thank you and have a good day."
  },
  {
    "id": "CAL019be1efb496737395503750f1a06ffa",
    "direction": "inbound",
    "duration": 19,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252034214",
    "customer_name": "PITTSBURG CA   ",
    "customer_city": "Pittsburg",
    "start_time": "2026-01-21T11:02:21.554-08:00",
    "transcript": "To the next available agent. Alexis has served numerous searches for your business Google and Google Voice clients are currently having trouble finding you. Press blind with an agent immediately and verify your Google listing. Hello, AI is not showing correctly on Google."
  },
  {
    "id": "CAL019be200f04f7a64b7a5cd0fe05899fb",
    "direction": "inbound",
    "duration": 11,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+16196497634",
    "customer_name": "NATIONAL CIT CA",
    "customer_city": "National City",
    "start_time": "2026-01-21T11:21:10.956-08:00",
    "transcript": "The next available agent."
  },
  {
    "id": "CAL019be2071c38732c86114ad8faba6eee",
    "direction": "inbound",
    "duration": 267,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+14159220178",
    "customer_name": "LITKE PROPS    ",
    "customer_city": "San Francisco",
    "start_time": "2026-01-21T11:27:47.788-08:00",
    "transcript": "For the next available agent. Hello. Good morning. Hello. Is this rhino siding and window replacement? Yes, it is. It's calling. Hi, this is tree calling from lickhe Properties. I'm inquiring for a siding installation actually for a building that we're working on. Do you guys offer quotes for that? We do, but are you a. Are you a contractor? We own the lot and we're working on it. Well, one of our team is basically the general contractor for it. Yeah. Oh, okay. But you just need somebody to do the siding for you. That's correct, yeah. Can you tell me how. What's the extent of the siding that needs to be. Is this a replacement or a new siding? New siding. Okay. And what's the square footage of that siding? Or maybe, like, how many. Is it just one house or is it a commercial building? It's a commercial building, but the siding is gonna be actually on the fourth floor. Oh, wow. Yeah. So the entire fourth floor just on. The side of the building. Okay. So not the front and back, Just the kind of like the left and right side. Oh, left and right. And what type of siding do you, you know, like, do you want to install? Let me see. Just slab siding. I'm sorry, A slab. Yeah. Okay. All right. What city are you located? San Francisco. San Francisco. Okay. All right, Let me check my calendar. San Francisco. I do believe I have somebody out there on Monday. We can come out in the afternoon. Say around 1pm so actually, we're working on. It's basically under construction right now, and we're kind of working towards getting the exterior done. So it's still in the process. We just reached cement floor on the first floor on the ground. So we're just. Basically, we're going to start framing up, and so we pretty much are just collecting quotes to get the exterior done, if that makes sense. There's nothing to look at. I have the plan. So it's not built even. It's not built yet. Yeah, it's not built yet, but we're just aligning all the contractors to get the exterior done, if that makes sense. I see. Well, if that's the case, I think the best thing we can do right now is we need to see specifics. Like, I'm sure you have plans, right? Yeah, I have plans. If you could forward the plans to us and then give us the exact specifications of the scope of work, and then we'll take it from there. Okay, perfect. Can I get an email I can send the plans to? Yes, yes. It's OfficeinoBuilders 1989. Rhino Builders, 1989. Rhino Builders. Builders is plural, right? Yeah, plural. Got it. So, office@rhino builders1989.com yes. Okay, perfect. All right, let me go ahead and send the. The plants over. And please let me know if you have any questions. Yeah. What's your name? My name is Tree. It's spelled T R I. Okay. Trey. Thank you so much. Appreciate it. Thank you. Okay. You have a good one. You, too. Bye. Bye. Bye."
  },
  {
    "id": "CAL019be23f4e1a7ba2b0f91cf0b9090f05",
    "direction": "inbound",
    "duration": 16,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252022964",
    "customer_name": "PLEASANTON CA  ",
    "customer_city": "Pleasanton",
    "start_time": "2026-01-21T12:29:18.201-08:00",
    "transcript": "Next available agent. Our system shows numerous searches for your business via Google and Google Voice. Clients are currently having trouble finding you. Just want to speak with an agent immediately and verify your Google listing."
  },
  {
    "id": "CAL019be249da297382a92e658942b7e2b9",
    "direction": "inbound",
    "duration": 46,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19092483032",
    "customer_name": "TSAO DAVID     ",
    "customer_city": "Chino",
    "start_time": "2026-01-21T12:40:49.384-08:00",
    "transcript": "Please hold for the next available agent. Hello? Good morning. Hello. Good morning. Hi, this is Harleen. How's the day going so far? All good? Yes. How can I help you? Good. I just wanted to ask you a quick question. Are you taking a new client nowadays? Am I speaking to a homeowner with a project? An agent working with a company called Born Again? No, we're good, thank you."
  },
  {
    "id": "CAL019be29699077523925352071a6b3fbe",
    "direction": "inbound",
    "duration": 56,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252906377",
    "customer_name": "LIVERMORE    CA",
    "customer_city": "Livermore",
    "start_time": "2026-01-21T14:04:38.943-08:00",
    "transcript": "As a courtesy call to see if you'd like to immediately respond. This call is being recorded. Press 1 to connect. Press 2 to hear inquiry details. Press one to connect. Press two to hear inquiry details. Press one to connect. Press two to hear inquiry details. Press one to connect. Press two to hear inquiry details. Press one to connect. Press two to hear inquiry details."
  },
  {
    "id": "CAL019be2b4694173ffbbdc85adb27329f9",
    "direction": "inbound",
    "duration": 219,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19257989600",
    "customer_name": "THE HOME DEPOT",
    "customer_city": "Concord",
    "start_time": "2026-01-21T14:37:12.827-08:00",
    "transcript": "Hi, good afternoon, this is Rudy with the Concord Home Depot. I have here Rudy doing a phone sale of 6502. Ready for your payment. Rudy? I haven't got a note that someone gonna put an order. Okay, can you ask him which address? Oh, sorry, it's seven Standard Court seven. All right, I'm gonna put you on. Hold so that I can confirm this payment. Hold on. Okay. All right. Sam. Hello? Hi. Hi. So how much is the 650265 and. All right. Okay. Do you accept payments over the phone? I'm sorry? Do you accept payments over the phone? Right. Yes. Yes, I'm ready for your credit card. Okay. All right, it's 3767-5744-4185-3000. And the expiration date should be 0830. I need a security code. It's 9653 969-65833. Month and year expiration 0830. Zip code. It's 94563. Thank you. Have a good day. Bye. Bye. Hold on. Can I get the."
  },
  {
    "id": "CAL019be2c007ff76fbbd56cd50d6e46c17",
    "direction": "inbound",
    "duration": 142,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15162180567",
    "customer_name": "PRIVATE        ",
    "customer_city": "Lynbrook",
    "start_time": "2026-01-21T14:49:54.392-08:00",
    "transcript": "Hold for the next available agent. This call is being recorded. Sa. Sam."
  },
  {
    "id": "CAL019be2cf6673746c874d73916920eeb4",
    "direction": "inbound",
    "duration": 56,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252906377",
    "customer_name": "LIVERMORE    CA",
    "customer_city": "Livermore",
    "start_time": "2026-01-21T15:06:41.565-08:00",
    "transcript": "Builders. As a courtesy, we've called to see if you'd like to. Immediately this call is being recorded. Press 1 to connect. Press 2 to hear inquiry details. Press one to connect. Press two to hear inquiry details. Press one to connect. Press two to hear inquiry details. Press one to connect. Press two to hear inquiry details. Press one to connect. Press two to hear inquiry details."
  },
  {
    "id": "CAL019be307b828723497bccf0e037905ee",
    "direction": "inbound",
    "duration": 56,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252906377",
    "customer_name": "LIVERMORE    CA",
    "customer_city": "Livermore",
    "start_time": "2026-01-21T16:08:12.505-08:00",
    "transcript": "As a courtesy, you call to see if you'd like to immediately respond. This call is being recorded. Press 1 to connect. Press 2 to hear inquiry details. Press one to connect. Press two to hear inquiry details. Press one to connect. Press two to hear inquiry details. Press one to connect. Press two to hear inquiry details. Press one to connect. Press two to hear inquiry details."
  },
  {
    "id": "CAL019be39b153275219670f87dd4a5aa3d",
    "direction": "inbound",
    "duration": 65,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+18064160606",
    "customer_name": "LUBBOCK TX     ",
    "customer_city": "Lubbock",
    "start_time": "2026-01-21T18:49:10.158-08:00",
    "transcript": "Unable to take your call at the moment. Please leave your name, phone number and a brief message and we will return your call as soon as possible. Thank you."
  },
  {
    "id": "CAL019be6a9e3e17f9989db1b662d81646b",
    "direction": "inbound",
    "duration": 40,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252020233",
    "customer_name": "PLEASANTON CA  ",
    "customer_city": "Pleasanton",
    "start_time": "2026-01-22T09:04:12.224-08:00",
    "transcript": "Next available agent. Our system shows numerous searches in your business and Google and Google Voice clients are currently having trouble finding you. Press 1 to speak with an agent immediately and verify your Google listing. Again, your business is not showing correctly on Google and Google Voice Search. Press 1 to speak to an agent. Hello, Good morning. Thank you so much for the holding time. My name is Victor Ramirez. How are you doing today? Hi, how can I help. You? I'm fine. And you are the business owner for Reno bathroom and home remodel."
  },
  {
    "id": "CAL019be6ad5c087a43b480bdd73e9122f5",
    "direction": "inbound",
    "duration": 19,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252042291",
    "customer_name": "ANTIOCH CA     ",
    "customer_city": "Antioch",
    "start_time": "2026-01-22T09:07:59.591-08:00",
    "transcript": "Google listing has been flagged in our system. For issues with verification, please press 2 immediately to speak with an authorized representative from my pro directory to take care of this. Your listing may be suspended or not appear in searches. If we do not take care of this, please press 2 now."
  },
  {
    "id": "CAL019be6b6767d7f3f9f18c8bad154655a",
    "direction": "inbound",
    "duration": 7,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+16195383683",
    "customer_name": "MARIA RUIZ     ",
    "customer_city": "San Diego",
    "start_time": "2026-01-22T09:17:56.178-08:00",
    "transcript": "Please hold to the next available agent."
  },
  {
    "id": "CAL019be6b84bcd72c19c7cf255567a0327",
    "direction": "inbound",
    "duration": 29,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19152353636",
    "customer_name": "GRAHAM BEVERLY ",
    "customer_city": "El Paso",
    "start_time": "2026-01-22T09:19:56.336-08:00",
    "transcript": "Hold for the next available agent. Hello? Good morning. Hello. Good morning. Hello."
  },
  {
    "id": "CAL019be6c1d83276b197315faee87aa286",
    "direction": "inbound",
    "duration": 17,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252386347",
    "customer_name": "Rhino Office Number - Vivian",
    "customer_city": "Antioch",
    "start_time": "2026-01-22T09:30:22.033-08:00",
    "transcript": "Hello? Ring central. The AGI. Basha. Again. Diako again. Hold on."
  },
  {
    "id": "CAL019be6d7f6397401ad121c7a987ca773",
    "direction": "inbound",
    "duration": 148,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15107254209",
    "customer_name": "OAKLAND CA     ",
    "customer_city": "East Bay - Berkeley",
    "start_time": "2026-01-22T09:54:31.574-08:00",
    "transcript": "Please hold for the next available agent. Hello? Hello? Oh, hi there. Hi. I was wondering if it was possible to speak with Mo, please. My name is Colleen. Hi, my name is Sam. I'm calling on behalf of Red Oak Realty. How are you? Red Oak Realty, how can I help? Yeah, yeah, it was just a quick call. I'm working with Red Oak at the moment as they are creating their first relocation and lifestyle magazine. The agents will be using it to introduce new buyers and sellers to the area and it's really kind of going to be something to show off the community and the lifestyle. So I was just calling to see if you might be interested in getting some details about featuring rhino builders in there as well. Of course. It aligns well with the clientele of Red Oak and I thought it'd be a really good fit for you guys. Where is Red Oak at? So Red Oak Realty, they have four offices within the area. So you've got. So you've got Oakland, Berkeley, El Cerrito and San Leandro. Oh, I see. Would they be areas that you focus on? As of the moment, we do have our marketing and marketing campaign. We already uploaded that ongoing. But yeah, you can just send us an email and if we, you know, would want to do that in the future. So we'll reach out. Of course, yeah. What's the best email for me to send some details to? I sent one before, but I'm not sure if it was the right1. It's officeinobuilders1989.com perfect. Yes. So I have sent an email across with some details already. It may have just gone into junk or spam, but just so you are aware, I'm in the area week commencing the 2nd of February, where I'll be hosting in meetings to go through the opportunity and how it might be beneficial for businesses. So if that's of interest, once you've reviewed the email, let me know and I'd love to come and see you guys to talk about it in detail. All right, sounds good then. Fabulous. No problem. Well, any questions in the meantime, just let me know and I'll be happy to help. I have to go. I have another call. Thank you. Okay, no problem. Bye. Thank you. Bye. Bye. All right, bye."
  },
  {
    "id": "CAL019be6d9f53473ecbd8529d7f6fa8f71",
    "direction": "inbound",
    "duration": 54,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+16627802724",
    "customer_name": "ASHLAND MS     ",
    "customer_city": "Ashland",
    "start_time": "2026-01-22T09:56:42.390-08:00",
    "transcript": "Builders. Please hold for the next available agent. Hello? Hi. Good morning. Hi. Sorry, I couldn't hear anything for a second. Yeah. How can I help? Well, this is Matt from Matt's Machine. I know I'm an interruption here, but do you mind if I grab a half a minute? I'll let you know exactly why I called, and then you can let me know if. It's. Actually very busy right now, Matt, so I can't. So just try again some other time. Okay. Sounds good. What's a good time of day to try? I don't know. I gotta go. Bye. Bye."
  },
  {
    "id": "CAL019be7363ccc7149854bc90abd49f728",
    "direction": "inbound",
    "duration": 32,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252063126",
    "customer_name": "ANTIOCH CA     ",
    "customer_city": "Antioch",
    "start_time": "2026-01-22T11:37:30.024-08:00",
    "transcript": "To the next available agent. Our system Consumer Searches inhibition via Google and Google Voice clients are currently having trouble finding you. Press 1 to speak with an agent immediately and verify your Google listing. Again, your business is not showing correctly on Google or Google Voice Search. Press 1 to speak to an agent. Press 2 or dial 877-865-5852 to."
  },
  {
    "id": "CAL019be73ed88c7eef812a96d4155cf495",
    "direction": "inbound",
    "duration": 22,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252063356",
    "customer_name": "ANTIOCH CA     ",
    "customer_city": "Antioch",
    "start_time": "2026-01-22T11:46:54.181-08:00",
    "transcript": "Please hold to the next available agent. Our system shows numerous searches for your business via Google and Google Voice. Clients are currently having trouble finding you. Press 1, speak with an agent immediately and verify your Google listing. Again, your business is not showing correctly on Google and Google Voice Search. Press 1 to speak to an agent."
  },
  {
    "id": "CAL019be74b7dfa7736b8e3f975c1b056c6",
    "direction": "inbound",
    "duration": 35,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252022889",
    "customer_name": "PLEASANTON CA  ",
    "customer_city": "Pleasanton",
    "start_time": "2026-01-22T12:00:42.965-08:00",
    "transcript": "Words attached. Please hold the list. Your Google business listing has been flagged for review by the Business Listing Specialist. To avoid any suspension or verification issues, please press 4 to speak to an authorized representative to take care of this. To address this immediately, press 4. This will only take a few minutes. To opt out, press 9 or call 959-262-8948. It."
  },
  {
    "id": "CAL019be74ddef474469d6ff95ec2608a3e",
    "direction": "inbound",
    "duration": 23,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252020104",
    "customer_name": "PLEASANTON CA  ",
    "customer_city": "Pleasanton",
    "start_time": "2026-01-22T12:03:18.867-08:00",
    "transcript": "Please hold for the next available agent log in your Google Business account. Our assistant shows numerous searches for your business because Google and Google Voice clients are currently having trouble finding you. Press 1 to speak with an agent immediately and verify your Google listing. Again, your business is not showing correctly on Google and Google Voice Search. Press 1 to speak to an agent. Press 2."
  },
  {
    "id": "CAL019be75856df7eb98c5acba3dd028192",
    "direction": "inbound",
    "duration": 13,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252181094",
    "customer_name": "PLEASANTON CA  ",
    "customer_city": "Pleasanton",
    "start_time": "2026-01-22T12:14:44.916-08:00",
    "transcript": "Please hold for the next available agent. Our system shows numerous searches for your business via Google and Google Voice. Clients are currently having trouble finding you. Press Y."
  },
  {
    "id": "CAL019be763862c73eeb894d964df5dfdb7",
    "direction": "inbound",
    "duration": 14,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252173115",
    "customer_name": "DANVILLE CA    ",
    "customer_city": "Danville",
    "start_time": "2026-01-22T12:26:57.921-08:00",
    "transcript": "This is Please hold to the next available Agent Alexisson shows numerous searches for your business Google and Google Voice clients are currently having trouble finding you. Press 1 to speak with an."
  },
  {
    "id": "CAL019be792f2b27c899195bcb1ffc4164d",
    "direction": "inbound",
    "duration": 199,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19256898999",
    "customer_name": "ASHBY LUMBER C",
    "customer_city": "Concord",
    "start_time": "2026-01-22T13:18:45.890-08:00",
    "transcript": "Builders. Please hold for the next available agent. This call is being recorded. Hello? Hi, this is Manny at Ashby Lumber and Concord. Oh, hi. Hi. I'm sorry. I have a delivery that I was working on with Selden. He asked me to reach out to Vivian, but I think I just missed her. He told me she was leaving at 1 for the payment, so. This is Roly. Oh, hi, Rolly. How are you? Just clocking in. So, okay, for which job is this again? This is for 1099 via Medea. I sent it over to office. If you want, I can forward it over to you. And then if you want to just confirm it and then I can. I can. And then you can let me know. I don't see it on our. Hold on. Let me wait for one of my emails. Yeah, I'll send it to you as well, just in case. I was going to try Clayton next, but I haven't talked to him in a while either, so I didn't know if he was around working with us anymore. Oh. Oh, he hasn't. Okay. Yeah, I figured. I figured I'd try the landline or the main office line first. It still will get forwarded to either me or Vivian. Okay. Okay, perfect. Okay, I see it. Receive. I'll send this to. I think it's project manager is. I'll confirm this with them and then I'll let you know when we're gonna do the payment. Perfect. Perfect. Yeah. So we have it set up for tomorrow afternoon. As soon as. As soon as you can, let me know. We just have to take care of it either today or, like, really early in the morning. Oh, okay. Let me call and then I'll let you know. Sounds good. No problem. Thank you very much. All right. Thank you. Thank you. Bye now."
  },
  {
    "id": "CAL019be7dde9997eff9815536d3c26f14e",
    "direction": "inbound",
    "duration": 279,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15105598299",
    "customer_name": "BPX PRINTING   ",
    "customer_city": "East Bay - Berkeley",
    "start_time": "2026-01-22T14:40:38.775-08:00",
    "transcript": "Hello, this is Rolly. Hey, Rollie. Hey. This is Danny at BPX Printing. How are you? Okay. How are you? Good. Okay. You sent this job over that you wanted us to quote you out for first. You want. Now it's only like two sheets. You want these in color or black and white? In color. Okay. So and then looks like the 8 and a half by 11 looks like that's like a job card that we print on like double sided on cardstock. That for sure is black and white for the job card. Yeah, yeah, that's all black and white. Yeah, but the sheets has like stamps on this stuff. And you trying to get these delivered to Orinda or shipped or. I mean when did you want to. 13 Carmen. Yeah, when, when did you. How soon do you need these to get over there? As soon as you can get them delivered. Maybe now or tomorrow morning. Well, I have to. If I ship them out, they get to Tomorrow probably by 10:30 if we drive them over. I don't, I can't drive it over today. My drivers are out tied up and I don't know what time tomorrow we will be able to get out the Orinda. So I can give you a quote for the printing and verbally tell you what we would charge to drive it over or how much it would cost to ship it overnight. If you want I can work this price and out and give you a call back and probably like 10 minutes or so. Okay. I'll just wait for the the paper because I need that. Forward it to my boss. I can't just say it in verbal. Okay. Okay. So you need me to email it to you? Yeah. Okay, so how do you want me to email you with the shipping or with the delivery? Doesn't matter. It'd be more. It'd be more to deliver it. I mean, I'm sorry to be more to ship it. So I can just give you the shipping price which would be a little bit more. And then you can give me a call and let me know you know if you want to ship. Or I can just tell you now. Okay, so delivery would be like $27 for shipping it overnight. And if I drive it out there it'll be $15 plus 7.95 for the fuel charge. So you look at 27 or 2015, 2475 or 2495. So it's pretty much not much of a difference for driving and shipping. It just a matter of getting it there at a specific time. Okay, so can you say it again? It's either 27, 2027. 27. To ship it overnight. And it should be there by like it's going over into maybe 10:30am 11:00 clock at the latest. And if we deliver it, I charge $15 to deliver to like outside of our area, which is Orinda. And then It'll be a 795 fuel charge for driving it there. So you're looking at 15 plus 795. So 22, 22.95 or 27. Got it. Okay. I think it's just a few dollars difference, but we're not really that in a hurry. Maybe we'll just go with that with. The US Driving it over. Yeah. Okay, so I'll. I'll work you up a quote with us driving it over. And like I said, it could be, you know, it could be 9:30 in the morning. Depends on how busy we are tomorrow morning. But it may. It could be. It could be sooner than, you know, 10:30, 11:00 clock. It should be sooner than that. Okay, it doesn't matter. We'll just. And also, so yeah, I know Danello has. He's with Berkeley Concrete, Berkeley Construction. So just use his account and you pay. Is that how you want to do it? Yeah, that way. Because he. I think he has like, he may have special pricing or something, I don't know. But I'll punch these numbers in and I'll email you over probably within the next 10 minutes or something. Okay, I'll wait for that. All right. Okay. Thanks a lot. All right. Thank you. You're welcome. By."
  },
  {
    "id": "CAL019be7f0514f7ac0a1425b18f86d8d6d",
    "direction": "inbound",
    "duration": 10,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+13235224668",
    "customer_name": "PRIVATE        ",
    "customer_city": "Los Angeles",
    "start_time": "2026-01-22T15:00:44.974-08:00",
    "transcript": "Next available agent. This call is being recorded."
  },
  {
    "id": "CAL019be818ea437f5cbf3abe29eeea22c8",
    "direction": "inbound",
    "duration": 291,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19257989600",
    "customer_name": "THE HOME DEPOT",
    "customer_city": "Concord",
    "start_time": "2026-01-22T15:45:05.533-08:00",
    "transcript": "Hello, this is Lily. Oh, yes, hi. I'm calling you from the Conquer Home Depot. I have Rudy here with a phone cell of $72 and 5 cents for job name. 7 Scander Court, Pleasant Hill. All right, hold on. Let me get that confirmation. From our boss. Hold on. It's. It. Okay, so it got approved. Hold on. And how much is it again? It's 72. $72. And five cents. And five cents. Four five, scander. Right. Good. Yeah. Seven scander court. Oh, seven. Yes. And the materials that he bought are. I have wire. Wire. It's like a pipe thing, Like a plumbing item. It's. What is it called? What is that thing called? Navy. Okay, maybe see. An abc. Sorry? Yeah, it's like a abc. Like pipe holder. Got it. Okay. And what was the name of the. The guy again? Rudy. Oh, Rudy. Got it. Okay, ready for the payment. Okay. All right, should be 376-75744-1853. And then three zeros. Okay, give me one second. Security code, it's 9650. Expiration date 0830. And then the zip code, it's 94563. Okay, we have an account. Really? Yes. Can we do this again? It's 3767. Okay, give me one seven three. You said six seven. Yes. Okay, go ahead. 574-4-1853,000,000. Okay, my region is 0830. Okay, the security code is what? Zero. Security code is 9653. 65 3. Okay, and then you said the expiration was 08300. And then zip code 945-63563. Okay. It should be receiving an email with your receipt on it. And then he'll forget a copy. Okay. All right, thank you so much. Have a great one. Thank you. Bye. Bye."
  },
  {
    "id": "CAL019be847614579229d48aad4377f23ad",
    "direction": "inbound",
    "duration": 81,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15105598299",
    "customer_name": "BPX PRINTING   ",
    "customer_city": "East Bay - Berkeley",
    "start_time": "2026-01-22T16:35:50.695-08:00",
    "transcript": "Hello? Hi. Roll Danny at btx. Hey, did you get that email I sent you? Yes, I did. I sent it to my boss, and he says we'll have it for another time. Okay. So just don't worry about it now. Yeah. Okay. And. Also. On your letterhead here on the thing you sent over, looks like you're at 3650 of 383685 Mount Diablo Boulevard. That your correct address? Our office address? Yeah. Hold on, let me. Because here in the system, I got you under 8 Westwood Court, Orinda. Oh, that's our boss's house. Oh. Okay. Okay. Not. It's. It's fine. I just saw here where it was under one Lafayette, and then I saw. Here in the system or something else. Okay. Yeah, don't worry about it. Okay. So I just. Just disregard this, and we will all. You know, you just let us know if you need us to do anything later. Okay? It's all good. Thank you. All. Right. Bye. Bye."
  },
  {
    "id": "CAL019bebb2e7987f51b51c8b1b2bff552a",
    "direction": "inbound",
    "duration": 32,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252179552",
    "customer_name": "DANVILLE CA    ",
    "customer_city": "Danville",
    "start_time": "2026-01-23T08:32:09.082-08:00",
    "transcript": "Please hold to the next available agent. This call is being recorded. Press 1 to speak with an agent immediately and verify your Google listing. Again, your business is not showing correctly on Google and Google Voice Search. Press 1 to speak to an agent, press 2 or dial 877-865-5852 to."
  },
  {
    "id": "CAL019bebd264fb7375b293a5a2790ecb57",
    "direction": "inbound",
    "duration": 22,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252056718",
    "customer_name": "DANVILLE CA    ",
    "customer_city": "Danville",
    "start_time": "2026-01-23T09:06:32.794-08:00",
    "transcript": "Please hold for the next available agent. Our assistant shows numerous searches for your business. Google and Google Voice clients are currently having trouble finding you. Press 1, speak with an agent immediately and verify your Google listing. Again, your business is not showing correctly on Google and Google Voice Search. Press 1 to speak to an agent."
  },
  {
    "id": "CAL019bec7fcec579449b9ea29d1a209201",
    "direction": "inbound",
    "duration": 21,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252016802",
    "customer_name": "PLEASANTON     ",
    "customer_city": "Pleasanton",
    "start_time": "2026-01-23T12:15:57.547-08:00",
    "transcript": "Notes flagged in our systems. Hold verification. Please press 2 immediately to speak with an authorized representative from my pro directory to take care of this. Your listing may be suspended or not appearing searches. If we do not take care of this, please press 2 now. This will only take a few minutes. Press 9 or call 6190."
  },
  {
    "id": "CAL019beca50168747ba68be948b16bb701",
    "direction": "inbound",
    "duration": 276,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+14157750471",
    "customer_name": "KAVANAGH DON   ",
    "customer_city": "San Francisco",
    "start_time": "2026-01-23T12:56:35.398-08:00",
    "transcript": "Please hold for the next available agent. Hello, good afternoon. Is this Renova Builders? All right, Rhino Builders, how can I help? Yes, we have a job that we would like to see if you're interested in. It is a kitchen and bath refresh. And it's in Orinda. It's in Orinda. All right. Do you have. Have you spoken to a designer already? Do you have plans available or is it. Well, it's. It's not something that need plans. It's. It's reface the cabinets, put in a backsplash, new counter, and probably some cabinet drawer work. And then in the back and then in the bathroom, it's removing a tub and then essentially retiling. That's sort of what it is. Got it. And okay. Yeah, we can definitely give you an estimate for that. So what we normally do is that we would like to do a site visit so we can, you know, like, evaluate the existing condition and we'll take it from there. So we do have an opening next week, say Tuesday on the 27th, and it's going to be in the afternoon around. Let's just say around 1pm Will that work for you? That might be hard because I have to work in San Francisco. Oh, okay. So what's a good time for you? Either really early or really late. So, okay, what's really late for you? You know, 5. 5pm 4:30, something like that? 5pm yeah. Okay. Can we do like, 4:30 instead? Sure. Okay. We can do 4:30 on Tuesday, the 27th. Okay, yeah, that sounds good. Just so you know, we've sort of settled on a color palette and other things we just need to execute now. And it's. It's something that I think needs a contractor's attention and we don't want to do it ourselves. Well, that's even better because all you have to do is just to put them all together. And you've already decided that that's the harder part, actually, like choosing the finished materials. Yeah, we spent like six weeks doing that. I know. Okay, so can I please get your first and last name? Dawn Kavanaugh. K A Z A N, A G. H. Oh, N A, G, H. Okay. All right, thank you. And what's the best number to reach you, Don? 415-775-0471. All right. And what's the property address? 221 Village Gate Road. Orinda. Yes. Sorry. Okay. All right. What's your email address? It's Don Dot Kavanaugh, and I'll spell it again. K A, V A. Like Victor K A V A N A g h@gmail.com. Perfect. All right. Perfect. So I'll set you up for Tuesday. That's going to be the 27th at 4:30pm okay. Yeah, that sounds good. I'll call you. I can't look at my calendar at the moment, but I'll call you back if there's any conflict. Yes, yes, please do. And they'll send you a text confirmation for this appointment. Do you happen to do those on the weekends or just weekdays? Normally? Just weekdays. Okay. Yeah, I'll work with that. Okay. Alrighty, then. Thanks so much. Appreciate it. Have a good one. Bye. Bye. You, too. Bye. All right. Bye."
  },
  {
    "id": "CAL019becb4ff92751fab3d0425a06454c2",
    "direction": "inbound",
    "duration": 177,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+14157750471",
    "customer_name": "KAVANAGH DON   ",
    "customer_city": "San Francisco",
    "start_time": "2026-01-23T13:14:03.501-08:00",
    "transcript": "Builders. Please hold for the next available agent. This call is being recorded. Sa. It. Sam."
  },
  {
    "id": "CAL019becd62b7c787c920dd79c54499d4d",
    "direction": "inbound",
    "duration": 216,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15109257158",
    "customer_name": "GONZALEZ MARIO ",
    "customer_city": "Hayward",
    "start_time": "2026-01-23T13:50:17.438-08:00",
    "transcript": "Please hold for the next available agent. This call is being recorded. It. Hello? Hi, my name is Linda. I was calling around to see. Do you guys do, like, a storm drain on a property? Like, kind of snake it. Hold on. Sorry, I wasn't able to hear you. Can you say that again? No. No worries. So I have a. We're with a real estate company. She's also the owner of this property. And on the side of the yard, we don't know where it goes to, but apparently it goes out to the street, we believe. But it's like, almost like on a dog run. And there's just a drain that kind of needs to be cleaned. Like, snaked out, I think it's called. I think it's a. Whatever they call it, like a storm drain because it's not connected to anything in the property. Do you guys do that? I think that the scope is too small for us to take the job. Okay. Okay. Yeah, okay. No worries. I'm just calling around, trying to find something. Well, thank you. Thank you. All right, bye."
  },
  {
    "id": "CAL019becf277f477f687c7abaf3cf23219",
    "direction": "inbound",
    "duration": 38,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+12109669991",
    "customer_name": "SAN ANTONIO TX ",
    "customer_city": "San Antonio",
    "start_time": "2026-01-23T14:21:12.019-08:00",
    "transcript": "Hold for the next available agent. This call is being recorded."
  },
  {
    "id": "CAL019bed01a1cf794a89ba51608da5e54f",
    "direction": "inbound",
    "duration": 417,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15104723111",
    "customer_name": "BOUHEDDA Y     ",
    "customer_city": "East Bay - Mn Piedmont",
    "start_time": "2026-01-23T14:37:45.766-08:00",
    "transcript": "Builders, please hold for the next available agent. This call is being recorded. Hello, this is RO. Yes, hi, I was calling worrying if you guys give free estimates for projects. Sorry, I wasn't able to get your call. Hello? Yes, hi, I was wondering if you guys give free estimates for projects. Yes, we do. Free estimates. We also just to check over what needs to be done. Okay. Yeah, we'd like to have our garage converted into a living space. And we'd also like to build an adu. And we also have some stuff we'd like to remodel in the house as well. Remodeling. All right, Nice. Okay, can I take the address so that we can have someone over to check the site? Yeah, it's 2388 Market Avenue. Market Avenue in San Pablo. Marquette Avenue in San Pa. Got it. And what is your name? Yousef. Can you spell that out for me? Yeah. Y, O, U, C, E, F, C. E. And your last name? B O U, H. B O U, H. All right. And is this a good number to call you back? Yes, this is your number. Got it. And then your email address for us. To send over the estimate email is MVA M V A O N O N 922. 922mail.comgmail com. Got it. All right. And what is the best date and time for us to come over to meet with you? Ideal. Probably best time is maybe Tuesday. Anytime after, like one after one. Let me check our schedule first. Let me see. Let me take a look. Two. Yeah, we're three after one. So let's. So it's 1:00pm Straight 1:00pm Good to go. So two. You said Tuesday for 1:00pm yeah, yeah. Someone's gonna be over there to. Over the site and you will be there to assist them. Right? Huh? And what's it called? If you can repeat the email one more time just to make sure you have the. I got the right one or you have the right one. Good thing. It's M as in May, V as in Valley, A as in Apple, O as in Orange, N as in. What? N as in Nancy. Yeah, Nancy. Yeah. And 922mail.com. Yeah, that's good. And also we do have. We do have plans as well for the project. So we can. You need us send them to you? Yeah, we could do that. Okay. My email is office. So that's o f f I C. Or is it. Is it. Is it possible if you can email the. My email and then all after that I can send you the plans? All right, I can do that. Right now so that. Let me see if you can. That way I don't have to write it down. I'll just write in test just to make it clear. Okay. Test email. Rhino Builders test email. Let me send that to you right now. Okay. Let me know if you got it. That's. Seems that the email. The email address is not. Address is not sound. You have it. I think you said it correctly to me. M v a o n 922 gma. M v a o n 922 b. A. Right. B as in boy. Oh, b as in boy valley. Sorry. Okay, let me send that over again. Good thing we checked that. Okay. I know. Brothers test email. Okay, how about this one? Let's see. Yeah, I got that one. Okay. Okay. Yeah, I'll send you that. And then, then you said Tuesday? Tuesday, 1 o', clock, right? Yeah, exactly 1 o'. Clock. Okay, sounds good. So I'll go ahead and send you that right now. So friends. All right. Thank you. Thank you. Goodbye. Night."
  },
  {
    "id": "CAL019bed52105a790ab6129899f054c074",
    "direction": "inbound",
    "duration": 81,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15309306567",
    "customer_name": "WIRELESS CALLER",
    "customer_city": "Marysville",
    "start_time": "2026-01-23T16:05:36.960-08:00",
    "transcript": "Builders. Please hold for the next available agent. This call is being recorded. Hello, this is Robbie. Hi, good afternoon. I'm Cesar. I have a question. Looking for job. I'm subcontractor. I have a cruise with me and I do siding. I. Don'T know if you guys do siding or something in exterior models. Interior model. Okay, I'll maybe in a few months, but not right now. But. I'll just take your name. Your name is Caesar. And you do sightings more on carpentry, right? Yep. Yeah. And what is your area? And I work all the Bay area. Got it. Okay, I'll take a note on that. All right. Thank you. All right. Thank you."
  },
  {
    "id": "CAL019bfb16a2a875b08b8cb74e822be316",
    "direction": "inbound",
    "duration": 114,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+14156097597",
    "customer_name": "FORBES JAMES   ",
    "customer_city": "San Francisco",
    "start_time": "2026-01-26T08:15:23.262-08:00",
    "transcript": "Builders. Please hold for the next available agent. This call is being recorded. Hello. Hi, My name is Rachel Forbes. I was supposed to have a sighting consultation today, but I both texted an email to try and cancel it, and I just wanted to make sure you guys received the cancellation. Hold on, let me. You sent us an email? Well, because I got the, like, confirmation email saying, like, confirm the appointment. And then I wrote back saying that I wanted to cancel it. And then I also did it through text. Hello? Hello? Hello. Sorry, it's the connection. Let me check on my. On our schedule. Today. Hold on. Okay. I think it's for 11:30. 11:30. Oh, okay. I thought it was the 8:00am one. No, no, no. My pauses are already there. And I thought. Oh, my gosh. Okay, hold on. Is that okay to cancel the 11:30, please? Let me see. 11:30. Yeah. Okay. Yes. Okay. You still have the. Time to. Cancel. It? Yeah. And great. And when do you want to move it? I'm just canceling it. I don't need to reschedule. Yeah, I see. All right. Okay. All right. Thank you. Thank. You. All right, bye. Bye."
  },
  {
    "id": "CAL019bfb4d5a8f717a853d4225bbd3fcf4",
    "direction": "inbound",
    "duration": 22,
    "answered": false,
    "voicemail": true,
    "customer_phone": "+18882192787",
    "customer_name": "CallRail",
    "customer_city": null,
    "start_time": "2026-01-26T09:15:09.325-08:00",
    "transcript": "This message is from CallRail. We will be discontinuing the Lead center softPhone product on January 27th in favor of better and more reliable options so you can continue to effectively communicate with your customers. Please reach out to your CallRail administrator or contact our support team@migrationallrail.com if you have any questions or need assistance with the transition."
  },
  {
    "id": "CAL019bfb578d8e735dad69ef2170eca73b",
    "direction": "inbound",
    "duration": 8,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+13509305920",
    "customer_name": "TURLOCK CA     ",
    "customer_city": "Turlock",
    "start_time": "2026-01-26T09:26:17.703-08:00",
    "transcript": "Rhino Builders. Please hold for the next available agent."
  },
  {
    "id": "CAL019bfb930f1f7e0cb0aca35d897726c2",
    "direction": "inbound",
    "duration": 8,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+13509305920",
    "customer_name": "TURLOCK CA     ",
    "customer_city": "Turlock",
    "start_time": "2026-01-26T10:31:17.504-08:00",
    "transcript": "Hold for the next available agent."
  },
  {
    "id": "CAL019bfc58ab87795186705303d7046846",
    "direction": "inbound",
    "duration": 198,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15104578897",
    "customer_name": "LOPEZ JUAN     ",
    "customer_city": "East Bay - Mn Piedmont",
    "start_time": "2026-01-26T14:07:08.134-08:00",
    "transcript": "Please hold for the next available agent. This call is being recorded. Hello, this is Roly. Yes, hi. I need to cancel an appointment that I have tomorrow with one of your estimators. Oh, sure thing. What time was it again? It's at 10 in the morning. 10 in the morning. Hold on, let me check. It should be under Juan. Yes, I see it. Juan Lopez Garage Conversion and adu. Yes, correct. Do you want me to reschedule or just have it canceled? I do. I do need the estimate. The thing is, I'm having the property appraised, and the appraiser. This is when he decided to. To book it. So I will be in the area. You know, it's just that I don't know how big the window is for the person coming out, but the appraisal is supposed to happen between 10 because it's appraising my. My primary residence and then also that duplex. So I just don't know, you know, if I'll be in the area on time. Yeah, So I think I'll call back. Oh, okay. But I'll let you know that tomorrow by 12 to. By 12 and 2 to 3, we're open by that time, just in case that you need. Oh, you have an opening at 12? Yeah. Yes, we do. Okay. That might work better. You want me to reschedule right now? Just to confirm that it's on 12? The thing is, I don't know how. You know, this is my first time working with this appraiser, and I don't know how punctual he'll be. So if. If. No worries are very. Yeah, because he's saying he'll be here at 10. Yeah, he'll be here at 10 in the morning at. On in San Leandro to appraise my primary residence. And he's saying that takes about maximum an hour. So. Which means that I would be. We would be heading over to the Hayward property around 11. Right. And then I could just stay there until. Until noon. That would not be a problem. I. You know, But. But if this guy decides to not show up at 10 and show up later, then. Like it. Yeah, exactly. Yeah. So I don't want to, you know, I don't want to waste your time. So I think what I'll do is I'll just call back and reschedule when I have a better idea because I need to check my schedule for next week also. All right. Okay, no worries. Yes, I apologize. Give us a call. Thank you. No, it's okay. Thank you. Thank you. Bye. Bye. All right, bye."
  },
  {
    "id": "CAL019c00d6da7570809bf82aec00fe247e",
    "direction": "inbound",
    "duration": 14,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+17542839333",
    "customer_name": "FTLAUDERDL   FL",
    "customer_city": "Fort Lauderdale",
    "start_time": "2026-01-27T11:03:26.463-08:00",
    "transcript": "Builders. Please hold for the next available agent."
  },
  {
    "id": "CAL019c00e79b127fa1bffb132f68297bf7",
    "direction": "inbound",
    "duration": 16,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252056943",
    "customer_name": "DANVILLE CA    ",
    "customer_city": "Danville",
    "start_time": "2026-01-27T11:21:44.425-08:00",
    "transcript": "Keywords attached to your Google Please hold to the next available agent. Your Google business listing has been flagged for review by the Business Listing Specialist. To avoid any suspension or verification issues, please press 4 to speak to an author."
  },
  {
    "id": "CAL019c00ff922e7b9eb78c21d38cb3db4f",
    "direction": "inbound",
    "duration": 14,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252042604",
    "customer_name": "WIRELESS CALLER",
    "customer_city": "Antioch",
    "start_time": "2026-01-27T11:47:55.025-08:00",
    "transcript": "Words attached to the next listing. Your Google business listing has been flagged for review by the Business Listing Specialist. To avoid any suspension or verification issues, please."
  },
  {
    "id": "CAL019c016ff5847322a359c0eb2082995f",
    "direction": "inbound",
    "duration": 51,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+18638001847",
    "customer_name": "BARTOW FL      ",
    "customer_city": "Bartow",
    "start_time": "2026-01-27T13:50:40.482-08:00",
    "transcript": "Please hold for the next available agent. This call is being recorded. Hello, this is Roly from Rhino Builders. Hello? Hello?"
  },
  {
    "id": "CAL019c01b0ff977cd8b696d04c32a9891e",
    "direction": "inbound",
    "duration": 250,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19257989600",
    "customer_name": "THE HOME DEPOT",
    "customer_city": "Concord",
    "start_time": "2026-01-27T15:01:42.862-08:00",
    "transcript": "Hello? Hi, good afternoon, this is Ruth with the Concord Home Depot. I have here Rudy doing a phone sale of $603.98 and he has two different transactions. So this is the first transaction. I'm ready for your credit card. Okay. Can I ask a favor? Could you please put on the, on the. What do you call this job address plus his name right next to it. Okay. Okay. Cuz he has it on, on this, on, on the job name. 3266 Claudia Drive. Do you want me to put Rudy too? Yes, please. Appreciate it. Okay, it only goes out 25. Now you go back. Okay, I'm ready for your credit card. All right. We have a card on file. Okay, we actually have the last four is 10:20. Okay, one second. What card do you have? Do you have a Home Depot card? It's American Express. We have a full rewards card number. Okay, can I Get the last 4? 1 020. Eight. I'm sorry. Yeah. 0830. Okay. Let me try to. Let me do that phone number. On going to look at your purchase history. Go ahead. Okay, on this other. One second. Okay, on this other purchase. Okay, let's, let's see if anything. What's that again? One second. I have another purchase. Okay. And this one. One second please. I'm so sorry. Does it show up? Yeah, there's a $3,600 purchase here and then there's one for 1103, then a couple for 600. 800. These are back in 24. There is one you purchased in coma for 9,000. Now when I'm wondering. Okay, on this second transaction the total is $679. And do you want me to put Rudy 2 on the, on the name, on the. Close to the, to the address or no? Yes, yes. Okay. Okay, one more time. The last four numbers. 1020 month and year. 08 30. Yeah, after that. Thank you so much. Have a good day. Thank you. Okay. All right, bye bye."
  },
  {
    "id": "CAL019c057045a87de2bff8bc3039cd8491",
    "direction": "inbound",
    "duration": 25,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252056534",
    "customer_name": "DANVILLE CA    ",
    "customer_city": "Danville",
    "start_time": "2026-01-28T08:29:29.866-08:00",
    "transcript": "Builders. Please hold for the next available agent Google Business Account this call is being recorded numerous searches for your business via Google and Google Voice Clients are currently having trouble finding you. Press 1 to zoom Agent immediately and verify your Google listing. Again, your business is not showing correctly on Google and Google Voice Search. Press 1 to speak to an agent, press 2 or dial 87 7."
  },
  {
    "id": "CAL019c058db98776b1b31d3587558f75ce",
    "direction": "inbound",
    "duration": 25,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252056402",
    "customer_name": "DANVILLE CA    ",
    "customer_city": "Danville",
    "start_time": "2026-01-28T09:01:40.075-08:00",
    "transcript": "The keywords. Please hold for the next message. Listing. Your Google business listing has been flagged for review by the Business Listing Specialist. To avoid any suspension or verification issues. Please press 4 to speak to an authorized representative to take care of this. To address this immediately, press 4. This will only take a few minutes to opt out."
  },
  {
    "id": "CAL019c05df81007f02994ddbe2a70e53b6",
    "direction": "inbound",
    "duration": 30,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252020039",
    "customer_name": "PLEASANTON CA  ",
    "customer_city": "Pleasanton",
    "start_time": "2026-01-28T10:30:59.557-08:00",
    "transcript": "Please hold for the next available agent your Google Business account. Our system shows numerous searches for your business and Google and Google Voice clients are currently having trouble finding you. Press 1 to speak with Engagement immediately and verify your Google listing. Again, your business is not showing correctly on Google and Google Voice Search. Press 1 to speak to an agent. Press or dial 877-865-5852 to opt out."
  },
  {
    "id": "CAL019c05dfc51771c59647e813ffe497bf",
    "direction": "inbound",
    "duration": 19,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+1266696687",
    "customer_name": null,
    "customer_city": null,
    "start_time": "2026-01-28T10:31:11.773-08:00",
    "transcript": "Please hold for the next available agent."
  },
  {
    "id": "CAL019c05ff94f37ce48c7563979d29e486",
    "direction": "inbound",
    "duration": 8,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19546861804",
    "customer_name": "FTLAUDERDL   FL",
    "customer_city": "Fort Lauderdale",
    "start_time": "2026-01-28T11:06:01.743-08:00",
    "transcript": "Please hold for the next available agent."
  },
  {
    "id": "CAL019c061670e7706ea3ea7a7378292753",
    "direction": "inbound",
    "duration": 22,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252063906",
    "customer_name": "ANTIOCH CA     ",
    "customer_city": "Antioch",
    "start_time": "2026-01-28T11:30:59.907-08:00",
    "transcript": "Please hold to the next available agent. Our Simpsons have chose numerous searches for your business via Google and Google Voice. Clients are currently having trouble finding you. Press 1 to speak with an agent immediately and verify your Google listing. Again, your business is not showing correctly on Google and Google Voice Search. Press 1 to speak to an agent."
  },
  {
    "id": "CAL019c06354b0f7b5a95218d498d9329ab",
    "direction": "inbound",
    "duration": 15,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252031177",
    "customer_name": "PITTSBURG CA   ",
    "customer_city": "Pittsburg",
    "start_time": "2026-01-28T12:04:41.835-08:00",
    "transcript": "Please hold to the next available agent. Our system shows numerous searches for your business via Google and Google Voice. Clients are currently having trouble finding you to speak with an agent immediately."
  },
  {
    "id": "CAL019c064ebf7f705482e7cb1bda483df4",
    "direction": "inbound",
    "duration": 22,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252056534",
    "customer_name": "DANVILLE CA    ",
    "customer_city": "Danville",
    "start_time": "2026-01-28T12:32:30.043-08:00",
    "transcript": "Please hold for the next available Agent account. Our system serves numerous searches for your business via Google and Google Voice. Clients are currently having trouble finding you. Press 1 to speak with an agent immediately and verify your Google listing. Again, your business is not showing correctly on Google and Google Voice Search. Press 1 to speak to an agent."
  },
  {
    "id": "CAL019c067623d97536b4bd40b16eed0965",
    "direction": "inbound",
    "duration": 18,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19254299395",
    "customer_name": "CONCORD CA     ",
    "customer_city": "Concord",
    "start_time": "2026-01-28T13:15:31.632-08:00",
    "transcript": "Elders, please hold for the next available agent. This call is being recorded."
  },
  {
    "id": "CAL019c0693583e7110a589fbe6a9fc552e",
    "direction": "inbound",
    "duration": 42,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+17042154535",
    "customer_name": "GASTONIA NC    ",
    "customer_city": "Gastonia",
    "start_time": "2026-01-28T13:47:25.590-08:00",
    "transcript": "Rhino Builders. Please hold for the next available agent. This call is being recorded. Hello, this is Roly. Hey there. It's Jack over at Lead Vision. I was seeing if Clayton is available. Oh, no, he's not working right now. Oh, okay. Would you know when he's back around? I'm not really sure. Maybe by next week. He's taking a vacation. Oh, gotcha. Okay, I'll give him a shout when he's back around. I appreciate it. All right. Thank you. Bye. Thank you."
  },
  {
    "id": "CAL019c069ec90d773eaf03b3f7562ac8de",
    "direction": "inbound",
    "duration": 19,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252022171",
    "customer_name": "PLEASANTON CA  ",
    "customer_city": "Pleasanton",
    "start_time": "2026-01-28T13:59:55.374-08:00",
    "transcript": "This is an important Please hold for the next available agent account. This call is being recorded for your business via Google and Google Voice. Clients are currently having trouble finding you. Press 1 to speak with an agent immediately and verify your Google listing. Again, your business is not showing correctly on Google and Google."
  },
  {
    "id": "CAL019c06afb6a37141847187e5c772f6b9",
    "direction": "inbound",
    "duration": 12,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+18638001847",
    "customer_name": "BARTOW FL      ",
    "customer_city": "Bartow",
    "start_time": "2026-01-28T14:18:24.758-08:00",
    "transcript": "For the next available agent. This call is being recorded."
  },
  {
    "id": "CAL019c06b414e377a08c1e0e1d5c1ad2e1",
    "direction": "inbound",
    "duration": 69,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+16692461838",
    "customer_name": "MAR GOMEZGUZMAN",
    "customer_city": "Sunnyvale",
    "start_time": "2026-01-28T14:23:11.043-08:00",
    "transcript": "Builders. Please hold for the next available agent. This call is being recorded. Hello, this is Roly. Hi. This is Carlos. I was just. So I gave you guys a call. Last year, but I just wanted to recall this year, see if there's any opportunities, any projects that you guys would want us to provide a quote. I'll provide a quote for. What services do you provide? We do insulation. That's all we do. Got it. Okay, I'll have you on the list, and then we'll let you know once we have some projects for you. Okay, sounds good. I just wanted to give a call back, you know, reach out this year. All right. Hopefully we. Can get something figured out. So far, we have none for insulation, but I'll let you know. Okay. All right. Thank you. All right, bye. All right."
  },
  {
    "id": "CAL019c06b90fa37d398738956692d5ae67",
    "direction": "inbound",
    "duration": 38,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19726403711",
    "customer_name": "GRAND PRAIRI TX",
    "customer_city": "Grand Prairie",
    "start_time": "2026-01-28T14:28:37.370-08:00",
    "transcript": "Next available agent. This call is being recorded. Hello, this is Roli from Rhino Builders. Hello? Hello?"
  },
  {
    "id": "CAL019c06bb5e1077b08c0abcf4dbfb9874",
    "direction": "inbound",
    "duration": 10,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19253861495",
    "customer_name": "ORINDA CA      ",
    "customer_city": "Orinda",
    "start_time": "2026-01-28T14:31:08.501-08:00",
    "transcript": "The next available agent. This call is being recorded."
  },
  {
    "id": "CAL019c06c1ccf674c89037eebee4bf00b5",
    "direction": "inbound",
    "duration": 17,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19048719124",
    "customer_name": "PONTE VEDRA FL ",
    "customer_city": "Ponte Vedra Beach",
    "start_time": "2026-01-28T14:38:10.125-08:00",
    "transcript": "Builders. Please hold for the next available agent. This call is being recorded."
  },
  {
    "id": "CAL019c0732b7e27bfa9c3c50c22ec5228e",
    "direction": "inbound",
    "duration": 30,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19255804777",
    "customer_name": "PATEL PANKIT   ",
    "customer_city": "Pleasanton",
    "start_time": "2026-01-28T16:41:30.307-08:00",
    "transcript": "Builders. Please hold for the next available agent. This call is being recorded."
  },
  {
    "id": "CAL019c0ab361ef70efa6779419eed053c4",
    "direction": "inbound",
    "duration": 44,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15593832617",
    "customer_name": "AVENAL CA      ",
    "customer_city": "Avenal",
    "start_time": "2026-01-29T09:00:54.087-08:00",
    "transcript": "Rhino Builders. Please hold for the next available agent. Oh, good morning. Hey, there, this is Mitch. Hello, can you hear me? Hello? Hello? Oh, hey there, this is Mitch. And I want you to know that this is actually a cold call. However, I'm not here to really sell you anything. Do you have a few seconds so I can explain to you this call? Unfortunately, I do not. Thank you, though. Oh, got it."
  },
  {
    "id": "CAL019c0ad807437b998562e64a40473b6a",
    "direction": "inbound",
    "duration": 27,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15593832617",
    "customer_name": "AVENAL CA      ",
    "customer_city": "Avenal",
    "start_time": "2026-01-29T09:40:55.716-08:00",
    "transcript": "Builders. Please hold for the next available agent. Good morning. Hello. Hey, there. This is Mitch. Yes, this is Mitch. And I want you to know that this is actually a cold call. However, I'm not here to sell. We're good. We're good. Thank you."
  },
  {
    "id": "CAL019c0ae995637b74a1734969a2152eed",
    "direction": "inbound",
    "duration": 44,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15593832617",
    "customer_name": "AVENAL CA      ",
    "customer_city": "Avenal",
    "start_time": "2026-01-29T10:00:06.209-08:00",
    "transcript": "The next available agent. Thank you for calling Rhino Builders. We are unable to take your call at the moment. Please leave your name, phone number and a brief message and we."
  },
  {
    "id": "CAL019c0af49c5f77ae9be7fefc685bfcd7",
    "direction": "inbound",
    "duration": 21,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252056783",
    "customer_name": "DANVILLE CA    ",
    "customer_city": "Danville",
    "start_time": "2026-01-29T10:12:08.890-08:00",
    "transcript": "Please hold for the next available Agent Business account. Our assistant shows numerous searches for your business Google and Google Voice clients are currently having trouble finding you. Press 1, speak with an agent immediately and verify your Google listing. Again, your business is not showing correctly on Google and Google Voice Search. Press 1 to speak to."
  },
  {
    "id": "CAL019c0b09e6d1752685ac7b5204f9d608",
    "direction": "inbound",
    "duration": 16,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252082374",
    "customer_name": "PRODUCT SUPPORT",
    "customer_city": "Danville",
    "start_time": "2026-01-29T10:35:24.197-08:00",
    "transcript": "Please hold for the next available agent. Your Google Business account. Our system shows numerous searches for your business because Google and Google Voice clients are currently having trouble finding you. Press Voice to speak with an agent immediately and verify."
  },
  {
    "id": "CAL019c0b166fbf768f8daae04a553e0fd6",
    "direction": "inbound",
    "duration": 24,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252082483",
    "customer_name": "BANK OF AMERICA",
    "customer_city": "Danville",
    "start_time": "2026-01-29T10:49:05.685-08:00",
    "transcript": "In our system for issues available agen please press 2 immediately to speak with an authorized representative from my pro directory to take care of this. Your listing may be suspended or not appearing searches. If we do not take care of this, please press 2 now. This will only take a few minutes. Press 9 or call 619-935-1051 to."
  },
  {
    "id": "CAL019c0b2a1167758fa6f0c9f83da9354f",
    "direction": "inbound",
    "duration": 23,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252056846",
    "customer_name": "DANVILLE CA    ",
    "customer_city": "Danville",
    "start_time": "2026-01-29T11:10:32.254-08:00",
    "transcript": "Builders. Please hold for the next available agent. Our system shows endless searches for your business via Google and Google voice lines are currently having trouble finding you. Press 1 to speak with an agent immediately and verify your Google listing. Again, your business is not showing correctly on Google and Google Voice Search. Press 1 to speak to an agent."
  },
  {
    "id": "CAL019c0b477dae7ca88d0d6e2e4d10db42",
    "direction": "inbound",
    "duration": 29,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15593832617",
    "customer_name": "AVENAL CA      ",
    "customer_city": "Avenal",
    "start_time": "2026-01-29T11:42:40.518-08:00",
    "transcript": "The next available agent. Hello? Good morning. Hey, this is Mitch. And just a heads up. Hello? Can you hear me? You've already called us a lot of times. You're not interested. Thank you."
  },
  {
    "id": "CAL019c0b47fee77f32ab684dad390a244e",
    "direction": "inbound",
    "duration": 32,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252056846",
    "customer_name": "DANVILLE CA    ",
    "customer_city": "Danville",
    "start_time": "2026-01-29T11:43:13.604-08:00",
    "transcript": "Our system shows numerous searches for your business via Google and Google Voice. Clients are currently having trouble finding you. Thank you for calling Rhino Builders. We are unable to take your call at the moment. Please leave your name. Phone number and a brief message and we will return your call as soon as possible. Thank you."
  },
  {
    "id": "CAL019c0b501191731588503125bac0aa29",
    "direction": "inbound",
    "duration": 116,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+16083205546",
    "customer_name": "BELLINGHAM J.  ",
    "customer_city": "Madison",
    "start_time": "2026-01-29T11:52:02.666-08:00",
    "transcript": "Elders. Please hold for the next available. Agent. Good morning. Hi. Hey. This is Janet Bellingham. I live in. Orinda. And I'm looking for a contractor for a smaller job. I have a kitchen hood that I need put in my kitchen, a very large kitchen hood, but my ceiling is sloped, and I need a little bit of a build out in order for the kitchen hood to be put in a flat surface. Oh. So basically you just need to adjust the ceiling where the hood is going to be located so it'll fit. Yeah. Oh. Yeah. So, okay. Well, I think this kind of job is for, you know, a handyman, because we. Our jobs are actually like, major remodeling. Like, you know, like, if you want to do additions, adus. This is something that unfortunately, we do not service this type of job. Okay. You think a handyman is going to be able to. Okay, it gets. It sort of structurally needs to be. Structurally. Yeah. Have you tried There's. Yeah, not really, like, handyman, somebody who's also licensed, but you can try thumbtack. They have. You can choose, like, different contractors from there that can do this. Okay, thank. You. All right. Thank you. Bye. Bye."
  },
  {
    "id": "CAL019c0b5978e7758b9cdb63317d578d3a",
    "direction": "inbound",
    "duration": 14,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252039407",
    "customer_name": "PITTSBURG CA   ",
    "customer_city": "Pittsburg",
    "start_time": "2026-01-29T12:02:18.943-08:00",
    "transcript": "Please hold for the next available agent logging your Google Business account. Our system shows numerous searches for your business, and Google and Google Voice clients are currently having trouble finding you. Press one to speak with."
  },
  {
    "id": "CAL019c0b664b63710e935941bd3639649f",
    "direction": "inbound",
    "duration": 26,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+18182630408",
    "customer_name": "BITTAN SHAHAR  ",
    "customer_city": "Van Nuys",
    "start_time": "2026-01-29T12:16:19.267-08:00",
    "transcript": "Please hold for the next available agent. Afternoon. Hello? Hello."
  },
  {
    "id": "CAL019c0b9dd6f977f087a69d4e19bffc98",
    "direction": "inbound",
    "duration": 19,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252020182",
    "customer_name": "COTHAM JUDITH  ",
    "customer_city": "Pleasanton",
    "start_time": "2026-01-29T13:16:59.476-08:00",
    "transcript": "Please hold for the next available agent. This call is being recorded. Press 1 to speak with an agent immediately and verify your Google listing. Again, your business is not showing correctly on Google."
  },
  {
    "id": "CAL019c0ba0d2ce7e1da8d1710c0cb0e9a6",
    "direction": "inbound",
    "duration": 11,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252892631",
    "customer_name": "WALNUT CREEK CA",
    "customer_city": "Walnut Creek",
    "start_time": "2026-01-29T13:20:15.010-08:00",
    "transcript": "Next available agent. This call is being recorded."
  },
  {
    "id": "CAL019c0bb16aaa74fd9559e0b1299b772a",
    "direction": "inbound",
    "duration": 15,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+12138393416",
    "customer_name": "LOS ANGELES CA ",
    "customer_city": "Los Angeles",
    "start_time": "2026-01-29T13:38:22.475-08:00",
    "transcript": "Calling Rhino Builders. Please hold for the next available agent. This call is being recorded."
  },
  {
    "id": "CAL019c0bfbb31f7abcbd31e4893e0d8482",
    "direction": "inbound",
    "duration": 59,
    "answered": true,
    "voicemail": true,
    "customer_phone": "+19257989600",
    "customer_name": "THE HOME DEPOT",
    "customer_city": "Concord",
    "start_time": "2026-01-29T14:59:30.639-08:00",
    "transcript": "Please leave a message with your phone number and we'll get back to you as soon as I can. Thank you. Hi, this is John at the Concord Home Depot. I have Rudy here making a phone purchase for Claudia Drive. My number is 925-798-9600, extension 3, 2, 1. Thank you, bye."
  },
  {
    "id": "CAL019c0bfdba15790c85e05d60318a4abc",
    "direction": "inbound",
    "duration": 58,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19257989600",
    "customer_name": "THE HOME DEPOT",
    "customer_city": "Concord",
    "start_time": "2026-01-29T15:01:43.542-08:00",
    "transcript": "Hello, this is John at the Concord Home Depot. I have Rudy here making a phone purchase for Claudia Drive. I do have a text to confirm them. No, I'm not sure why it's not going through. You want me to try it and see? Yeah, please. Okay, stand by. I'll send it. Let me know if you receive it. Okay? Okay. You should have it momentarily. Let me know if it comes through. Yep. Perfect. So. Okay. Thank you. Okay. Thank you. Have a great day. Bye. You, too. Yes."
  },
  {
    "id": "CAL019c0f7e9b5f7ef998fdf94afa336844",
    "direction": "inbound",
    "duration": 16,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252421890",
    "customer_name": "BISHOP RANCH CA",
    "customer_city": "Bishop Ranch",
    "start_time": "2026-01-30T07:21:21.474-08:00",
    "transcript": "Builders. We are unable to take your call at the moment. Please leave your name, phone number and a brief message and we will return your call as soon as possible. Thank you."
  },
  {
    "id": "CAL019c0fc4cbe070d7bda7bd20faa74708",
    "direction": "inbound",
    "duration": 16,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252034537",
    "customer_name": "PITTSBURG CA   ",
    "customer_city": "Pittsburg",
    "start_time": "2026-01-30T08:38:01.400-08:00",
    "transcript": "Next available agent Google Business Account this call is being recorded. Numerous searches for your business via Google and Google Voice Clients are currently having trouble finding you. Press 1 to speak with an agent immediately and verify your Google listing."
  },
  {
    "id": "CAL019c0fccac147e979e90a035c6d2f1b3",
    "direction": "inbound",
    "duration": 20,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252046965",
    "customer_name": "ANTIOCH CA     ",
    "customer_city": "Antioch",
    "start_time": "2026-01-30T08:46:37.546-08:00",
    "transcript": "Please hold for the next available agent Google Business Account. This call is being recorded Numerous searches for your business via Google and Google Voice. Clients are currently having trouble finding you. Press 1 to speak with an agent immediately and verify your Google listing. Again, your business is not showing correctly on Google and Google Voice search."
  },
  {
    "id": "CAL019c0fda122e7096a32f5ebbbec7bcfd",
    "direction": "inbound",
    "duration": 34,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+17133331721",
    "customer_name": "HOUSTON TX     ",
    "customer_city": "Houston",
    "start_time": "2026-01-30T09:01:15.656-08:00",
    "transcript": "For the next available agent. Morning. Hello."
  },
  {
    "id": "CAL019c0feaa7217c439314772aa167d607",
    "direction": "inbound",
    "duration": 13,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252083032",
    "customer_name": "AMERICAS TIRE  ",
    "customer_city": "Danville",
    "start_time": "2026-01-30T09:19:22.358-08:00",
    "transcript": "Please hold for the next available agent. Our system shows numerous searches for your business. If Google and Google Voice clients are currently having trouble finding you."
  },
  {
    "id": "CAL019c0ff1535174a6b5a0c0e6452796e4",
    "direction": "inbound",
    "duration": 12,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252036119",
    "customer_name": "PITTSBURG CA   ",
    "customer_city": "Pittsburg",
    "start_time": "2026-01-30T09:26:39.661-08:00",
    "transcript": "Please hold for the next available agent. Our system shows numerous searches for your business. Google and mobile voice clients are currently having trouble."
  },
  {
    "id": "CAL019c0ff7d283777099384f7897759082",
    "direction": "inbound",
    "duration": 32,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252063318",
    "customer_name": "ANTIOCH CA     ",
    "customer_city": "Antioch",
    "start_time": "2026-01-30T09:33:45.444-08:00",
    "transcript": "Builders. Please hold to the next available agent. Our systems have chosen numerous searches for your business via Google and Google Voice Line are currently having trouble finding you. Press 1 to speak with an agent immediately and verify your Google listing. Again, your business is not showing correctly on Google and Google Voice Search. Press 1 to speak to an agent. Press 2 or dial 877-865-5852 to opt out."
  },
  {
    "id": "CAL019c10213a977da1bba0500aacf8bc8d",
    "direction": "inbound",
    "duration": 13,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+14694241936",
    "customer_name": "MCKINNEY TX    ",
    "customer_city": "McKinney",
    "start_time": "2026-01-30T10:18:58.860-08:00",
    "transcript": "Rhino Builders. Please hold for the next available agent."
  },
  {
    "id": "CAL019c10236d6079fca7e262dd51d7ea02",
    "direction": "inbound",
    "duration": 30,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19259545105",
    "customer_name": "WALNUT CREEK CA",
    "customer_city": "Walnut Creek",
    "start_time": "2026-01-30T10:21:23.140-08:00",
    "transcript": "Elders, please hold for the next available agent. Hello. Good morning. Hello. Hello. Good morning."
  },
  {
    "id": "CAL019c104a76b977c6b153578b69836c58",
    "direction": "inbound",
    "duration": 15,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252330929",
    "customer_name": "SUNOL CA       ",
    "customer_city": "Sunol",
    "start_time": "2026-01-30T11:04:01.424-08:00",
    "transcript": "Please hold for the next available agent."
  },
  {
    "id": "CAL019c106c4a9a728cbd89cba4a011c845",
    "direction": "inbound",
    "duration": 21,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252906377",
    "customer_name": "LIVERMORE    CA",
    "customer_city": "Livermore",
    "start_time": "2026-01-30T11:40:58.298-08:00",
    "transcript": "Builders. As a courtesy, we've called to. See if you'd like to immediately respond to this homeowner over the phone. Press one to connect. Press two to hear inquiry details. Good morning. Hello? Press one to connect. Press two to hear inquiry."
  },
  {
    "id": "CAL019c106d9f7e7410a36998402d6311ad",
    "direction": "inbound",
    "duration": 8,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+14694241936",
    "customer_name": "MCKINNEY TX    ",
    "customer_city": "McKinney",
    "start_time": "2026-01-30T11:42:25.420-08:00",
    "transcript": "For the next available agent."
  },
  {
    "id": "CAL019c10a4a4227e8ea1abd3398c248f4a",
    "direction": "inbound",
    "duration": 22,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252906377",
    "customer_name": "LIVERMORE    CA",
    "customer_city": "Livermore",
    "start_time": "2026-01-30T12:42:31.241-08:00",
    "transcript": "As a courtesy, we call to see if you'd like to immediately respond to this homeowner over the phone. Press one to connect. Press two to hear inquiry details. Hello. Good morning. Hello. Press one to connect. Press 2 to hear inquiry details."
  },
  {
    "id": "CAL019c10dd318978979a50752b0b44b209",
    "direction": "inbound",
    "duration": 24,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252906377",
    "customer_name": "LIVERMORE    CA",
    "customer_city": "Livermore",
    "start_time": "2026-01-30T13:44:17.455-08:00",
    "transcript": "As a courtesy, we've called to see if you'd like to immediately respond to. Your call is being recorded. Press 1 to connect. Press 2 to hear inquiry details. Press one to connect. Press two to hear inquiry details. Me?"
  },
  {
    "id": "CAL019c10f96d367e7c8579b9c7728a3208",
    "direction": "inbound",
    "duration": 58,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+16892231703",
    "customer_name": "ORLANDO FL     ",
    "customer_city": "Orlando",
    "start_time": "2026-01-30T14:15:07.795-08:00",
    "transcript": "To the next available agent. This call is being recorded. Hello, this is roly. Hello? Hello?"
  },
  {
    "id": "CAL019c1107a0af7f2dae76f6f446dc530d",
    "direction": "inbound",
    "duration": 59,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+17276259853",
    "customer_name": "CLEARWATER FL  ",
    "customer_city": "Clearwater",
    "start_time": "2026-01-30T14:30:38.469-08:00",
    "transcript": "Please hold for the next available agent. This call is being recorded, Sam."
  },
  {
    "id": "CAL019c1596da5575b286a98041c3a8cf56",
    "direction": "inbound",
    "duration": 9,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19258464321",
    "customer_name": "PLEASANTON CA  ",
    "customer_city": "Pleasanton",
    "start_time": "2026-01-31T11:45:33.748-08:00",
    "transcript": "Builders. We are unable to take your call at the moment. Please leave your name, phone number and a brief message."
  },
  {
    "id": "CAL019c1f3140787417be5a939667efb56a",
    "direction": "inbound",
    "duration": 33,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252063961",
    "customer_name": "ANTIOCH CA     ",
    "customer_city": "Antioch",
    "start_time": "2026-02-02T08:30:47.362-08:00",
    "transcript": "Please hold to the next available agent. This call is being recorded. Press 1 to speak with an agent immediately and verify your Google listing. If your business is not showing correctly on Google and Google voice search, press 1 to speak to an agent, press 2 or dial 877-865-5852 to opt out."
  },
  {
    "id": "CAL019c1f32958476e09fe5eaf784a775a8",
    "direction": "inbound",
    "duration": 86,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+17077124058",
    "customer_name": "MOLSONJACKSON J",
    "customer_city": "Vallejo",
    "start_time": "2026-02-02T08:32:14.669-08:00",
    "transcript": "Builders. Please hold for the next available agent. This call is being recorded."
  },
  {
    "id": "CAL019c1f3dc93e7b0f9607736a14a8d895",
    "direction": "inbound",
    "duration": 393,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252005109",
    "customer_name": "ROOS ROY       ",
    "customer_city": "Pleasanton",
    "start_time": "2026-02-02T08:44:28.824-08:00",
    "transcript": "No builders. Please hold for the next available agent. This call is being recorded. Hello, this is Roly. Yes. Hi, my name is Roy Roos and I have a house in San Ramon. And the walkway, part of the walkway has dropped about an inch and a half where it connects to the driveway. And I was hoping that I could get an estimate from you guys to lift that back up. Oh, sure thing. I just want to make sure. How many square meters, I mean, square footage does that take? The walkway, I mean. Well, the walkway. Walkway. I don't know how to explain it. It's about 2ft wide, maybe a little bit more than that, not much. And there are sec. It's in sections with control joints at about 53 inches. And I think there's a couple of sections as you put. Pick it up. It's kind of, you know, it goes back to the section behind it. Right. But the one section that actually shows something is that 53 inches long by about 2ft wide. I see. We're actually a general contractor and we take big jobs. I don't think we can take this for now. I'm really sorry. Nothing small like that, huh? Yeah. Well, there are. I have other. Some other issues. There's a small portion of the driveway that would be nice to level that out. And then there might be some foundation cracks that need to be filled. I see. Okay. I think that's. We can check out the site and let's see from there, from our project manager. When do you think is the best time for us to check the site? Well, I'm available mornings from around 10:30 to around 01:00'. Clock. All right, let me check our schedule. Hold on. Seems that we are free tomorrow at 11. Does that work? Actually, you know, that might be okay. Tomorrow at 11. I actually have. I'm getting a couple of different bids, and so I have another appointment that's a little bit earlier. So you'd be like, after them. About half an hour after they're done, I guess. Okay. All right. Can I take Your address? It's 9669 Thunderbird Drive. Thunderbird Drive in San Ramon. San Ramon. Hold on, let me double check. 9669, right? Thunderbird. All right. And what is your full name for us to put in there? Roy Roos. R O O S. Got it. All right. And this is the best number for us to call back, right? Yes. All right. And that is 925-200-5109. And what time was that again? 11, did you say? Yes, tomorrow at 11. 11. Okay. Yep. Hold on, let me see. So I have one question, though before we do all of this. If I only decide to do that walkway area. Yeah. That's going to be too. Too small for you guys to do. That would be for our project manager to decide. Okay. Because there's a water line that goes under that would need to be protected, I guess. The water line, the main water line that feeds the house. I think that's what actually caused the problem. There was a leak some time ago and it evacuated the soil underneath, I guess, some of it. And then slowly, that little section of walkway keeps going down right over the top of the water line. And I'm afraid it's going to break the water line because it's a PVC water line. I see. Okay. I'll take a note on that. Water line underneath that needs to be protected. Yeah. So, you know, I mean, I would imagine it'd be nice to put maybe, I don't know, a piece of ABS pipe over the top of that water line when you. When you inject the foam so the foam doesn't actually go all the way, you know what I mean? To keep the water line protected, if that or something like that. I don't know. I'm just thinking about that as a thought. Okay. I took a note and then I'll let. No, I'll let our project manager know. He can give you some advice once he's there. And then your email for us to send in the estimate. It's a n T o n r o S z. At att.net I'm good. It's a n c o n r. O n c t o n anton rose a n t o n a. N t o n r o s z at all right. All right. I'll have someone over there by tomorrow. 11:00Am all right, I'll be there. All right, thank you, ry. Thank you. Bye. Bye. Bye."
  },
  {
    "id": "CAL019c1f4c9b017e2d82a68a23891a83f3",
    "direction": "inbound",
    "duration": 51,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252906377",
    "customer_name": "LIVERMORE    CA",
    "customer_city": "Livermore",
    "start_time": "2026-02-02T09:00:39.979-08:00",
    "transcript": "As a courtesy, we've called. To see if you'd like to immediately respond to this homeowner over the phone. Press 1 to connect. Press 2 to hear inquiry details. Press one to connect. Press. Two to hear inquiry details. Hello, I am interest in a complete remodel of between three and six bathrooms, including a restructuring of the master bathroom walls and rejiggering of the whole room. I am interested in getting quotes ASAP. Thanks. Press one to connect. Press two to hear inquiry details. Please wait while how. 526-443-06 is not available."
  },
  {
    "id": "CAL019c1f5667947d82a1325bd955fd5615",
    "direction": "inbound",
    "duration": 12,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252776941",
    "customer_name": "BISHOP RANCH CA",
    "customer_city": "Bishop Ranch",
    "start_time": "2026-02-02T09:11:22.226-08:00",
    "transcript": "Builders. Please hold for the next available agent."
  },
  {
    "id": "CAL019c1f708dee73608d36f98ad1bcfbed",
    "direction": "inbound",
    "duration": 198,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15125295988",
    "customer_name": "HOLMES REGINA  ",
    "customer_city": "Manchaca",
    "start_time": "2026-02-02T09:39:55.983-08:00",
    "transcript": "Please hold for the next available agent. Hello? Good morning. Hi. I'm calling because we have a few house projects that I wanted to get a quote on. Like, we wanted the walls inside painted, and then we have an outside deck that leaks a lot of water that we wanted to get a roof put on or something. Kind of see what y' all think is best. And then we have another area that has a similar problem. You mentioned that it's like multiple houses or a few houses. No, it's one house, but multiple projects in the same house. Oh, I see. Okay. All righty. So basically, so you can you repeat the. The scope of work that needs to be done. We want to get the walls inside painted. I really want to redo our bathroom. Closet doors. And then outside we have a patio and the wood needs a roof on top. Oh, got it. And how big is that structure that needs a roof on top? Do you know, like, the mastermind? I don't, but if someone can come out and give us a quote, that would be best because I don't know anything about it. All right, and what city are you located? Pleasant Hill. Pleasant Hill. Okay. All right, hold on a second. Let me check my calendar. One second. Oh, it's already February. Okay, I know how time flies. We do have an opening on Wednesday the 4th at 10 o'. Clock. Will that work? Yeah. Okay. All right, perfect. And can I get your first and last name, please? Regina holmes. Your homes is h o l m e s. Correct again. What's the property address, regina? It's 68 exiter e x e t e r lane 94523. All right, and also, what's a good phone number to reach you? 512-529-5988. So 512-529-5988. Correct? Correct. Okay. And lastly, what's your email address? It's happy h a p p y g g I g I 2020 mail dot com. All right, this happy gg20mail dot com correct? Yes. Okay, perfect. All right, so I'm going to set you up for Wednesday at 10 o' clock and you'll get a text confirmation for this appointment. All right, great. Thank you. Thank you so much. You have a wonderful day. You too. Bye. Bye."
  },
  {
    "id": "CAL019c1fb1b452750ba3aec5b695aabe29",
    "direction": "inbound",
    "duration": 62,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19253302102",
    "customer_name": "A WINDHURST",
    "customer_city": "Walnut Creek",
    "start_time": "2026-02-02T10:51:05.369-08:00",
    "transcript": "Builders. Please hold for the next available agent. Hello. Good morning. Yes, is this Rhino Builders or Development? Yes, it is. Mino is colleague. My name is Louis. I live in the Rinda area. And that house you had on Overhill, I see, is fencing up. Is that still your project or. Unfortunately, it's no longer our project. Okay. Did that go back to a bank or a lender? Honestly, I don't have any idea about that. Okay. I was gonna, you know, see who I could buy it from and finish it out as a general contractor myself, but maybe I will do a property search and see comes up with. Yes, that will be good. Okay, thank you. Thank you."
  },
  {
    "id": "CAL019c1fb709f97eb5b2f8b5bdbaed63a4",
    "direction": "inbound",
    "duration": 28,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252670789",
    "customer_name": "PITTSBURG CA   ",
    "customer_city": "Pittsburg",
    "start_time": "2026-02-02T10:56:55.256-08:00",
    "transcript": "Builders, please hold for the next available agent. Hello? Good. Hello? Hello. Good morning."
  },
  {
    "id": "CAL019c1fccccfe78ad887309dd5c852288",
    "direction": "inbound",
    "duration": 20,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252083032",
    "customer_name": "AMERICAS TIRE  ",
    "customer_city": "Danville",
    "start_time": "2026-02-02T11:20:41.425-08:00",
    "transcript": "Please hold for the next available agent. Our system shows numerous searches for your business via Google and Google Voice. Clients are currently having trouble finding you. Press 1 to speak with any agent immediately and verify your Google listing. Again, your business is not showing correctly on Google and Google."
  },
  {
    "id": "CAL019c1fdd326278f4af29344b20650606",
    "direction": "inbound",
    "duration": 16,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252086505",
    "customer_name": "DANVILLE CA    ",
    "customer_city": "Danville",
    "start_time": "2026-02-02T11:38:35.968-08:00",
    "transcript": "Please hold for the next available agent logging your Google business account. Our assistant shows numerous searches for your business via Google and Google Voice clients are currently having trouble finding you. Press 1 to speak with an agent immediately and verify your Google listing."
  },
  {
    "id": "CAL019c1ff36b207f4da329adb49abf1e4f",
    "direction": "inbound",
    "duration": 59,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19452033594",
    "customer_name": "SCURRY TX      ",
    "customer_city": "Scurry",
    "start_time": "2026-02-02T12:02:52.286-08:00",
    "transcript": "The next available agent. Hello. Good afternoon. Hello. It."
  },
  {
    "id": "CAL019c1ff6476174d8a23055323decc9f0",
    "direction": "inbound",
    "duration": 12,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252809127",
    "customer_name": "WALNUT CREEK CA",
    "customer_city": "Walnut Creek",
    "start_time": "2026-02-02T12:05:59.738-08:00",
    "transcript": "Please hold for the next available agent."
  },
  {
    "id": "CAL019c1ffd6a6877e39087f8abc58551d1",
    "direction": "inbound",
    "duration": 68,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15868037321",
    "customer_name": "UTICA MI       ",
    "customer_city": "Utica",
    "start_time": "2026-02-02T12:13:47.462-08:00",
    "transcript": "Hello? Good afternoon. Yes, Hi, my name is Ryan. I'm with Woodland Direct Fireplace Company. Am I speaking with Roli? Roli? Hold on a second. Let me just double. Oh, she's on her break right now. Oh, is that right? Okay. Yeah, try. Try to call her back at around 11 10pm 1 10. And let me give you her direct line. Hold on second. Alrighty. One second here. What number did you dial, by the way? Sure. N2554. So 9. 2. Yeah, so 925-230-2554. Okay. Yeah, you can dial that number and she'll probably accept that call after when she gets in. Okay, sounds good. Well, thank you. I hope you have a great day. Thank you. Okay, bye. Bye. Bye."
  },
  {
    "id": "CAL019c20040a067b3c83acbb4a1176dbec",
    "direction": "inbound",
    "duration": 13,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252033522",
    "customer_name": "PITTSBURG CA   ",
    "customer_city": "Pittsburg",
    "start_time": "2026-02-02T12:21:01.541-08:00",
    "transcript": "Please hold for the next Google Business Listing. Your Google Business listing has been flagged for review by the Business Listing Specialist to avoid any suspension or verification issues."
  },
  {
    "id": "CAL019c200a1b717da280eec12e9fa3ab31",
    "direction": "inbound",
    "duration": 12,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252031003",
    "customer_name": "PITTSBURG CA   ",
    "customer_city": "Pittsburg",
    "start_time": "2026-02-02T12:27:39.205-08:00",
    "transcript": "Please hold for the next available agent. Your Google business account. Our system shows new web searches for your business because Google and Google Voice clients are currently having trouble finding you."
  },
  {
    "id": "CAL019c202335027669b66a4e96fb72d23a",
    "direction": "inbound",
    "duration": 15,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252063961",
    "customer_name": "ANTIOCH CA     ",
    "customer_city": "Antioch",
    "start_time": "2026-02-02T12:55:04.140-08:00",
    "transcript": "Please hold for the next available agent. Our system shows numerous searches for your business via Google and Google Voice. Clients are currently having trouble finding you. Press 1 to speak with an agent immediately and."
  },
  {
    "id": "CAL019c2042bba776da9da6cf15ff163fde",
    "direction": "inbound",
    "duration": 33,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+19252063961",
    "customer_name": "ANTIOCH CA     ",
    "customer_city": "Antioch",
    "start_time": "2026-02-02T13:29:30.243-08:00",
    "transcript": "To the next available agent. This call is being recorded. Press 1 to speak with an agent immediately and verify your Google listing. Again, your business is not showing correctly on Google and Google Voice Search. Press 1 to speak to an agent. Press 2 or dial 877-865-5852 to opt out. Hello, this is Roly."
  },
  {
    "id": "CAL019c2067013f723798978d3ea8f7ed0b",
    "direction": "inbound",
    "duration": 78,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15627529415",
    "customer_name": "NORWALK CA     ",
    "customer_city": "Norwalk",
    "start_time": "2026-02-02T14:09:07.343-08:00",
    "transcript": "Please hold for the next available agent. This call is being recorded. Why is he so tiny? Hello, this is Rolly. Hi, good afternoon. This is Aisha with TRV Engineers. How are you? I'm good, yes. How may I help you? Yeah, I was just calling to see if you're interested in engineering services. Oh, we already have that. We have two already. But if you can set in your company details, I would be glad to. Sure. I'll leave an email for you. It should be at office off I C E at Rhino, the animal builders with an s.1989.com. And then we'll take a review. 1989.Com. Yeah. Got it. Thank you so much. All right, thank you. Bye. Bye."
  },
  {
    "id": "CAL019c20a918257bd89c80486d7aa1539a",
    "direction": "inbound",
    "duration": 22,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+15104476176",
    "customer_name": "RICHMOND CA    ",
    "customer_city": "Richmond",
    "start_time": "2026-02-02T15:21:18.600-08:00",
    "transcript": "To the next available agent. This call is being recorded. Hello? Is this rolly?"
  },
  {
    "id": "CAL019c20d9a5ef75f291852184fb051169",
    "direction": "inbound",
    "duration": 100,
    "answered": true,
    "voicemail": false,
    "customer_phone": "+18052653030",
    "customer_name": "FILLMORE CA    ",
    "customer_city": "Fillmore",
    "start_time": "2026-02-02T16:14:20.621-08:00",
    "transcript": "Rhino Builders. Please hold for the next available agent. This call is being recorded. Hello, this is Rolly. Hey, this is Kevin with Innodes Engineering. How are you doing today? Oh, good. Yeah. How may I help you? Yeah, Marilli, I was just reaching out to see if you all have any new projects that require MEP or structure or Civil Engineering. You may remember we've worked with your firm in the past, sent over proposals, so just wanted to see if you currently have anything in the works this year. Oh, right now? No, we are good now with our projects and our subs. But thanks for the call. Yeah, absolutely. We look forward to working with you if you have anything in the future. Thanks, Marlo. Have a good one. Bye. You too. Bye."
  }
]